{
  "url": "https://en.wikipedia.org/wiki/Zionist_Occupation_Government_conspiracy_theory",
  "title": "Zionist Occupation Government conspiracy theory",
  "text": "The Zionist Occupation Government, Zionist Occupational Government, or Zionist-Occupied Government (ZOG), sometimes also called the Jewish Occupational Government (JOG), is an antisemitic conspiracy theory claiming that Jews secretly control the government of the United States. More recent versions apply it to the governments of other countries. ZOG is often directly personified as the Anti-Defamation League. \nThe concept of the \"Zionist Occupation Government\" and the acronym \"ZOG\" were coined in a 1976 article by the neo-Nazi activist Eric Thomson. The concept was further developed and spread in the 1970s by American white supremacists, particularly Christian Identity activists, before being imported into Europe. The highly publicized criminal actions of the neo-Nazi group the Order resulted in the terminology rising in popularity among white supremacists.\nThe expression is used by white supremacist, white nationalist, far-right, or antisemitic groups in Europe and the U.S. Some contemporary militant, authoritarian, and theocratic Islamist and Islamic extremist organizations, including Salafi-jihadist groups, have also used the term \"ZOG\" in propaganda campaigns. The word Zionist in \"Zionist Occupation Government\" is used to equate being Jewish with the ideology of Zionism. The theory thus depicts Zionists as conspiring for Jews and Israel to control the world.\n\n\n== Conspiracy ==\nThe ZOG conspiracy theory is that Jews secretly control the government of the United States. Later versions apply it to other countries. Kaplan defined it further as \"a deeply Manichaean conceptualization of the federal government and of what is seen as its Jewish puppeteers\", who are often directly personified as the Anti-Defamation League, due to its many conflicts with the neo-Nazi movement. Believers in ZOG see it as a secret, all-powerful government entity, sometimes of the whole world. Alternate names for it include Zionist Occupational Government, Zionist-Occupied Government, and Jewish Occupational Government (JOG). \nIn 2000, scholar Jeffrey Kaplan called ZOG \"at once the most caricatured and the most characteristic facet of the American radical right wing today\". He wrote that it was the reification of the neo-Nazi movement's \"perception of unremitting persecution\". He described it as emphasizing the neo-Nazi movement's \"feeling of helplessness that is reflected in the ZOG discourse—a vision of a movement that sees itself as relentlessly persecuted by the inextricable forces of the state and the Jews, as personified in particular by the ADL.\"\nThe association of Jews with the control of economic forces is a modern resurgence of an old stereotype, that of the \"greedy Jewish merchant\", present in the Christian world since the Middle Ages. The conspiracy theory illustrates a specifically American far-right agrarian preoccupation, namely the possibility of extinction allegedly faced by the rural world, seen as the backbone of America, a danger caused by a remote, centralized, power-hungry metropolitan elite corrupted by \"alien\" influences. ZOG is an evolution of early conspiracy theories of Jewish control of the world. \nActivists imagine a variety of plots related to the original conspiracy theory—for instance, that as many as 4,000 Jews were warned of the September 11 attacks. Believers also claim that ZOG-like forces control U.S. foreign policy. Most ZOG theories involve the idea of Jewish power over finance or banking, such as control of the Federal Reserve.\n\n\n== History ==\n\n\n=== Background ===\n\nIn late 19th-century France, the insinuation that Jews controlled the French government was commonplace in anti-republican discourse. Early ideological influences on the conspiracy include the antisemitic The Dearborn Independent and the forged tract The Protocols of the Learned Elders of Zion.\nThe origins of the ZOG idea specifically are connected to the U.S. civil rights landscape and particularly Jewish anti-hate activist groups. In an effort to sto",
  "fetched_at": "2026-02-09T05:48:10.920877"
}