{
  "url": "https://en.wikipedia.org/wiki/Genealogy_of_Jesus",
  "title": "Genealogy of Jesus",
  "text": "The New Testament provides two accounts of the genealogy of Jesus, one in the Gospel of Matthew and another in the Gospel of Luke. Matthew starts with Abraham and works forwards, while Luke works back in time from Jesus to Adam. The lists of names are identical between Abraham and David (whose royal ancestry affirms Jesus' Messianic title Son of David), but differ radically from that point. Matthew has twenty-seven generations from David to Joseph, whereas Luke has forty-two, with almost no overlap between them or with other known genealogies.⁠ They also disagree on who Joseph's father was: Matthew says he was Jacob, while Luke says he was Heli.\nEarly Christian scholars (starting with Africanus and Eusebius) take both lineages to be true, offering various explanations for their divergence. For instance, one (usually Matthew's) may be taken to be the lineage of Joseph and the other (usually Luke's) of Mary, or one may be Jesus' customary legal lineage and the other his biological blood lineage. These versions can also fit the gospels' simultaneous account of Jesus' virgin birth of Mary alone, with Joseph being merely his legal adoptive father; both Joseph and Mary are taken to be David's descendants. Levirate marriage, through which an individual (such as Joseph) may have two legal fathers, can also serve these explanations. However, some modern critical scholars like Marcus Borg and John Dominic Crossan state that both genealogies are inventions, constructed to bring the Messianic claim into conformity with Jewish criteria.\n\n\n== Matthew's genealogy ==\n\nMatthew 1:1–17 begins the Gospel with \"A record of the origin of Jesus Christ, the son of David, the son of Abraham: Abraham begot Isaac, ...\" and continues on until \"... Jacob begot Joseph, the husband of Mary, of whom was born Jesus, who is called Christ. Thus there were fourteen generations in all from Abraham to David, fourteen from David to the exile to Babylon, and fourteen from the exile to the Christ.\"\nMatthew emphasizes, right from the beginning, Jesus' title Christ—the Greek rendering of the Hebrew title Messiah—meaning anointed, in the sense of an anointed king. Jesus is presented as the long-awaited Messiah, who was expected to be a descendant of King David. Matthew begins by calling Jesus the son of David, indicating his royal origin, and also son of Abraham, indicating that he was an Israelite; both are stock phrases, in which son means descendant, calling to mind the promises God made to David and to Abraham.\nMatthew's introductory title (Ancient Greek: βίβλος γενέσεως, romanized: bíblos genésseos, book of generations) has been interpreted in various ways, but most likely is simply a title for the genealogy that follows, echoing the Septuagint use of the same phrase for genealogies.\n\nMatthew's genealogy is considerably more complex than Luke's. It is overtly schematic, organized into three sets of fourteen, each of a distinct character:\n\nThe first is rich in annotations, including four mothers and mentioning the brothers of Judah and the brother of Perez.\nThe second spans the Davidic royal line, but omits several generations, ending with \"Jeconiah and his brothers at the time of the exile to Babylon.\"\nThe last, which appears to span only thirteen generations, connects Joseph to Zerubbabel through a series of otherwise unknown names, remarkably few for such a long period.\nThe total of 42 generations is achieved only by omitting several names, so the choice of three sets of fourteen seems deliberate. Various explanations have been suggested: fourteen is twice seven, symbolizing perfection and covenant, and is also the gematria (numerical value) of the name David.\nThe rendering into Greek of Hebrew names in this genealogy is mostly in accord with the Septuagint, but there are a few peculiarities. The form Asaph seems to identify King Asa with the psalmist Asaph. Likewise, some see the form Amos for King Amon as suggesting the prophet Amos, though the Septuagint does ",
  "fetched_at": "2026-02-09T02:52:40.868471"
}