{
  "url": "https://en.wikipedia.org/wiki/Geʽez",
  "title": "Geʽez",
  "text": "Geʽez ( or ; ግዕዝ Gəʽ(ə)z [ˈɡɨʕ(ɨ)z] , and sometimes referred to in scholarly literature as Classical Ethiopic) is an ancient South Semitic language. The language originates from what is now known as Ethiopia and Eritrea.\nAs of today, Geʽez is used as the main liturgical language of the Ethiopian Orthodox Tewahedo Church, the Eritrean Orthodox Tewahedo Church, the Ethiopian Catholic Church, the Eritrean Catholic Church, and the Beta Israel Jewish community.\nHawulti Obelisk is an ancient pre-Aksumite obelisk located in Matara, Eritrea. The monument dates to the early Aksumite period and bears an example of the ancient Geʽez script.\nIn one study, Tigre was found to have a 71% lexical similarity to Geʽez, while Tigrinya had a 68% lexical similarity to Geʽez, followed by Amharic at 62%. Most linguists believe that Geʽez does not constitute a common ancestor of modern Ethio-Semitic languages but became a separate language early on from another hypothetical unattested common language.\n\n\n== Phonology ==\n\n\n=== Vowels ===\n\nHistorically, /ɨ/ has a basic correspondence with Proto-Semitic short *i and *u, /æ ~ ɐ/ with short *a, the vowels /i, u, a/ with Proto-Semitic long *ī, *ū, *ā respectively, and /e, o/ with the Proto-Semitic diphthongs *ay and *aw. In Geʽez there still exist many alternations between /o/ and /aw/, less so between /e/ and /aj/, e.g. ተሎኩ taloku ~ ተለውኩ talawku (\"I followed\").\nIn the transcription employed by the Encyclopaedia Aethiopica, which is widely employed in academia, the contrast here represented as a/ā is represented as ä/a.\n\n\n=== Consonants ===\n\n\n==== Transliteration ====\nGeʽez is transliterated according to the following system (see the phoneme table below for IPA values):\n\nBecause Geʽez is no longer spoken in daily life by large communities, the early pronunciation of some consonants is not completely certain. Gragg writes that \"[t]he consonants corresponding to the graphemes ś (Geʽez ሠ) and ḍ (Geʽez ፀ) have merged with ሰ and ጸ respectively in the phonological system represented by the traditional pronunciation—and indeed in all modern Ethiopian Semitic. ... There is, however, no evidence either in the tradition or in Ethiopian Semitic [for] what value these consonants may have had in Geʽez.\"\n\nA similar problem is found for the consonant transliterated ḫ. Gragg notes that it corresponds in etymology to velar or uvular fricatives in other Semitic languages, but it is pronounced exactly the same as ḥ in the traditional pronunciation. Though the use of a different letter shows that it must originally have had some other pronunciation, what that pronunciation was is not certain.\nThe chart below lists /ɬ/ and /t͡ɬʼ/ as possible values for ś (ሠ) and ḍ (ፀ) respectively. It also lists /χ/ as a possible value for ḫ (ኀ). These values are tentative, but based on the reconstructed Proto-Semitic consonants that they are descended from.\n\n\n==== Phonemes of Geʽez ====\nThe following table presents the consonants of the Geʽez language. The reconstructed phonetic value of a phoneme is given in IPA transcription, followed by its representation in the Geʽez script and scholarly transliteration.\n\n\n==== Geʽez consonants in relation to Proto-Semitic ====\nGeʽez consonants have a triple opposition between voiceless, voiced, and ejective (or emphatic) obstruents. The Proto-Semitic \"emphasis\" in Geʽez has been generalized to include emphatic p̣ /pʼ/. Geʽez has phonologized labiovelars, descending from Proto-Semitic biphonemes. Geʽez ś ሠ Sawt (in Amharic, also called śe-nigūś, i.e. the se letter used for spelling the word nigūś \"king\") is reconstructed as descended from a Proto-Semitic voiceless lateral fricative [ɬ]. Like Arabic, Geʽez merged Proto-Semitic š and s in ሰ (also called se-isat: the se letter used for spelling the word isāt \"fire\"). Apart from this, Geʽez phonology is comparably conservative; the only other Proto-Semitic phonological contrasts lost may be the interdental fricatives and ghayn.\n\n\n=== Stress ===\nThere is no evi",
  "fetched_at": "2026-02-09T05:47:05.927057"
}