{
  "url": "https://en.wikipedia.org/wiki/Tigrinya_grammar",
  "title": "Tigrinya grammar",
  "text": "This article describes the grammar of Tigrinya, a South Semitic language which is spoken primarily in Eritrea and Ethiopia, and is written in Ge'ez script.\n\n\n== Nouns ==\n\n\n=== Gender ===\nLike other Afro-Asiatic languages, Tigrinya has two grammatical genders, masculine and feminine, and all nouns belong to either one or the other. Grammatical gender in Tigrinya enters into the grammar in the following ways:\n\nVerbs agree with their subjects in gender (unless the subject is first person).\nSecond and third person personal pronouns (you, he, she, they, etc. in English) are distinguished by gender.\nAdjectives and determiners agree with the nouns they modify in gender.\nSome noun pairs for people distinguish masculine and feminine by their endings, with the feminine signaled by t. These include agent nouns derived from verbs — ከፈተ käfätä 'open', ከፋቲ käfati 'opener (m.)', ከፋቲት käfatit 'opener (f.)' — and nouns for nationalities or natives of particular regions — ትግራዋይ tǝgraway 'Tigrean (m.)', ትግራወይቲ tǝgrawäyti 'Tigrean (f.)'.\nGrammatical gender normally agrees with biological gender for people and animals; thus nouns such as ኣቦ ’abbo 'father', ወዲ wäddi 'son, boy', and ብዕራይ bǝ‘ǝray 'ox' are masculine, while nouns such as ኣደ addä 'mother', ጓል gʷal 'daughter, girl', and ላም lam or ላሕሚ lah.mi 'cow' are feminine.  However, most names for animals do not specify biological gender, and the words ተባዕታይ täba‘tay 'male' and ኣንስተይቲ anǝstäyti must be placed before the nouns if the gender is to be indicated.\nThe gender of most inanimate nouns is not predictable from the form or the meaning. Grammars sometimes disagree on the genders of particular nouns; for example, ጸሓይ ṣäḥay 'sun' is masculine according to Leslau, feminine according to Amanuel. This disagreement seems to be due to dialectal differences.\n\n\n=== Number ===\nTigrinya has singular and plural number, but nouns that refer to multiple entities are not obligatorily plural.  That is, if the context is clear, a formally singular noun may refer to multiple entities: ሓሙሽተ ḥammuštä 'five', ሰብኣይ säb’ay 'man', ሓሙሽተ ሰብኡት ḥammuštä säbut, 'five men'.  It is also possible for a formally singular noun to appear together with plural agreement on adjectives or verbs: ብዙሓት bǝzuḥat 'many (pl.)', ዓዲ ‘addi 'village'; ብዙሓት ዓዲ bǝzuḥat ‘addi 'many villages'.  The conventions for when this combination of singular and plural is or is not possible appear to be complex.\nAs in Arabic, Tigre, and Ge'ez, noun plurals are formed both through the addition of suffixes to the singular form (\"external\" plural) and through the modification of the pattern of vowels within (and sometimes outside) the consonants that make up the noun root (\"internal\" or \"broken\" plural).\nIn some cases suffixes may also be added to an internal plural.\nThe most common patterns are as follows.  In the designation of internal plural patterns, \"C\" represents one of the consonants of the noun root.  Note that some nouns (for example, ዓራት ‘arat 'bed') have more than one possible plural.\n\nExternal plural\n-at, -tat\nዓራት ‘arat 'bed', ዓራታት(ዓራውቲ) ‘aratat 'beds'\nእምባ ǝmba 'mountain', እምባታት ǝmbatat 'mountains'\n-ot (following deletion of -a or -ay)\nጐይታ gʷäyta 'master', ጐይቶት gʷäytot 'masters'\nሐረስታይ ḥarästay 'farmer', ሐረስቶት ḥarästot 'farmers'\n-ǝtti, -wǝtti (sometimes with deletion of final -t)\nገዛ gäza 'house', ገዛውቲ gäzawǝtti 'houses'\nዓራት ‘arat 'bed', ዓራውቲ ‘arawǝtti 'beds'\nInternal plural\n’aCCaC\nፈረስ färäs 'horse', አፍራሰ ’afras 'horses'\nእዝኒ ’ǝzni 'ear', እእዛን ’a’zan 'ears'\n’aCaCǝC\nንህቢ nǝhbi 'bee', አናህብ ’anahǝb 'bees'\nበግዕ bäggǝ‘ 'sheep' (s.), አባጊዕ ’abagǝ‘ 'sheep' (p.)\nCäCaCu\nደርሆ därho 'chicken', ደራሁ därahu 'chickens'\nጕሒላ gʷǝḥila 'thief', ጕሓሉ(?) gʷǝḥalu 'thieves'\nC{ä,a}CaCǝC\nመንበር mänbär 'chair', መናብር mänabǝr 'chairs'\nሐርማዝ ḥarmaz 'elephant', ሐራምዝ ḥaramǝz 'elephants'\n...äCti for the plural of agent and instrument nouns derived from verbs\nቀላቢ k'ällabi 'feeder', ቀለብቲ k'älläbti 'feeders'\nአገልጋሊ ’agälgali 'server', አገልገልቲ ’agälgälti 'servers'\nመኽደኒ mäxdäni 'cover', መኽደንቲ (?) m",
  "fetched_at": "2026-02-09T06:18:48.408315"
}