{
  "url": "https://en.wikipedia.org/wiki/List_of_Persona_5_characters",
  "title": "List of Persona 5 characters",
  "text": "Persona 5, a 2016 role-playing video game by Atlus, is set in Tokyo beginning in April of the year \"20XX\". It centers on the Phantom Thieves of Hearts, a masked vigilante group of high-school students working to change people's hearts and have them confess their crimes. They do this by defeating a physical manifestation of their subconscious in a mysterious realm known as the Metaverse, accessed through a mobile app on their smartphones. The playable characters can be controlled in the game's many locations, such as \"Palaces\", which are created by people with great desires and a distorted perception of the world.\nThe player character is a silent protagonist codenamed Joker, a high school student who moves to Tokyo after being falsely accused of assault and expelled from his former school, and later forms the Phantom Thieves and becomes its leader. He forms it with Morgana, a mysterious cat-like creature who is the Thieves' second-in-command and guide in the Metaverse, who wants to discover his origins and restore his true form, and Ryuji Sakamoto, who is seen as a delinquent at his school due to an incident involving his former track team. Over time, more characters join the group, including fashion model Ann Takamaki, art prodigy Yusuke Kitagawa, student-council president Makoto Niijima, hacker and foster daughter of Sojiro Sakura, Futaba Sakura and business heiress Haru Okumura. Also interacting with Joker are Goro Akechi, a high-school student and ace detective; Sae Niijima, a public prosecutor and Makoto's older sister; and Igor and his assistants, Caroline and Justine, who are residents of the Velvet Room.\nMany of the game's characters represent the tarot's Major Arcana suit. Although the suit has twenty-two cards and Royal-exclusive characters account for two additional alternate Arcana for a total of twenty-four, only twenty-one (twenty-three in Royal) are represented by characters; the last one, The World, is given at a later point in the game. The seven deadly sins are a recurring theme within the game, with certain characters and situations representing them.\n\n\n== Creation and design ==\nThe game's character design and setting distinguish it from previous entries in the series, replacing Persona 4's yellow-and-green palette with reds and blacks. As with Persona 3 and Persona 4, its characters were designed by Shigenori Soejima. In an interview, Soejima said that he could not design the characters without the game's theme and plot being set first, so he was given detailed instructions from the producer during the process. He also worked on the color scheme and overall visual presentation. In addition to casual and school apparel, each of the Phantom Thieves have their own thematic costumes with masks when in the Metaverse, as well as codenames.\n\n\n== The Phantom Thieves of Hearts ==\n\n\n=== Founding Members ===\nJoker (ジョーカー, Jōkā)\nVoiced by: Jun Fukuyama (Japanese); Xander Mobus (English)\nThe protagonist, who as a Phantom Thief goes by the codename \"Joker\", is the game's main playable character. He is a second-year high school student who gets expelled after being falsely accused of assault by a corrupt politician. As a result, he leaves his hometown and moves in with a family friend in Tokyo to serve a one-year probation. Upon transferring to a new school, he and several other students awaken to a supernatural power known as the Persona. Soon after, they form a vigilante group known as the Phantom Thieves of Hearts to explore the Metaverse, a metaphysical realm consisting of the physical manifestations of humanity's subconscious desires, and remove malevolent intent from people's hearts.\nHe holds the \"Wild Card\", an ability that allows him to hold more than one Persona and fuse together Personas to create new ones. His original Persona is Arsène, based on Arsène Lupin, of the Fool Arcana and he fights using knives and handguns. His ultimate Persona is Satanael, the Gnostic equivalent of the devil, a deity who can harness",
  "fetched_at": "2026-02-09T05:55:01.450147"
}