{
  "url": "https://en.wikipedia.org/wiki/Thomas_Tomkinson",
  "title": "Thomas Tomkinson",
  "text": "Thomas Tomkinson (1631–1710) was an English Muggletonian writer born at Ilam, near Dovedale, in Staffordshire. His parents, Richard and Ann, farmed at Sladehouse and Thomas took over the business as a yeoman farmer even while his father was alive. His faith was initially Presbyterian but in 1661 he read a book by Laurence Clarkson (presumably The Lost Sheep Found) and became attracted to Muggletonianism. Earlier, in February 1652, he had had a revelatory experience similar to the one Lodowicke Muggleton reported in 1650 but without any experience of the direct voice of God which had come to John Reeve and which was the foundation experience of Muggletonianism. Since John Reeve died in 1658, these dates mean that Tomkinson was one of the first prominent Muggletonian personalities not to have known Reeve personally.\n\n\n== Life ==\nTomkinson visited London, where he met Lodowicke Muggleton on Mayday 1662. He returned to Staffordshire and married, Ann, shortly afterwards. He converted a sizeable number of family, friends and neighbours to the new faith, enough to make himself a nuisance to the parish authorities. He said he managed to keep the peace only \"through a little money and friendship\". On 9 December 1664 he was blessed by Lodowicke Muggleton. In 1674 he found himself in serious trouble on account of his beliefs and, to evade arrest, contemplated emigrating to the New England Colonies. He was talked out of it by Muggleton.\nAround 1680 he moved permanently to London. It is unclear how he made his living. Part of the time he followed Muggleton's trade of tailoring but he also had plans to wholesale cheese and butter in the capital. He still signed his writings, however, as from Sladehouse. On 10 July 1684, Thomas and Ann's daughter, Anne, was blessed by Lodowicke Muggleton.\nLodowicke Muggleton died in 1698 and Tomkinson is credited by Professor William M. Lamont as \"the man who prevented the religion from imploding after Muggleton's death\" which is what Muggleton himself thought would happen. He is thus crucial to how a small sect survived. Tomkinson was Muggleton's literary executor, preparing and editing Muggleton's autobiographical \"Acts of the Witnesses\" leaving out some of the more contested astronomical assertions. Tomkinson is quite open in his introduction as to the deletions he made.\nThomas Tomkinson died in London in 1710 and was succeeded as unofficial leader of the Muggletonians by Arden Bonell (? – 1746)\n\n\n== Ideas ==\nTomkinson's conversion experience had been a difficult one. \"What a great deal of pain to please the unsatisfied fancy of one particular man,\" Muggleton had grumbled. Tomkinson had been attracted to Muggletonianism by the radical humanity of their God. Every Muggletonian agreed God was the man Christ Jesus; necessarily and sufficiently. One of Tomkinson's subsequent books was called None but Christ. But it mattered intensely to him that Christ had not known of his divinity while on Earth, else his humanity was inauthentic. John Reeve had inclined to think Christ had awareness, at least at some stage. But, \"Mr Clarkson in his Wonder of Wonders said he did not know himself to be the only God.\" Muggleton affected sagely indifference. For Tomkinson, Christ had lived, died and lain in a grave for three days entirely as a man. By what power, then, did this man ascend to heaven? There has to be an answer else the crucifixion is the final death of God: indeed, God's suicide. The standard Muggletonian reply is that during Christ's sojourn on Earth, the affairs of heaven were managed by Elijah (perhaps in partnership with Moses and Enoch). Elijah had temporary control of God's prerogative power, easily adequate to a resurrection and glorious return. Such a view seems to fit nicely with the transfiguration story. It also explains the crowd at the crucifixion crying out, \"Behold, he calleth Elias.\" But the monotheism of the whole enterprise is dangerously compromised. On one hand, there is a God in the form of t",
  "fetched_at": "2026-02-09T05:54:22.389041"
}