{
  "url": "https://en.wikipedia.org/wiki/Qumran_Caves",
  "title": "Qumran Caves",
  "text": "The Qumran Caves (Arabic: كهوف قمران Kuhūf Qumrān; Hebrew: מערות קומראן HaMeara Kumran) are a series of caves, both natural and artificial, found around the archaeological site of Qumran in the Judaean Desert. It is in these caves that the Dead Sea Scrolls were discovered.\nIsrael Nature and Parks Authority took over the site following the end of the 1967 war, when Israel occupied the West Bank and seized Qumran. Israel has since invested heavily in the area to establish the Qumran caves as a site of \"uniquely Israeli Jewish heritage\". The caves are recognized in Israel as a National Heritage Site, despite the caves being in occupied Palestinian territories; as such, the designation has drawn criticism.\n\n\n== Caves ==\nThe limestone cliffs above Qumran contain numerous caves that have been used over the millennia: the first traces of occupation are from the Chalcolithic period then onward to the Arab period. The artificial caves relate to the period of the settlement at Qumran and were cut into the marl bluffs of the terrace on which Qumran sits.\n\n\n=== Artificial caves ===\nThe artificial marl-cut caves at Qumran were hewn during the site's late Second Temple occupation. This began in the Hasmonean phase, in the late 2nd to early 1st century BCE, and continued in use through the Herodian period. The caves were contemporaneous with the Qumran settlement on the terrace, and they were functionally linked to it.\n\nIn all there are ten marl cut caves in the near vicinity of Qumran: 4Qa, 4Qb, 5Q, 7Q, 8Q, 9Q, 10Q, an oval cave west of 5Q, and two caves to the north in a separate ravine. Their location necessitates a direct connection with the Qumran settlement. The three caves at the end of the esplanade could only be accessed via the settlement. These caves are thought to have been cut for storage and habitation. The artificial caves at Qumran were cut into soft, rapidly weathering marl of the Lisan Formation, which made excavation easy but led to erosion and collapse. The marl-cut caves on the terrace where caves 7Q, 8Q and 9Q were recorded survive only as eroded, partially collapsed remains.\n4Q, which is now visible from the Qumran esplanade, is actually two caves, one adjacent to the other. De Vaux referred to them as 4a and 4b. When the Ta'amireh removed all the fragments they could before Harding's arrival, there was no way to tell which scrolls belonged to which cave, so they were later all catalogued simply as from 4Q. In excavating the caves hundreds of fragments were still to be found in 4a while only two or three fragments in 4b. 4a was 8 meters long and 3.25 meters wide with tapering walls reaching 3 meters in height.\n\n\n== Dead Sea Scrolls Discovery ==\n\nIn late 1946 or early 1947, a Bedouin boy of the Ta'amireh tribe, Muhammid Ahmed el-Hamed called edh-Dhib (the wolf), found a cave after searching for a lost animal. He stumbled onto the first cave containing old scrolls. More Ta'amireh visited the cave and scrolls were taken back to their encampment. They were shown to Mar Samuel of the Syriac Orthodox Church in April 1947 who realised their significance and the discovery of the Dead Sea Scrolls was made known. The location of the cave was not revealed for another 18 months, but eventually a joint investigation of the cave site was led by Roland de Vaux and Gerald Lankester Harding from 15 February to 5 March 1949.\nThe interest in the scrolls with the hope of money from their sale initiated a long area-wide search by the Ta'amireh to find more such scrolls, the first result of which was the discovery of four caves in Wadi Murabba'at about 15 km (9.3 mi) south of Qumran in 1951. In the Qumran area another cave was discovered, now referred to as Cave 2Q (1Q was the first scroll-bearing cave), in February 1952. However, only a few fragments were found in the cave. Fear of the destruction of archaeological evidence with the discovery of caves by the Bedouin led to a campaign by the French and American Schools to explore all other ",
  "fetched_at": "2026-02-09T06:15:15.308980"
}