{
  "url": "https://en.wikipedia.org/wiki/History_of_optics",
  "title": "History of optics",
  "text": "Optics began with the development of lenses by the ancient Egyptians and Mesopotamians, followed by theories on light and vision developed by ancient Greek philosophers, and the development of geometrical optics in the Greco-Roman world. The word optics is derived from the Greek term τα ὀπτικά meaning 'appearance, look'. Optics was significantly reformed by the developments in the medieval Islamic world, such as the beginnings of physical and physiological optics, and then significantly advanced in early modern Europe, where diffractive optics began. These earlier studies on optics are now known as \"classical optics\". The term \"modern optics\" refers to areas of optical research that largely developed in the 20th century, such as wave optics and quantum optics.\n\n\n== Early history ==\nIn the fifth century BCE, Empedocles postulated that everything was composed of four elements; fire, air, earth and water. He believed that Aphrodite made the human eye out of the four elements and that she lit the fire in the eye which shone out from the eye making sight possible. If this were true, then one could see during the night just as well as during the day, so Empedocles postulated an interaction between rays from the eyes and rays from a source such as the sun. He stated that light has a finite speed.\nIn the 4th century BC Chinese text, credited to the philosopher Mozi, it is described how light passing through a pinhole creates an inverted image in a \"collecting-point\" or \"treasure house\".\nIn his Optics Greek mathematician Euclid observed that \"things seen under a greater angle appear greater, and those under a lesser angle less, while those under equal angles appear equal\". In the 36 propositions that follow, Euclid relates the apparent size of an object to its distance from the eye and investigates the apparent shapes of cylinders and cones when viewed from different angles. Pappus believed these results to be important in astronomy and included Euclid's Optics, along with his Phaenomena, in the Little Astronomy, a compendium of smaller works to be studied before the Syntaxis (Almagest) of Ptolemy.\nIn 55 BC, Lucretius, a Roman atomist, wrote:\n\nFor from whatsoever distances fires can throw us their light and breathe their warm heat upon our limbs, they lose nothing of the body of their flames because of the interspaces, their fire is no whit shrunken to the sight.\nIn his Catoptrica, Hero of Alexandria showed by a geometrical method that the actual path taken by a ray of light reflected from a plane mirror is shorter than any other reflected path that might be drawn between the source and point of observation.\nThe Indian Buddhists, such as Dignāga in the 5th century and Dharmakirti in the 7th century, developed a type of atomism which defined the atoms which make up the world as momentary flashes of light or energy. They viewed light as being an atomic entity equivalent to energy, though they also viewed all matter as being composed of these light/energy particles.\n\n\n=== Geometrical optics ===\n\nThe early writers discussed here treated vision more as a geometrical than as a physical, physiological, or psychological problem. The first known author of a treatise on geometrical optics was the geometer Euclid (c. 325 BC–265 BC). Euclid began his study of optics as he began his study of geometry, with a set of self-evident axioms.\n\nLines (or visual rays) can be drawn in a straight line to the object.\nThose lines falling upon an object form a cone.\nThose things upon which the lines fall are seen.\nThose things seen under a larger angle appear larger.\nThose things seen by a higher ray, appear higher.\nRight and left rays appear right and left.\nThings seen within several angles appear clearer.\nEuclid did not define the physical nature of these visual rays but, using the principles of geometry, he discussed the effects of perspective and the rounding of things seen at a distance.\nWhere Euclid had limited his analysis to simple direct vision, Hero of",
  "fetched_at": "2026-02-09T05:21:02.517213"
}