{
  "url": "https://en.wikipedia.org/wiki/Chapters_of_2_Maccabees",
  "title": "Chapters of 2 Maccabees",
  "text": "The book 2 Maccabees contains 15 chapters.  It is a deuterocanonical book originally written in Koine Greek that is part of the Catholic, Eastern Orthodox, and Oriental Orthodox Christian biblical canons.  It is still considered an important source on the Maccabean Revolt by Jews, Protestants, and secular historians of the period who do not necessarily hold the book as part of a scriptural canon.  The chapters chronicle events in Judea from around 178–161 BCE during the Second Temple Period.  Judea was at the time ruled by the Seleucid Empire, one of the Greek successor states that resulted from the conquests of Alexander the Great.  2 Maccabees was written by an unknown Egyptian Jew.  The account is distinct from the book 1 Maccabees, which was written by someone in the Hasmonean kingdom that was formed after the success of the revolt.  In general, 2 Maccabees has a more directly religious perspective than 1 Maccabees, frequently directly crediting prayers, miraculous interventions, and divine will for events.\nThe most influential chapters of the book are likely Chapter 6 and Chapter 7 which deal with the martyrdom of the woman with seven sons and Eleazar the scribe during the persecution of Judaism under King Antiochus IV Epiphanes.  Chapter 7 and Chapter 12 both discuss a coming bodily resurrection of the righteous; 2 Maccabees is one of the earliest pieces of literature to advocate for this belief.  Chapter 15 is also one of the earliest references to the Jewish festival of Purim.  While 2 Maccabees was originally written for an audience of Hellenistic Jews, verses in its chapters have been used in some branches of Christianity as scriptural backing for indulgences, prayers for the dead, and the intercession of saints.  These became controversial during the Protestant Reformation, and was one of the factors that led to Protestant denominations considering the book as non-canonical.\nLike other books of the Bible, the division of the text into chapters and verses was not in its original form, and was instead added later.\n\n\n== Chapters 1 and 2 ==\n\nThe first two chapters are an introduction and not part of the main narrative, which begins in Chapter 3.  They consist of two letters to the Jews of Ptolemaic Egypt, followed by the epitomist's preface.  Some earlier scholars such as Benedikt Niese interpreted it as one long letter, although this position finds little support since the work of Elias Bickerman in the 1930s in favor of seeing the text as two letters.\nMany scholars question whether these letters were truly authentic, especially the second one which appears to have, if based on an authentic letter at some point, been affected by manuscript interpolations over time.  There are also questions of whether the epitomist who wrote the main narrative was who attached these letters to the beginning of the narrative, or if some other compiler did so.  Arguments against the epitomist being the one who prepended the letters include that the epitomist's preface appears to be written as if it was an introduction already, with the two letters detracting from this literarily; that the account of King Antiochus's death in 1:13-16 differs from the account in Chapter 9; and that the epitomist's narrative builds toward Nicanor's Day as the finale and most important lesson, while the letters instead focus on Hanukkah and the cleansing of the Temple.\n\n\n=== First letter ===\n\nThe first letter, from 1:1-1:10a, is an invitation to celebrate the rededication of the Temple in Jerusalem: the festival of Hanukkah.   It opens with a salutation and stylized expressions of good will.  It then segues into a brief summary of how the troubles began with High Priest Jason (described in Chapter 4), a reminder of how the Jews of Judea called out for aid from the Jews of Egypt in the past, and closes with the encouragement of Hanukkah celebration for diaspora Jews (1:9-1:10a): \"And now see that you keep the festival of booths in the month of Chislev, in the",
  "fetched_at": "2026-02-09T05:21:02.372156"
}