{
  "url": "https://en.wikipedia.org/wiki/Prince_of_Darkness_(Manichaeism)",
  "title": "Prince of Darkness (Manichaeism)",
  "text": "In Manichaean cosmology, the world of darkness, which invaded the world of light in a lustful desire to mingle with the light, is ruled by five evil Archons (demon, dragon, eagle, fish and lion), who together make up the Prince of Darkness (Chinese: 黑暗王子; pinyin: hēiàn wángzĭ). The Father of Greatness parries the assault by evoking a number of entities, who sacrifice themselves and are absorbed by the Prince of Darkness; however, tricked by the Father of Greatness, their existence now depends on the light they absorbed. To prevent the light particles from returning into their divine origin, they counter by giving birth to two demonic beings: Sakla and Nebroel. As the strict anti-thesis of the pure light, the Prince of Darkness cannot create ex nihilo, but only by copulation.\n\n\n== Polytheism and dualism ==\nAugustine of Hippo, who converted from Manichaeism to Christianity, criticised the Manichaeans for polytheism and paganism, stating that Manichaeans, due to their dualistic cosmology, believe in two different deities. The Manichaean bishop Faustus of Mileve defends Manichaeism by stating that Catholics erroneously assume that the Prince of Darkness had a divine essence, while in fact, the Prince of Darkness does not share any attributes with the Divine, thus Manichaeism would not worship multiple gods, but rather one true god. They are both two different principles: although eternally existing, clearly distinct. Only the light particles within humans are consubstantial to the Divine.\n\n\n== Alternative names ==\nManichaean missionaries adjusted the name of the Prince of Darkness depending on the audience. Towards Christians, they commonly used the name Satanas. In relation to Islam, the expression Iblīs al-Qadīm (The Ancient Iblis) can be found, but is also referred to as al-Šayṭān. In Iranian Manichaeism, he was called Ahriman. In Old Turkish, he is called šmnw.\n\n\n== See also ==\nAngra Mainyu\nDevil\nLucifer\nMephistopheles\nPtahil\nPrince of Darkness (Satan)\nSamūm\nYaldabaoth\n\n\n== References ==",
  "fetched_at": "2026-02-09T02:52:38.794860"
}