{
  "url": "https://en.wikipedia.org/wiki/Their_Eyes_Were_Watching_God",
  "title": "Their Eyes Were Watching God",
  "text": "Their Eyes Were Watching God is a 1937 novel by American writer Zora Neale Hurston. It is considered a classic of the Harlem Renaissance and Hurston's best-known work. The novel explores protagonist Janie Crawford's \"ripening from a vibrant, but voiceless, teenage girl into a woman with her finger on the trigger of her own destiny.\" \nHurston wrote Their Eyes Were Watching God in Haiti in the span of seven weeks. Hurston was self described as \"under internal pressure\" when writing and wished she could \"write it again\". Though retrospectively she felt the work captured \"all the tenderness of [her] passion\".\nSet in central and southern Florida in the early 20th century, the novel was initially poorly received by the African American community. After the publication of Alice Walker's article \"In Search of Zora Neale Hurston\" in Ms. magazine in 1975 and Robert Hemenway's publication of a biography of Hurston in 1980, Hurston was back in the literary realm. Since the late 20th century, Their Eyes Were Watching God has been regarded as influential to both African-American literature and women's literature. Time magazine included the novel in its 2005 list of the 100 best English-language novels published since 1923.\n\n\n== Plot synopsis ==\nJanie Crawford, an African-American woman in her forties, returns to her old town after a year-long absence and recounts her life story, along with the time she had been gone, to her friend Phoeby. Janie starts with her sexual awakening, comparing it to a blossoming pear tree kissed by bees in spring, that occurs when she allows a local boy, Johnny Taylor, to kiss her, which Janie's grandmother, Nanny, witnesses.\nAs a young enslaved woman, Nanny was raped by her white enslaver, then gave birth to a mixed-race daughter that she named Leafy. Though Nanny wanted a better life for her daughter and even escaped her jealous mistress, after the American Civil War Leafy was later raped by her school teacher and became pregnant with Janie. Shortly after Janie's birth, Leafy began to drink and stay out at night, eventually abandoning the baby and leaving Janie with Nanny.\nNanny, having transferred her hopes for stability and opportunity from Leafy to Janie, arranges for Janie to marry Logan Killicks, an older farmer looking for a wife. However, Killicks does not love Janie and wants only a domestic helper, rather than a lover or partner; he thinks she does not do enough around the farm and considers her ungrateful. When Janie speaks to Nanny about her desire for love, Nanny, too, accuses Janie of being spoiled and dies soon after.\nUnhappy, disillusioned, and lonely, Janie leaves Killicks and runs off with Joe \"Jody\" Starks, a glib man who takes her to the all-Black community of Eatonville, Florida. Starks arranges to buy more land, establishes a general store, and is soon elected mayor of the town. However, Janie soon realizes that Starks wants her as a trophy wife to reinforce his powerful position in town and to run the store, even forbidding her from taking part in the town's social life. During their twenty-year marriage, he treats her as his property, criticizing her, controlling her, and physically abusing her. Finally, when Starks's kidney begins to fail, Janie says that he never knew her because he would not let her be free.\nAfter Starks dies Janie becomes financially independent through his estate. Though she is beset with suitors, including men of means, she turns them all down until she meets a young drifter and gambler named Vergible Woods, known as \"Tea Cake.” He plays the guitar for her and initially treats her with kindness and respect. Janie is hesitant because she is older and wealthy, but she eventually falls in love with him and decides to run away with him to Jacksonville to marry. They move to Belle Glade, in the northern part of the Everglades region (\"the muck\"), where they find work planting and harvesting beans. While their relationship is volatile and sometimes violent, Janie finally ",
  "fetched_at": "2026-02-09T05:19:34.327954"
}