{
  "url": "https://en.wikipedia.org/wiki/Mani_(prophet)",
  "title": "Mani (prophet)",
  "text": "Mani (; c. April AD 216 – 2 March AD 274 or 26 February AD 277) was an Iranian prophet and the founder of Manichaeism, a religion most prevalent in late antiquity.\nMani was born in or near Ctesiphon (south of modern Baghdad) in Mesopotamia, at the time part of the Parthian Empire. Seven of his major works were written in Syriac, and the eighth, dedicated to the Sasanian emperor Shapur I, was written in Middle Persian. He died shortly after being imprisoned by Bahram I in Gundeshapur.\n\n\n== Etymology ==\nThe exact meaning of the name, or rather title, of \"Mani\" remains unsolved. It may have derived from Babylonian-Aramaic Mânâ [luminescence]. Mandaeans used the term mânâ rabba, which means \"Enlightened Lord/King\". Ancient Greek interpretations were skeuos (σκεῦος, \"vessel, instrument\") and homilia (ὁμιλία, \"intercourse, company, communion, instruction\").\nThe same slightly contemptuous \"a certain\" (Manes quidam) also appears in Hegemonius' Acta Archelai (4th century), however, Hegemonius contributes a detailed description of Mani's looks. Mani’s names became the object of uplifting transformation (Greek, Coptic Mannichaios, Latin Mannichaeus, i.e., Mannam fundens, \"pouring out Manna\"). Alternatively, due to Mani's possible origins in an Elchasai community, \"Mani\" could be a Hypocorism of the Hebrew name Menahem (\"the consoler\" or \"comforter\").\n\n\n== Sources ==\nIn 1969 in Upper Egypt a Greek parchment codex dating to c. AD 400 was discovered. It is now designated Codex Manichaicus Coloniensis because it is conserved at the University of Cologne. Combining a hagiographic account of Mani's career and spiritual development with information about Mani's religious teachings, and containing fragments of his writings, it is now considered the most reliable source of information about the historical Mani.\nAll other medieval and pre-medieval accounts of his life are either legendary or hagiographical, such as the account in Fihrist by Ibn al-Nadim, purportedly by al-Biruni, or were anti-Manichaean polemics, such as the 4th-century Acta Archelai. Among these medieval accounts, Ibn al-Nadim's account of Mani's life and teachings is generally speaking the most reliable and exhaustive. Notably, the (in other accounts prominent) image of the \"Third Ambassador\" is only represented through a brief mention of the name bašīr, \"messenger of good news\", and the topos of \"Mani the Painter\" (which in other Islamic accounts almost completely replaces that of \"the founder of a religion\") is completely absent.\n\n\n== Life ==\n\nThis work and other evidence discovered in the 20th century establishes Mani as a historical individual. For an updated critique of the standard account and a radically alternative proposal, see Iain Gardner's The Founder of Manichaeism: Rethinking the Life of Mani.\n\n\n=== Early life ===\nMani was born near Seleucia-Ctesiphon, perhaps in the town of Mardinu in the Babylonian district of Nahr Kutha; according to other accounts in the town Abrumya. Mani's father Pātik (Middle Persian: Pattūg; Koine Greek: Παττικιος, Arabic: Futtuq), a native of Ecbatana (now Hamadan, Iran), was a member of the Jewish Christian sect of the Elcesaites. His mother was of Parthian descent (from \"the Armenian Arsacid family of Kamsarakan\"); her name is reported variously, among others Maryam.\nMani was raised in a heterodox environment in Babylon. The Elcesaite community was ostensibly Jewish Christian, though with some Gnostic features due to their Ebionite heritage, such as the belief in recurring incarnations of heavenly apostles, one of whom was a docetic Christ. It is believed that his Christian roots might have been influenced by Marcion and Bardaisan. At ages 12 and 24 Mani had visionary experiences of a \"heavenly twin\" of his (syzygos), calling him to leave his father's sect and preach the true message of Jesus in a new gospel. It is said that his appearance was a mixture of Iranian and Mesopotamian features. On the one hand he looked like a warrior, on th",
  "fetched_at": "2026-02-09T02:45:18.992944"
}