{
  "url": "https://en.wikipedia.org/wiki/Samyaza",
  "title": "Samyaza",
  "text": "Samyaza (Hebrew: שַׁמְּחֲזַי Šamməḥăzay; Imperial Aramaic: שְׁמִיעָזָא Šəmīʿāzāʾ‍; Greek: Σεμιαζά; Arabic: ساميارس, Samyarus), also Shamhazai, Aza or Ouza, is a fallen angel of apocryphal Abrahamic traditions and Manichaeism as the leader of the Watchers.\n\n\n== Etymology ==\nThe name \"Shemyaza(z)\" means \"the (or my) name has seen,\" \"he sees the name,\" or \"I have seen.\" It is also spelled \"Samyaza\", \"Shemhazai\", \"Samiaza(z)\", \"Semiaza\", \"Shamazya\", \"Shemyazaz\", \"Shemihazah\", \"Shemyaza\", \"Sêmîazâz\", \"Semjâzâ\", \"Samjâzâ\", \"Šemihaza\", and \"Semyaza\".\nThe scholars lean towards the Semitic etymology of this appellation which contains the letters shin (ש) and mem (מ), thus suggesting the derivation from either “name” (Heb. שם, shem) or “heavens” (Heb. שמים, shamaym). Moshe Idel proposed that Samyaza is the one who “gazes at heavens” or “gazes from heavens”. This interpretation goes well with the motif of the heavenly Watchers, i.e., the angels supervising humans on earth.\n\n\n== Book of Enoch ==\nIn the Book of Enoch, one of the apocryphal writings, Samyaza is portrayed as the leader of a band of angels called \"sons of God\" or \"Watchers\" (grigori in Greek).\nSamyaza is introduced in Book 6, heading a meeting of a total of 200 angels, wherein they discuss their desire to consummate with human women:\n\nAnd Semjâzâ, who was their leader, said unto them: \"I fear ye will not indeed agree to do this deed, and I alone shall have to pay the penalty of a great sin.\" And they all answered him and said: \"Let us all swear an oath, and all bind ourselves by mutual imprecations not to abandon this plan but to do this thing.\" Then swear they all together and bound themselves by mutual imprecations upon it. (1 En 6:3-5)\nSamyaza and his fellow Watchers then each take human women for wives and bestow knowledge upon them. The children born from these partnerships are known as Nephilim, a plural noun rendered as \"giants\" in the King James translation of the Book of Genesis. The Nephilim \"consumed all the acquisitions of men. And when men could no longer sustain them, the giants turned against them and devoured mankind.\" (1 En 7:3-5)\nIn Book 10, God commands the angel Gabriel to cause the Watchers and Nephilim to wage civil war, after the completion of which he condemns Samyaza to be \"[bound] fast for seventy generations in the valleys of the earth, till the day of their judgement and of their consummation, till the judgement that is  for ever and ever is consummated. In those days they shall be led off to the abyss of fire: and 14 to the torment and the prison in which they shall be confined for ever.\" (1 En 10:11-14)\n\n\n== Book of Giants ==\nIn The Book of Giants, Shemyaza (or Šahmīzād in the Manichaean version) begets two sons, who together battle Leviathan. However, they are not portrayed as heroic, but as boasting about their own victory; a symbol of royal failure to keep one's power in this world. After the defeat of the Leviathan, Shemyaza and his offspring are slain by the four punishing angels.\n\n\n== Babylonian Talmud ==\nThe Babylonian Talmud contains a singular mention of the name Samyaza (spelled שמחזאי in the Vilna edition with some lesser variations in the manuscripts) in Niddah 61a. Accordingly:\n\nNow, Sihon and Og were brothers, as the Master said: Sihon and Og were sons of Ahijah, son of Shamhazai.\nThe text does not elucidate the identity of Samyaza who appears nowhere else in the corpus, but clearly portrays him as the grandfather of Og, the king of Bashan and the last of Rephaim known for his gigantic height and strength (Deuteronomy 3:11). As such this can be taken as a reference to the myth of the fallen angels and the motif of their gigantic progeny transmitted in apocrypha and pseudepigrapha.\n\n\n== Other traditions ==\nIn legend, Azza (another name for Samyaza) is the seraph tempted by the maiden Ishtar to reveal to her the Explicit Name of God. In Solomonic lore, the story is that Azza was the angel who revealed to the Jewish king the heavenly a",
  "fetched_at": "2026-02-09T02:48:49.898973"
}