{
  "url": "https://en.wikipedia.org/wiki/Worship_of_heavenly_bodies",
  "title": "Worship of heavenly bodies",
  "text": "The worship of heavenly bodies is the veneration of stars (individually or together as the night sky), the planets, or other astronomical objects as deities, or the association of deities with heavenly bodies. In anthropological literature these systems of practice may be referred to as astral cults.  \nThe most notable instances of this are sun gods and moon gods in polytheistic systems worldwide. Also notable are the associations of the planets with deities in Sumerian religion, and hence in Babylonian, Greek and Roman religion, viz. Mercury, Venus, Mars, Jupiter, and Saturn. Gods, goddesses, and demons may also be considered personifications of astronomical phenomena such as lunar eclipses, planetary alignments, and apparent interactions of planetary bodies with stars. The Sabians of Harran, a poorly understood pagan religion that existed in Harran during the early Islamic period (7th–10th century), were known for their astral cult.\nThe related term astrolatry usually implies polytheism. Some Abrahamic religions prohibit astrolatry as idolatrous. Pole star worship was also banned by imperial decree in Heian period Japan.\n\n\n== Etymology ==\nAstrolatry has the suffix -λάτρης, itself related to λάτρις latris 'worshipper' or λατρεύειν latreuein 'to worship' from λάτρον latron 'payment'.\n\n\n== In historical cultures ==\n\n\n=== Mesopotamia ===\nMesopotamia is worldwide the place of the earliest known astronomer and poet by name: Enheduanna, Akkadian high priestess to the lunar deity Nanna/Sin and princess, daughter of Sargon the Great (c. 2334 – c. 2279 BCE). She had the Moon tracked in her chambers and wrote poems about her divine Moon. The crescent depicting the Moon as with Enheduanna's deity Nanna/Sin have been found from the 3rd millennium BCE. \nBabylonian astronomy from early times associates stars with deities, but the identification of the heavens as the residence of an anthropomorphic pantheon, and later of monotheistic God and his retinue of angels, is a later development, gradually replacing the notion of the pantheon residing or convening on the summit of high mountains. Archibald Sayce (1913) argues for a parallelism of the \"stellar theology\" of Babylon and Egypt, both countries absorbing popular star-worship into the official pantheon of their respective state religions by identification of gods with stars or planets.\nThe Chaldeans, who came to be seen as the prototypical astrologers and star-worshippers by the Greeks, migrated into Mesopotamia c. 940–860 BCE. Astral religion does not appear to have been common in the Levant prior to the Iron Age, but becomes popular under Assyrian influence around the 7th-century BCE. The Chaldeans gained ascendancy, ruling Babylonia from 608 to 557 BCE. The Hebrew Bible was substantially composed during this period (roughly corresponding to the period of the Babylonian captivity).\n\n\n=== Egypt ===\n\nAstral cults were probably an early feature of religion in ancient Egypt. Evidence suggests that the observation and veneration of celestial bodies played a significant role in Egyptian religious practices, even before the development of a dominant solar theology. The early Egyptians associated celestial phenomena with divine forces, seeing the stars and planets as embodiments of gods who influenced both the heavens and the earth. Direct evidence for astral cults, seen alongside the dominant solar theology which arose before the Fifth Dynasty, is found in the Pyramid Texts. These texts, among the oldest religious writings in the world, contain hymns and spells that not only emphasize the importance of the Sun God Ra but also refer to stars and constellations as powerful deities that guide and protect the deceased Pharaoh in the afterlife.\nThe growth of Osiris devotion led to stars being called \"followers\" of Osiris. They recognized five planets as \"stars that know no rest\", interpreted as gods who sailed across the sky in barques:  Sebegu (perhaps a form of Set), Venus (\"the one who crosses\"),",
  "fetched_at": "2026-02-09T06:20:37.217986"
}