{
  "url": "https://en.wikipedia.org/wiki/Heaven",
  "title": "Heaven",
  "text": "Heaven, or the Heavens, is a common religious cosmological or supernatural place where beings such as deities, angels, souls, saints, or venerated ancestors are said to originate, be enthroned, or reside. According to the beliefs of some religions, heavenly beings can descend to Earth or incarnate and earthly beings can ascend to Heaven in the afterlife or, in exceptional cases, enter Heaven without dying.\nHeaven is often described as a \"highest place\", the holiest place, a paradise, in contrast to Hell or the Underworld or the \"low places\" and universally or conditionally accessible by earthly beings according to various standards of divinity, goodness, piety, faith, or other virtues or right beliefs or simply divine will. Some believe in the possibility of a heaven on Earth in a world to come.\nAnother belief is in an axis mundi or world tree which connects the heavens, the terrestrial world, and the underworld. In Indian religions, heaven is considered as Svargaloka, and the soul is again subjected to rebirth in different living forms according to its karma. This cycle can be broken after a soul achieves Moksha or Nirvana. Any place of existence, either of humans, souls or deities, outside the tangible world (Heaven, Hell, or other) is referred to as the otherworld.\nIn the Abrahamic faiths of Christianity, Islam, and some schools of Judaism, as well as Zoroastrianism, heaven is the realm of afterlife where good actions in the previous life are rewarded for eternity, Hell being the place where bad behavior is punished.\n\n\n== Etymology ==\n\nThe modern English word heaven is derived from the earlier (Middle English) heven (attested 1159); this in turn was developed from the previous Old English form heofon. By about 1000, heofon was being used in reference to the Christianized \"place where God dwells\", but originally, it had signified \"sky, firmament\" (e.g. in Beowulf, c. 725).\nThe English term has cognates in the other Germanic languages: Old Saxon heƀan \"sky, heaven\" (hence also Middle Low German heven \"sky\"), Old Icelandic himinn, Gothic himins; and those with a variant final -l: Old Frisian himel, himul \"sky, heaven\", Old Saxon and Old High German himil, Old Saxon and Middle Low German hemmel, Old Dutch and Dutch hemel, and modern German Himmel. All of these have been derived from a reconstructed Proto-Germanic form *hemina-. or *hemō.\nThe further derivation of this form is uncertain. A connection to Proto-Indo-European *ḱem- \"cover, shroud\", via a reconstructed *k̑emen- or *k̑ōmen- \"stone, heaven\", has been proposed.\nOthers endorse the derivation from a Proto-Indo-European root *h₂éḱmō \"stone\" and, possibly, \"heavenly vault\" at the origin of this word, which then would have as cognates ancient Greek ἄκμων (ákmōn \"anvil, pestle; meteorite\"), Persian آسمان (âsemân, âsmân \"stone, sling-stone; sky, heaven\") and Sanskrit अश्मन् (aśman \"stone, rock, sling-stone; thunderbolt; the firmament\"). In the latter case English hammer would be another cognate to the word.\n\n\n== Ancient Near East ==\n\n\n=== Mesopotamia ===\n\nThe ancient Mesopotamians regarded the sky as a series of domes (usually three, but sometimes seven) covering the flat Earth. Each dome was made of a different kind of precious stone. The lowest dome of heaven was made of jasper and was the home of the stars. The middle dome of heaven was made of saggilmut stone and was the abode of the Igigi. The highest and outermost dome of heaven was made of luludānītu stone and was personified as An, the god of the sky. The celestial bodies were equated with specific deities as well. The planet Venus was believed to be Inanna, the goddess of sex and war. The Sun was her brother Utu, the god of justice, and the Moon was their father Nanna.\nIn ancient Near Eastern cultures in general and in Mesopotamia in particular, humans had little to no access to the divine realm. Heaven and Earth were separated by their very nature; humans could see and be affected by elements of the lower heaven, su",
  "fetched_at": "2026-02-09T05:48:57.199539"
}