{
  "url": "https://en.wikipedia.org/wiki/Geography_of_Kent",
  "title": "Geography of Kent",
  "text": "Kent is the south-easternmost county in England.  It is bounded on the north by the River Thames and the North Sea, and on the south by the Straits of Dover and the English Channel.  The continent of Europe is 21 miles across the straits.\n\n\n== Geology ==\nThe major geographical features of the county are determined by a series of ridges running from west to east across the county.  These ridges are the remains of the Wealden dome, a denuded anticline across Kent, Surrey and Sussex, which was the result of uplifting caused by the Alpine movements between 10-20 million years ago.  The dome was formed of an upper layer of Chalk above subsequent layers of Upper Greensand, Gault, Lower Greensand, Weald Clay and the Hastings Beds.  The top of the dome eventually eroded away through weathering and ridges and valleys resulted across Kent and Sussex due to the exposed clay eroding at a faster rate than the exposed chalk, greensand and red sandstone and normal sandstone.  The following ridges and the valleys have formed across Kent, listed from north to south: \n\nthe low lying London Clay marshlands along the Thames/Medway estuaries and along the North Kent coast;\nthe chalk North Downs, containing the highest point of the county, Betsom's Hill, at 251 m (823 ft);\nthe Vale of Holmesdale formed from Gault Clay overlaid in the north with the upper layer greensand;\nthe Greensand Ridge, formed from the lower layer of greensand, containing the source of the River Medway and its tributaries;\nthe Low Weald, a Weald Clay valley\nthe sandstone High Weald.\nThe chalk comes in three layers: the upper layer, about 500 feet thick, is a pure white limestone bedded and jointed with localised masses of flint (ideal for cement); the middle layer, about 170 feet thick, is a compact white chalk occasionally hard enough for building; the lower layer, about 170 feet thick, is a greyish marly chalk. Dartford, Gravesend, The Medway Towns, Sittingbourne, Faversham, Canterbury, Deal and Dover are built on chalk.\nThe eastern part of the Wealden dome was eroded away by the sea.  The White cliffs of Dover occur where the North Downs meets the coast.  From there to Westerham is now the Kent Downs Area of Outstanding Natural Beauty.  The chalk displays all its characteristic features such as steep sided dry valleys, and sunken roads.\n\nGreensand is a calcareous sandstone containing an uneven distribution of the mineral glauconite, giving the sandstone a greenish tinge.  On exposure to the air this oxidises into a yellow stain.  Sevenoaks, Maidstone, Ashford, and Folkestone are built on the greensand.  Greensand comes in four layers: the Folkestone Beds 60–250 ft thick; The Sandgate Beds 5–120 ft thick; the Hythe beds 60–350 ft thick and Atherfield Clays 15–50 ft thick.  The soil of the greensand is quite varied, ranging from fertile to fairly sterile.  On the fertile soils we see chestnut and stands of hazel and oak, while Scots Pine and Birch colonise the poorer soils.\nThe Hastings Beds, which are resistant to weathering, leading to outcrops, such as High Rocks Tunbridge Wells, and sterile soil only suited to heathland and forests of Scots Pine.  The Hastings Beds are divided into three formations: Tunbridge Wells Sand Formation 130–400 ft; Wadhurst Clay Formation 100–230 ft, shales with bands of sandstone and iron ore; and the Ashdown Formation 160–700 ft; sandstones.  The Fairlight Clays form the upper part of the Ashdown Formation; grey and varigated shales. Tonbridge and Tunbridge Wells are built on the Hastings Beds.\nThe Weald derives its ancient name from the Germanic word wald  meaning simply woodland.  Much of the area remains today densely wooded; where there are also heavy clays the tracks through are nearly impassable for much of the year.\n\nThe Wealden dome is a Mesozoic structure lying on a Palaeozoic foundation, which usually creates the right conditions for coal formation.  This is found in East Kent, roughly between Deal, Canterbury, and Dover.  The coal m",
  "fetched_at": "2026-02-09T02:45:28.165510"
}