{
  "url": "https://en.wikipedia.org/wiki/Book_of_Enoch",
  "title": "Book of Enoch",
  "text": "The Book of Enoch (also 1 Enoch; Hebrew: סֵפֶר חֲנוֹךְ, romanized: Sēfer Ḥănōḵ; Ge'ez: መጽሐፈ ሄኖክ, romanized: Maṣḥafa Hēnok) is an ancient Jewish apocalyptic religious text, ascribed by tradition to the patriarch Enoch who was the father of Methuselah and the great-grandfather of Noah. The Book of Enoch contains unique material on the origins of demons and Nephilim, why some angels fell from heaven, an explanation of why the Genesis flood was morally necessary, and a prophetic exposition of the thousand-year reign of the Messiah. Three books are traditionally attributed to Enoch, including the distinct works 2 Enoch and 3 Enoch.\n1 Enoch is not considered to be canonical scripture by most movements of Judaism or branches of Christianity, although it is part of the biblical canon used by the Ethiopian Jewish community Beta Israel, as well as the Ethiopian Orthodox Tewahedo Church and Eritrean Orthodox Tewahedo Church.\nThe older sections of 1 Enoch are estimated to date to c. 300–200 BCE, and the latest part (Book of Parables) is probably from c. 100 BCE. Scholars believe Enoch was originally written in either Aramaic or Hebrew, the languages first used for Jewish texts. Ephraim Isaac suggests that the Book of Enoch, like the Book of Daniel, was composed partially in Aramaic and partially in Hebrew. No Hebrew version is known to have survived. Copies of the earlier sections of 1 Enoch were preserved in Aramaic among the Dead Sea Scrolls in the Qumran Caves.\nAuthors of the New Testament were also familiar with some content of the book. A short section of 1 Enoch is cited in the Epistle of Jude, being attributed to \"Enoch, the Seventh from Adam\" (1 Enoch 60:8). This section of 1 Enoch is a midrash on Deuteronomy 33:2, which was written long after the supposed time of Enoch. The full Book of Enoch survives in its entirety only in the Geʽez translation.\n\n\n== Synopsis ==\nThe first part of the Book of Enoch describes the fall of the Watchers, the angels who fathered the angel-human hybrids called Nephilim. The remainder of the book describes Enoch's revelations and his visits to heaven in the form of travels, visions, and dreams.\nThe book consists of five major sections (see each section for details):\n\nThe Book of the Watchers (1 Enoch 1–36)\nThe Book of Parables of Enoch (1 Enoch 37–71) (also called the Similitudes of Enoch)\nThe Astronomical Book (1 Enoch 72–82) (also called the Book of the Heavenly Luminaries or Book of Luminaries)\nThe Book of Dream Visions (1 Enoch 83–90) (also called the Book of Dreams)\nThe Epistle of Enoch (1 Enoch 91–108)\nMost scholars believe that these five sections were originally independent works (with different dates of composition), themselves a product of much editorial arrangement, and were only later redacted into what is now called 1 Enoch. Because the Book of Parables is unattested in all except the Ethiopic manuscripts, and because a copy of The Book of Giants appears to be written on the same manuscript as a portion of Enoch, it seems likely that the former may have replaced the latter from the original Enochic pentateuch.\n\n\n=== The Book of the Watchers ===\nThis first section of the Book of Enoch describes the fall of the Watchers, the angels who fathered the Nephilim, the bene Elohim, and narrates the travels of Enoch in the heavens. This section is said to have been composed in the 4th or 3rd century BCE according to Western scholars.\n\n\n==== Contents ====\n1–5: Parable of Enoch on the Future Lot of the Wicked and the Righteous.\n6–11: The Fall of the Angels: the Demoralization of Mankind: the Intercession of the Angels on behalf of Mankind. The Dooms pronounced by God on the Angels of the Messianic Kingdom.\n12–16: Dream-Vision of Enoch: his Intercession for Azazel and the fallen angels: and his Announcement of their first and final Doom.\n17–36: Enoch's Journeys through the Earth and Sheol: Enoch also traveled through a portal shaped as a triangle to heaven.\n17–19: The First Journey.\n20: Names and Funct",
  "fetched_at": "2026-02-09T02:44:54.166841"
}