{
  "url": "https://en.wikipedia.org/wiki/Morgan_le_Fay_in_modern_culture",
  "title": "Morgan le Fay in modern culture",
  "text": "The Matter of Britain character Morgan le Fay (often known as Morgana, and sometimes also as Morgaine and other names) has been featured many times in various works of modern culture, often but not always appearing in villainous roles. Some modern stories merge Morgana's character with her sister Morgause or with aspects of Nimue (the Lady of the Lake). Her manifestations and the roles given to her by modern authors vary greatly, but typically she is being portrayed as a villainess associated with Mordred.\nHer stereotypical image, then, is of a seductive, megalomaniacal, power-hungry sorceress who wishes to rule Camelot and overthrow King Arthur, and is a fierce rival of the mage Merlin. Contemporary interpretations of the Arthurian myth sometimes assign to Morgana the role of seducing Arthur and giving birth to the wicked knight Mordred, though traditionally his mother was Morgause, Morgana's sister; in these works Mordred is often her pawn, used to bring about the end of the Arthurian age. Examples of modern Arthurian works featuring Morgana in the role of a major antagonist include characters in both the DC Comics (Morgaine le Fey) and Marvel Comics (Morgan le Fay) comic book universes. Some other Arthurian fiction, however, casts Morgana in the various positive or at least more ambivalent roles, and some have her as a protagonist and sometimes a narrator.\n\n\n== Overview ==\nMorgan le Fay has become ubiquitous in Arthurian works of modern culture, spanning mostly fantasy and historical fiction across various mediums including literature, comics, film, and television. As Elizabeth S. Sklar noted in 1992: \"Currently a cornerstone of the new Arthurian mythos, [she] occupies a secure position in the contemporary Arthurian pantheon, as familiar a figure to modern enthusiasts as Merlin, Lancelot, or King Arthur himself.\" Additionally, she has become an archetype serving as a source of tropes for many characters in other modern works, some of them borrowing her name in the form Morgana. As in the case of other modern Arthuriana, Le Morte d'Arthur is the dominant source today.\n\nPrior to her 20th-century resurgence, however, Morgan had been largely absent from modern Arthuriana. The relatively few exceptions of an actual Morgan character include William Morris's epic poem The Earthly Paradise (1870), retelling the story of Morgan and Ogier the Dane. In his popular and often-adapted satirical novel A Connecticut Yankee in King Arthur's Court (1889), Mark Twain cast Morgan le Fay as a deceptively charmful representative of feudal corruption, who is also capable of the most vicious behavior and flirts with the time-travelling protagonist Hank Morgan, her namesake and essentially similar character or even a double (one film adaptation, A Knight in Camelot, stars Whoopi Goldberg as the female protagonist Vivien Morgan who is the only Morgan character in this version, sharing her first name also with one of the names of the Lady of the Lake; Kim Iverson Headlee also wrote the book's continuation novel from Morgan le Fay's own perspective, King Arthur's Sister in Washington's Court).\nSince the early 20th century, most modern works feature Morgan as a sorceress and sometimes a priestess, and usually a half-sister of Arthur and sometimes a femme fatale, but some also have her in other roles, including as a fairy or an otherwise non-human character. Many authors effectively merge Morgan with Morgause (traditionally a sister of Morgan and the mother of Mordred from an incestuous union with their brother Arthur) and combine her with the less savory aspects of the Lady of the Lake (this is further positioning a modern Morgan as a nemesis for Merlin, who has never been truly her foe in the medieval Arthurian lore). Such a composite character is then often turned into Mordred's mother or partner. An early instance of such simplifications used to \"streamline the plot\" was Henry Irving's 1895 stage production King Arthur originally written by W. G. Wi",
  "fetched_at": "2026-02-09T05:54:28.003794"
}