{
  "url": "https://en.wikipedia.org/wiki/The_Heart_of_Thomas",
  "title": "The Heart of Thomas",
  "text": "The Heart of Thomas (Japanese: トーマの心臓, Hepburn: Tōma no Shinzō) is a 1974 Japanese manga series written and illustrated by Moto Hagio. Originally serialized in Shūkan Shōjo Comic, a weekly manga magazine publishing shōjo manga (manga aimed at young and adolescent women), the series follows the events at a German all-boys gymnasium following the suicide of student Thomas Werner. Hagio drew inspiration for the series from the novels of Hermann Hesse, especially Demian (1919); the Bildungsroman genre; and the 1964 film Les amitiés particulières. It is one of the earliest works of shōnen-ai, a genre of male-male romance manga aimed at a female audience.\nThe Heart of Thomas was developed and published during a period of immense change and upheaval for shōjo manga as a medium, characterized by the emergence of new aesthetic styles and more narratively complex stories. This change came to be embodied by a new generation of shōjo manga artists collectively referred to as the Year 24 Group, of which Hagio was a member. Hagio originally developed the series as a personal project that she did not expect would ever be published. After changing publishing houses from Kodansha to Shogakukan in 1971, Hagio published a loosely-adapted one-shot (standalone single chapter) version of The Heart of Thomas titled The November Gymnasium (11月のギムナジウム, Jūichigatsu no Gimunajiumu) before publishing the full series in 1974.\nWhile The Heart of Thomas was initially poorly received by readers, by the end of its serialization it was among the most popular series in Shūkan Shōjo Comic. It significantly influenced shōjo manga as a medium, with many of the stylistic and narrative hallmarks of the series becoming standard tropes of the genre. The series has attracted considerable scholarly interest both in Japan and internationally, and has been adapted into a film, a stage play, and a novel. An English-language translation of The Heart of Thomas, translated by Rachel Thorn, was published by Fantagraphics Books in 2013.\n\n\n== Synopsis ==\nThe series is set in the mid-20th century, primarily at the fictional Schlotterbach Gymnasium in the Karlsruhe region of Germany, located on the Rhine between the cities of Karlsruhe and Heidelberg.\n\nDuring Easter holidays, the titular character Thomas Werner, a Schlotterbach student, dies after falling off a pedestrian footbridge spanning a railroad track. Although the school's community believes his death to be accidental, his classmate Julusmole \"Juli\" Bauernfeind receives a posthumous suicide letter from Thomas wherein Thomas professes his love for him; Thomas had unrequited romantic feelings for Juli, who had previously rejected his affections. Though Juli is outwardly unmoved by the incident, he is privately racked with guilt over Thomas' death. He confides in his roommate Oskar Reiser, who is also secretly in love with Juli.\nErich Frühling, a new student who bears a very close physical resemblance to Thomas, arrives at Schlotterbach shortly thereafter. Erich is irascible and blunt, and resents frequent comparisons to the kind and genteel Thomas. Juli believes that Erich is Thomas' malevolent doppelgänger who has come to Schlotterbach to torment him, and tells Erich that he intends to kill him. Oskar attempts to de-escalate the situation, and befriends Erich. They bond over their troubled family contexts: Erich harbors an unresolved Oedipus complex towards his recently deceased mother, while Oskar's mother was murdered by her husband after he discovered Oskar was the product of an extramarital affair.\nIt is gradually revealed that the root of Juli's anguish was his attraction to both Thomas and Siegfried Gast, the latter of whom was a delinquent student at the school. Juli chose to pursue Siegfried over Thomas, but Siegfried physically abused Juli by caning his back and burning his chest with a cigarette to the point of scarring, and is implied to have raped him. The incident traumatized Juli; likening himself to a fallen ",
  "fetched_at": "2026-02-09T05:55:32.102331"
}