{
  "url": "https://en.wikipedia.org/wiki/History_of_Birmingham",
  "title": "History of Birmingham",
  "text": "Birmingham has seen 1400 years of growth, during which time it has evolved from a small 7th century Anglo Saxon hamlet on the edge of the Forest of Arden at the fringe of the early Mercia into a major city. A combination of immigration, innovation and civic pride helped to bring about major social and economic reforms and create the Industrial Revolution, inspiring the growth of similar cities across the world.\nThe last 200 years or so have seen Birmingham rise from market town to the fastest-growing city of the 19th century, spurred on by a combination of civic investment, scientific achievement, commercial innovation and by a steady influx of migrant workers into its suburbs. By the 20th century Birmingham had become the metropolitan hub of the United Kingdom's manufacturing and automotive industries, having earned itself a reputation first as a city of canals, then of cars, and most recently as a major European convention and shopping destination.\nAt the beginning of the 21st century, Birmingham now lies at the heart of a major post-industrial metropolis surrounded by significant educational, manufacturing, shopping, sporting and conferencing facilities.\n\n\n== Prehistory ==\n\n\n=== Stone Age ===\n\nThe oldest human artefact found within Birmingham is the Saltley Handaxe: a 500,000-year-old brown quartzite hand axe about 100 millimetres (3.9 in) long, discovered in the gravels of the River Rea at Saltley in 1892. Other parts of Birmingham are quite similar in this way, as people seem to have lived there for millennia . This provided the first evidence of Lower Paleolithic human habitation of the English Midlands, an area previously thought to have been sterile and uninhabitable before the end of the last glacial period. Similarly aged axes have since also been found in Erdington and Edgbaston, and bioarchaeological evidence from boreholes in Quinton, Nechells and Washwood Heath suggests that the climate and vegetation of Birmingham during this interglacial period were very similar to those of today.\nThe area became uninhabitable with the advancing glaciation of the last ice age, and the next evidence of human habitation within Birmingham dates from the Mesolithic period. A 10,400-year-old settlement – the oldest within the city – was excavated in the Digbeth area in 2009, with evidence that hunter-gatherers with basic flint tools had cleared an area of forest by burning. Flint tools from the later Mesolithic period – between 8000 and 6000 years ago – have been found near streams in the city, though these probably represent little more than hunting parties or overnight camps.\nThe oldest man-made structures in the city date from the Neolithic era, including a possible cursus identified by aerial photography near Mere Green, and the surviving barrow at Kingstanding. Neolithic axes found across Birmingham include examples made of stone from Cumbria, Leicestershire, North Wales and Cornwall, suggesting the area had extensive trading links at the time.\n\n\n=== Bronze and Iron Ages ===\nStone axes used by the area's first farmers over 5,000 years ago have been found within the city and the first bronze axes date from around 4,000 years ago. Pottery dating back to 2700BC has been found in Bournville.\nThe most common prehistoric sites in Birmingham are burnt mounds – a form characteristic of upland areas and possibly formed by the heating of stones for cooking or steam bathing purposes. Forty to fifty have been found in the Birmingham area, all but one datable to the period 1700–1000 BC. Burnt mound sites such as that discovered in Bournville also show evidence of wider settlements, with clearances in the woodland and grazing animals. Possible Bronze Age settlements with later Iron Age farmsteads have been discovered at Langley Mill Farm in Sutton Coldfield. Further evidence of Iron Age settlement has been found at Berry Mound, a hill fort located in the Bromsgrove district of Worcestershire, near Shirley.\n\n\n== Romano-British era, c. 47–c. 6",
  "fetched_at": "2026-02-09T06:07:52.858948"
}