{
  "url": "https://en.wikipedia.org/wiki/Mandaeism",
  "title": "Mandaeism",
  "text": "Mandaeism (Classical Mandaic: ࡌࡀࡍࡃࡀࡉࡅࡕࡀ‎ mandaiuta), sometimes also known as Nasoraeanism or Sabianism, is a Gnostic, Dualistic and ethnic religion with Greek, Iranian, and Jewish influences. Its adherents, the Mandaeans, revere Adam, Abel, Seth, Enos, Noah, Shem, Aram, and especially John the Baptist. Mandaeans consider Adam, Seth, Noah, Shem, and John the Baptist prophets, with Adam being the founder of the religion and John being the greatest and final prophet.\nThe Mandaeans speak an Eastern Aramaic language known as Mandaic. The name 'Mandaean' comes from the Aramaic manda, meaning knowledge. Within the Middle East, but outside their community, the Mandaeans are more commonly known as the صُبَّة Ṣubba (singular: Ṣubbī), or as Sabians (الصابئة, al-Ṣābiʾa). The term Ṣubba is derived from an Aramaic root related to baptism. The term Sabians derives from the mysterious religious group mentioned three times in the Quran. The name of this unidentified group, which is implied in the Quran to belong to the \"People of the Book\" (ahl al-kitāb), was historically claimed by the Mandaeans as well as by several other religious groups in order to pay legal protection (dhimma) as offered by Islamic law. Occasionally, Mandaeans are also called \"Christians of Saint John\", in the belief that they were a direct survival of the Baptist's disciples. Further research, however, indicates this to be a misnomer, as Mandaeans consider Jesus to be a false prophet.\nThe core doctrine of the faith is known as Nāṣerutā (also spelled Nașirutha and meaning Nasoraean gnosis or divine wisdom) (Nasoraeanism or Nazorenism) with the adherents called nāṣorāyi (Nasoraeans or Nazorenes). These Nasoraeans are divided into tarmidutā (priesthood) and mandāyutā (laity), the latter derived from their term for knowledge manda. Knowledge (manda) is also the source for the term Mandaeism which encompasses their entire culture, rituals, beliefs and faith associated with the doctrine of Nāṣerutā. Followers of Mandaeism are called Mandaeans, but can also be called Nasoraeans (Nazorenes), Gnostics (utilizing the Greek word gnosis for knowledge) or Sabians.\nThe religion has primarily been practiced around the lower Karun, Euphrates and Tigris, and the rivers that surround the Shatt al-Arab waterway, part of southern Iraq and Khuzestan province in Iran. As of 2007, there are believed to be between 60,000 and 70,000 Mandaeans worldwide. Until the Iraq War, almost all of them lived in Iraq. Many Mandaean Iraqis have since fled their country because of the turmoil created by the 2003 invasion of Iraq and subsequent occupation by U.S. armed forces, and the related rise in sectarian violence by extremists. By 2007, the population of Mandaeans in Iraq had fallen to approximately 5,000.\nThe Mandaeans have remained separate and intensely private. Reports of them and of their religion have come primarily from outsiders: particularly from Julius Heinrich Petermann, an Orientalist; as well as from Nicolas Siouffi, a Syrian Christian who was the French vice-consul in Mosul in 1887, and British cultural anthropologist Lady E. S. Drower. There is an early if highly prejudiced account by the French traveller Jean-Baptiste Tavernier from the 1650s.\n\n\n== Etymology ==\nThe English spelling Mandaeism is a hypercorrection of Mandaism, which is built on manda using the suffix -ism.\nThe word Mandaean in turn derives from Mandaic Mandaiia, lit. 'Mandaean' (in Neo-Mandaic: Mandāʾí or Mandāyí, plural Mandayānā), which also derives from the word manda. On the basis of cognates in other Aramaic dialects, semiticists such as Mark Lidzbarski and Rudolf Macúch have translated the term manda as \"knowledge\" (cf.  Imperial Aramaic: מַנְדַּע mandaʿ in Daniel 2:21, 4:31, 33, 5:12; cf.  Hebrew: מַדַּע madda', with characteristic assimilation of /n/ to the following consonant, medial -nd- hence becoming -dd-). This etymology suggests that the Mandaeans may well be the only sect surviving from late antiquity to iden",
  "fetched_at": "2026-02-09T05:47:00.722383"
}