{
  "url": "https://en.wikipedia.org/wiki/University_of_California,_San_Francisco",
  "title": "University of California, San Francisco",
  "text": "The University of California, San Francisco (UCSF or UC San Francisco) is a public land-grant research university in San Francisco, California, United States. It is part of the University of California system and is dedicated entirely to health science and life science. It conducts research and teaching in medical and biological sciences.\nUCSF was founded as Toland Medical College in 1864. In 1873, it became affiliated with the University of California as its medical department. In the same year, it incorporated the California College of Pharmacy and in 1881 it established a dentistry school. Its facilities were located in both Berkeley and San Francisco. In 1964, the school gained full administrative independence as a campus of the UC system, headed by its own chancellor, and in 1970 it gained its current name. Historically based at Parnassus Heights with satellite facilities throughout the city, UCSF developed a second major campus in the newly redeveloped Mission Bay district in the early 2000s.\nIn 2023, UCSF received the 2nd highest research funding from the National Institutes of Health. In 2021, the university spent $1.71 billion in research and development, the second most among institutions of higher education in the U.S. With 25,398 employees, UCSF is the second-largest public agency employer in the San Francisco Bay Area. UCSF faculty have treated patients and trained residents since 1873 at the San Francisco General Hospital and for over 50 years at the San Francisco VA Medical Center.\n\n\n== History ==\n\n\n=== Beginnings ===\n\nThe University of California, San Francisco traces its history to Hugh Toland, a South Carolina surgeon who found great success and wealth after moving to San Francisco in 1852. A previous school, the Cooper Medical College of the University of the Pacific (founded 1858), entered a period of uncertainty in 1862 when its founder, Elias Samuel Cooper, died. In 1864, Toland founded a new medical school, Toland Medical College, and the faculty of Cooper Medical College chose to suspend operations and join the new school.\nThe University of California was founded on March 23, 1868, with the enacting of its Organic Act. Section 8 of the Organic Act authorized the Board of Regents to affiliate the University of California with independent self-sustaining professional colleges.  In 1870, Toland Medical School began to negotiate an affiliation with the new public university. Meanwhile, some faculty of Toland Medical School elected to reopen the Medical Department of the University of the Pacific, which would later become Stanford University School of Medicine. Negotiations between Toland and UC were complicated by Toland's demand that the medical school continue to bear his name, an issue on which he finally conceded. In March 1873, the trustees of Toland Medical College transferred it to the Regents of the University of California, and it became The Medical Department of the University of California. At the same time, the University of California also negotiated the incorporation of the California College of Pharmacy, the first pharmacy school in the West, established in 1872 by the California Pharmaceutical Society. The Pharmacy College was affiliated in June 1873, and together the Medical College and the Pharmacy College came to be known as the \"Affiliated Colleges\". The third college, the College of Dentistry, was established in 1881.\n\n\n=== Expansion and growth ===\nInitially, the three Affiliated Colleges were located at different sites around San Francisco, but near the end of the 19th Century interest in bringing them together grew. To make this possible, San Francisco Mayor Adolph Sutro donated 13 acres in Parnassus Heights at the base of Mount Parnassus (now known as Mount Sutro). The new site, overlooking Golden Gate Park, opened in the fall of 1898, with the construction of the new Affiliated Colleges buildings. The school's first female student, Lucy Wanzer, graduated in 1876, after having to app",
  "fetched_at": "2026-02-09T05:57:43.350098"
}