{
  "url": "https://en.wikipedia.org/wiki/Andrei_Orlov",
  "title": "Andrei Orlov",
  "text": "Andrei A. Orlov is an American professor of Judaism and Christianity in Antiquity at Marquette University. He \"is a specialist in Jewish Apocalypticism and Mysticism, Second Temple Judaism, and Old Testament Pseudepigrapha. Within the field of Second Temple Jewish apocalyptic literature, Orlov is considered among the leading experts in the field of Slavonic texts related to Jewish mysticism and Enochic traditions.\" He \"has established himself as a significant voice in the study of Second Temple Jewish traditions, especially those associated with 2 Enoch and other Slavonic Pseudepigrapha.\"  Orlov is a veteran of the Enoch seminar and a member of the Advisory Board of the journal Henoch.\n\n\n== Publications ==\nA full list of publications can be found on the subjects' website.\n\n\n=== Books ===\nThe Enoch-Metatron Tradition (Texts and Studies in Ancient Judaism, 107; Tuebingen: Mohr-Siebeck, 2005) ISBN 3-16-148544-0.\nFrom Apocalypticism to Merkabah Mysticism: Studies in the Slavonic Pseudepigrapha (Supplements to the Journal for the Study of Judaism, 114; Leiden: Brill, 2007) ISBN 90-04-15439-6.\nDivine Manifestations in the Slavonic Pseudepigrapha (Orientalia Judaica Christiana, 2; Gorgias, 2009) ISBN 1-60724-407-1.\nSelected Studies in the Slavonic Pseudepigrapha (Studia in Veteris Testamenti Pseudepigrapha, 23; Leiden: Brill, 2009) ISBN 90-04-17879-1.\nDark Mirrors: Azazel and Satanael in Early Jewish Demonology (New York: SUNY Press, 2011) ISBN 978-1-4384-3951-8.\nПотаенные Книги: Иудейская Мистика в Славянских Апокрифах (Concealed Writings: Jewish Mysticism in the Slavonic Pseudepigrapha) (Flaviana; Moscow: Gesharim, 2011) [in Russian] The ISBN printed in the document (978-5-93273-340-3) is bad; it causes a checksum error.\nHeavenly Priesthood in the Apocalypse of Abraham (Cambridge: Cambridge University Press, 2013) ISBN 978-1-1070-3907-0.\nResurrection of the Fallen Adam: Ascension, Transfiguration, and Deification of the Righteous in Early Jewish Mysticism (Moscow: RSUH, 2014) ISBN 978-5-98604-435-4.\nDivine Scapegoats: Demonic Mimesis in Early Jewish Mysticism (Albany: SUNY, 2015) ISBN 978-1-4384-5583-9.\nВоскрешение Ветхого Адама: Вознесение, преображение и обожение праведника в ранней иудейской мистике. Второе Расширенное и Дополненное Издание (Symbol, 66; Moscow: Institute of St. Thomas, 2015) [in Russian] ISSN 0222-1292.\nThe Atoning Dyad: The Two Goats of Yom Kippur in the Apocalypse of Abraham (Studia Judaeoslavica, 8; Leiden: Brill, 2016) ISBN 978-9-0043-0821-3.\nLikeness of Heaven: Azazel, Satanael, and Leviathan in Jewish Apocalypticism (Moscow: Lechaim, 2016) [in Russian] ISBN 978-5-9953-0486-9.\nYahoel and Metatron: Aural Apocalypticism and the Origins of Early Jewish Mysticism (TSAJ; Tübingen: Mohr Siebeck, 2017) ISBN 978-3-1615-5447-6.\nThe Greatest Mirror: Heavenly Counterparts in the Jewish Pseudepigrapha (Albany: SUNY, 2017) ISBN 978-1-4384-6691-0.\n\n\n=== Edited volumes ===\nL’église des deux Alliances: Mémorial Annie Jaubert (1912–1980) (eds. B. Lourié, A. Orlov, M. Petit; 2nd edition; Orientalia Judaica Christiana, 1; Gorgias, 2008) ISBN 1-59333-083-9.\nThe Theophaneia School: Jewish Roots of Eastern Christian Mysticism (Scrinium III; eds. B. Lourie and A. Orlov; Gorgias, 2009) ISBN 1-60724-083-1.\nSymbola Caelestis: Le symbolisme liturgique et paraliturgique dans le monde chrétien (Scrinium V; eds. A. Orlov and B. Lourie, Gorgias, 2009) ISBN 978-1-60724-665-7.\nWith Letters of Light: Studies in the Dead Sea Scrolls, Early Jewish Apocalypticism, Magic and Mysticism (Ekstasis: Religious Experience from Antiquity to the Middle Ages, 2; eds. Daphna Arbel and Andrei Orlov, De Gruyter, 2010) ISBN 978-3-11-022201-2.\nNew Perspectives on 2 Enoch: No Longer Slavonic Only (eds. A. Orlov, G. Boccaccini, J. Zurawski; Studia Judaeoslavica, 4; Leiden: Brill, 2012) ISBN 978-900-423013-2.\nArs Christiana. In Memoriam of Michail E. Murianov, Part I (Scrinium VII; eds. R. Krivko, B. Lourié, A. Orlov; Gorgias, 2012) ISBN 978-1-4632-0186-9.\nArs ",
  "fetched_at": "2026-02-09T02:45:18.008533"
}