{
  "url": "https://en.wikipedia.org/wiki/Antisemitism",
  "title": "Antisemitism",
  "text": "Antisemitism or Jew-hatred is hostility to, prejudice towards, or discrimination against Jews. A person who harbours it is called an antisemite. Whether antisemitism is considered a form of racism depends on the school of thought. Antisemitic tendencies may be motivated primarily by negative sentiment towards Jews as a people or negative sentiment towards Jews with regard to Judaism. In the former case, usually known as racial antisemitism, a person's hostility is driven by the belief that Jews constitute a distinct race with inherent traits or characteristics that are repulsive or inferior to the preferred traits or characteristics within that person's society. In the latter case, known as religious antisemitism, a person's hostility is driven by their religion's perception of Jews and Judaism, typically encompassing doctrines of supersession that expect or demand Jews to turn away from Judaism and submit to the religion presenting itself as Judaism's successor faith—this is a common theme within the other Abrahamic religions. The development of racial and religious antisemitism has historically been encouraged by anti-Judaism, which is distinct from antisemitism itself.\nThere are various ways in which antisemitism is manifested, ranging in the level of severity of Jewish persecution. On the more subtle end, it consists of expressions of hatred or discrimination against individual Jews and may or may not be accompanied by violence. On the most extreme end, it consists of pogroms or genocide, which may or may not be state-sponsored. Although the term antisemitism did not come into common usage until the 19th century, it is also applied to previous and later anti-Jewish incidents. Historically, most of the world's violent antisemitic events have taken place in Europe, where modern antisemitism began to emerge from antisemitism in Christian communities during the Middle Ages. Since the early 20th century, there has been a sharp rise in antisemitic incidents across the Arab world, largely due to the advent of Arab antisemitic conspiracy theories, which were influenced by European antisemitic conspiracy theories.\nBeginning in 1879, the compound word antisemitismus was first used in print in Germany as a \"scientific-sounding term\" for Judenhass (lit. 'Jew-hatred'), and it has since been used to refer to anti-Jewish sentiment alone. In the 21st century, the idea that there is a variation of antisemitism known as \"new antisemitism\" has emerged on several occasions. According to this view, since Israel is a Jewish state, expressions of anti-Zionist positions could harbour antisemitic sentiments, and criticism of Israel can serve as a vehicle for attacks against Jews in general.\n\n\n== Origin and usage ==\n\n\n=== Etymology ===\n\nFirst used in the 1770s by members of the Göttingen school of history, the coining of \"Semites\" as a biblical terminology for race was derived from Shem (שֵׁם), one of the three sons of Noah in the Book of Genesis, together with the parallel terms Hamites and Japhetites.\nThe origin of \"antisemitic\" terminologies is found in the responses of orientalist Moritz Steinschneider to the views of orientalist Ernest Renan. Historian Alex Bein writes: \"The compound anti-Semitism appears to have been used first by Steinschneider, who challenged Renan on account of his 'anti-Semitic prejudices' [i.e., his derogation of the Semites as a race].\" Psychologist Avner Falk similarly writes: \"The German word \"antisemitisch\" was first used in 1860 by the Austrian Jewish scholar Moritz Steinschneider (1816–1907) in the phrase \"antisemitische Vorurteile\" (antisemitic prejudices). Steinschneider used this phrase to characterise the French philosopher Ernest Renan's false ideas about how 'Semitic races' were inferior to 'Aryan races'\".\nPseudoscientific theories concerning race, civilization, and \"progress\" had become quite widespread in Europe in the second half of the 19th century, especially as Prussian nationalistic historian Heinrich ",
  "fetched_at": "2026-02-09T05:26:03.780419"
}