{
  "url": "https://en.wikipedia.org/wiki/Against_the_Giants",
  "title": "Against the Giants",
  "text": "Against the Giants is an adventure module written by Gary Gygax and published by TSR in 1981 for the Dungeons & Dragons fantasy role-playing game.  It combines the G series of modules previously published in 1978: Steading of the Hill Giant Chief, Glacial Rift of the Frost Giant Jarl, and Hall of the Fire Giant King.  All three were produced for use with the 1st edition Advanced Dungeons & Dragons rules. In 1999, to recognize the 25th anniversary of TSR, the company released an updated version, Against the Giants: The Liberation of Geoff. Later in 1999, Wizards of the Coast published a novelization of Against the Giants by Ru Emerson.\nThe plot of each of the three original modules focuses on a different type of evil giant. Each can be played as a standalone adventure, or as a series.  In Steading of the Hill Giant Chief, a tribe of hill giants have been raiding lands occupied by humans, and the humans hire the player characters to defeat them. Glacial Rift of the Frost Giant Jarl pits the player characters against the evil Jarl of the frost giants. Hall of the Fire Giant King concludes the series, this time against a group of fire giants. The first two modules disclose the existence of a secret force behind the giants, which in the third module is revealed to be evil drow elves. The plot involving the drow continues in four additional modules printed between 1978 and 1980.\nThe modules were well received by contemporary critics. In 1978, they earned a 9/10 overall rating from a White Dwarf magazine reviewer, who was impressed that Gygax found time to write them while also working on the Advanced Dungeons & Dragons (AD&D) rulebooks. White Dwarf also reviewed the re-released G module series in 1982, giving it a 10 out of 10. The Queen of the Spiders supermodule, which consisted of the three modules combined with the subsequent modules in the \"D\" series and Q1 Queen of the Demonweb Pits, was voted the single greatest adventure of all time by Dungeon magazine in 2004, on the 30th anniversary of the Dungeons & Dragons game.\n\n\n== Plot summary ==\nEach of the original three modules is a dungeon crawl. The player characters focus on battling first hill giants, then frost giants, and finally fire giants, three of the original evil giant types used in Dungeons & Dragons.\n\n\n=== G1 Steading of the Hill Giant Chief ===\nThe module begins with a prologue explaining that giants of different types have been raiding lands occupied by humans. Angered by this, the human rulers hire a group of adventurers (the player characters) to \"punish the miscreant giants.\" The players' party is informed that they must defeat the giants, or have their heads placed on the chopping block. The human nobles equip the party with weapons and horses, along with a guide and a map that shows the location of the hill giants. The players are informed that the hill giants are led by Nosnra, a sly hill giant chieftain who loves to set up ambushes; there is an unknown force binding together different giant groups. The player characters are informed that they may keep any spoils they find, but must return at once if they determine what \"sinister hand\" is behind the alliance.\nThe bulk of the adventure takes place in two locations: the upper level fortress of the hill giants' lair, and the dungeon level beneath it. In the upper level there are halls, barracks and common rooms. These rooms house Chief Nosnra and other hill giants, ogres, and servants. The dungeon level consists of slave quarters, torture chambers, and caverns. These house troglodytes, bugbears, and carrion crawlers. The majority of the treasure can be found by searching the dungeons. The chief's treasure room contains a map of the glacial rift from Glacial Rift of the Frost Giant Jarl, and a magic chain that automatically transports the party there.\n\n\n=== G2 Glacial Rift of the Frost Giant Jarl ===\nThis module starts in one of two ways. If the players have finished Steading of the Hill Giant Chief, they have bee",
  "fetched_at": "2026-02-09T05:58:25.673847"
}