{
  "url": "https://en.wikipedia.org/wiki/Sodom_and_Gomorrah",
  "title": "Sodom and Gomorrah",
  "text": "In the Abrahamic religions, Sodom and Gomorrah () were two cities destroyed by God for their wickedness. Their story parallels the Genesis flood narrative in its theme of God's anger provoked by man's sin (see Genesis 19:1–28). They are mentioned frequently in the Nevi'im section of the Hebrew Bible as well as in the New Testament as symbols of human wickedness and divine retribution, and the Quran contains a version of the story about the two cities.\nThese cities are depicted as two of the \"cities of the plain\" involved in Abraham and Lot's story, including rebellion against Chedorlaomer and their eventual rescue by Abraham. Sodom and Gomorrah are later destroyed by God after their pervasive wickedness, with Lot and his daughters spared while Lot's wife is turned into a pillar of salt for looking back.\nBiblical and deuterocanonical texts expand on the story, portraying Sodom and Gomorrah as symbols of sin, often linked to adultery, arrogance, inhospitality, and oppression of the poor, rather than explicitly sexual immorality. References in the New Testament, including Matthew, Luke, Jude, and Revelation, use the cities as warnings of divine judgment, with some interpretations highlighting sexual transgressions, while others emphasize violence, injustice, and violations of hospitality. Scholars debate the precise nature of the sins, noting that the Hebrew term \"'yada'\" (to \"know\") in Genesis 19:5 could imply sexual assault but may also be interpreted as a demand to interrogate or dominate visitors, reflecting the cities' moral corruption more broadly.\nHistorically, Sodom and Gomorrah may have been based on real locations along the Dead Sea, with sites like Bab edh-Dhra and Numeira suggested as possible candidates, though archaeological evidence is inconclusive. Religious interpretations vary: Judaism often stresses cruelty, arrogance, and inhospitality as the cities' sins, while Christianity debates the relative importance of sexual immorality versus violent, inhospitable behavior. The Quran similarly recounts the story of Lot (Lut), emphasizing homosexual transgression and disobedience to God. Gnostic texts, in contrast, present the destruction as a consequence of spiritual ignorance and demonically influenced human nature.\n\n\n== Etymology ==\n\nThe etymology of the names Sodom and Gomorrah is uncertain, and scholars disagree about their origins. According to Burton MacDonald, the Hebrew term for Gomorrah was based on the Semitic root ʿ-m-r, which means \"be deep, copious (water)\".\nThey are known in Hebrew as סְדֹם (Səḏôm) and עֲמֹרָה (ʿĂmôrā). In the Septuagint, these became Σόδομα (Sódoma) and Γόμορρᾰ (Gómorrha); Biblical Hebrew ghayn merged with ayin after the Septuagint was transcribed.\n\n\n== Biblical narrative ==\n\n\n=== Lot and Chedorlaomer ===\nSodom and Gomorrah are two of the five \"cities of the plain\" referred to in Abraham and Lot's conflict (Genesis 13:12) and the story of Lot's daughters (Genesis 19:29) that rebel against Chedorlaomer of Elam, to whom they were subject. At the Battle of Siddim, Chedorlaomer defeats them and takes many captives, including Lot, the nephew of the Hebrew patriarch Abraham. Abraham gathers his men, rescues Lot, and frees the cities.\n\n\n=== Destruction of the cities ===\n\nLater, God gives notice to Abraham that Sodom had a reputation for wickedness. Abraham asks God \"Will you sweep away the righteous with the wicked?\" (Genesis 18:23). Starting at 50 people, Abraham negotiates with God to spare Sodom if ten righteous people could be found.\nGod sends two male messengers to destroy Sodom. Lot welcomes them into his home, but all the men of the town surround the house and demand that he surrender the visitors that they may \"know\" them carnally. (Genesis 19:5) Lot offers the mob his virgin daughters to \"do to them as you please\", but they refuse and threaten to do worse to Lot. The angels strike the crowd blind.\nThe messengers tell Lot, \"For we are about to destroy this place; because the outcry agai",
  "fetched_at": "2026-02-09T02:51:31.699766"
}