{
  "url": "https://en.wikipedia.org/wiki/List_of_parliaments_of_England",
  "title": "List of parliaments of England",
  "text": "This is a list of parliaments of England from the reign of King Henry III, when the Curia Regis developed into a body known as Parliament, until the creation of the Parliament of Great Britain in 1707.\nFor later parliaments, see the List of parliaments of Great Britain. For the history of the English Parliament, see Parliament of England.\nThe parliaments of England were traditionally referred to by the number counting forward from the start of the reign of a particular monarch, unless the parliament was notable enough to come to be known by a particular title, such as the Good Parliament or the Parliament of Merton.\n\n\n== Parliaments of Henry III ==\n\n\n== Parliaments of Edward I ==\n\n\n== Parliaments of Edward II ==\n\n\n== Parliaments of Edward III ==\n\n\n== Parliaments of Richard II ==\n\n\n== Parliaments of Henry IV ==\n\n\n== Parliaments of Henry V ==\n\n\n== Parliaments of Henry VI ==\n\n\n== Parliaments of Edward IV ==\n\n\n== Parliament of Richard III ==\n\n\n== Parliaments of Henry VII ==\n\n\n== Parliaments of Henry VIII ==\n\n\n== Parliaments of Edward VI ==\n\n\n== Parliaments of Mary I ==\n\n\n== Parliaments of Elizabeth I ==\n\n\n== Parliaments of James I ==\n\n\n== Parliaments of Charles I ==\nThe Long Parliament, which commenced in this reign, had the longest term and the most complex history of any English Parliament. The entry in the first table below relates to the whole Parliament. Although it rebelled against King Charles I and continued to exist long after the King's death, it was a Parliament he originally summoned. An attempt has been made to set out the different phases of the Parliament in the second table in this section and in subsequent sections. The phases are explained in a note.\n\n\n=== The Long Parliament (Royalist phases) ===\n\n\n== Parliaments of the Revolution and Commonwealth ==\n\n\n== Parliaments of the Protectorate ==\n\nThese parliaments included representatives of Scotland and Ireland.\n\n\n== Parliaments of the Commonwealth ==\n\n\n== Parliaments of Charles II ==\n\n\n== Parliament of James II ==\n\n\n== Parliaments of William III and Mary II ==\n\nNote: The Convention Parliament of 1689 is usually referred to as the 1st Parliament of William & Mary and thus the 1690 parliament is referred to as the \"Second Parliament\". The very first act of the 1690 parliament (2 Will. & Mar., c.1) was to legitimise the Convention parliament as a lawfully-summoned parliament.\nNote: Queen Mary II died in December 1694, during the sixth session of the second parliament. Subsequent parliamentary sessions are labelled as \"William III\" alone (rather than \"William & Mary\"), but their numbering is not reset. The next parliament (1695) is conventionally called the \"third parliament\", the 1698 parliament the \"fourth parliament\" etc.\n\n\n== Parliaments of Anne ==\n\nOn 29 April 1707, the Parliament of Great Britain was constituted. The members of the 2nd Parliament of Queen Anne became part of the 1st Parliament of Great Britain.\n\n\n== See also ==\nDuration of English parliaments before 1660\nDuration of English, British and United Kingdom parliaments from 1660\nLists of MPs elected to the English parliament\nList of MPs elected to the English parliament in 1593\nList of MPs elected to the English parliament in 1597\nList of MPs elected to the English parliament in 1601\nList of MPs elected to the English parliament in 1604\nList of MPs elected to the English parliament in 1614\nList of MPs elected to the English parliament in 1621\nList of MPs elected to the English parliament in 1624\nList of MPs elected to the English parliament in 1625\nList of MPs elected to the English parliament in 1626\nList of MPs elected to the English parliament in 1628\nList of MPs elected to the English parliament in April 1640\nList of MPs elected to the English parliament in November 1640\nList of MPs elected to the English parliament in 1654\nList of MPs elected to the English parliament in 1656\nList of MPs elected to the English parliament in 1659\nList of MPs elected to the English Parliament in 1660\nList of MPs elec",
  "fetched_at": "2026-02-09T06:25:58.973805"
}