{
  "url": "https://en.wikipedia.org/wiki/Enoch_calendar",
  "title": "Enoch calendar",
  "text": "The Enoch calendar (or Enochian calendar) is an ancient calendar described in the pseudepigraphal Book of Enoch. It divided the year into four seasons of exactly 13 weeks. Each season consisted of two 30-day months followed by one 31-day month, with the 31st day ending the season, so that Enoch's year consisted of exactly 364 days.\nThe Enoch calendar was purportedly given to Enoch by the angel Uriel. Four named days, inserted as the 31st day of every third month, were named instead of numbered, which \"placed them outside the numbering\". The Book of Enoch gives the count of 2,912 days for 8 years, which divides out to exactly 364 days per year. This specifically excludes any periodic intercalations.\n\n\n== Evaluation ==\nCalendar expert John Pratt wrote that\n\n\"The Enoch calendar has been criticized as hopelessly primitive because, with only 364 days, it would get out of sync with the seasons so quickly: In only 25 years the seasons would arrive an entire month early. Such a gross discrepancy, however, merely indicates that the method of intercalation has been omitted.\"\nPratt pointed out that by adding an extra week at the end of every seventh year (or Sabbatical year), and then adding an additional extra week to every fourth Sabbatical year (or every 28 years), the calendar could be as accurate as the Julian calendar:\n\n  \n    \n      \n        \n          (\n          \n            \n              \n                \n                   \n                  52\n                   \n                  \n                    \n                      w\n                      e\n                      e\n                      k\n                      s\n                    \n                  \n                   \n                \n                \n                   \n                  1\n                   \n                  \n                    \n                      y\n                      e\n                      a\n                      r\n                    \n                  \n                   \n                \n              \n            \n            +\n            \n              \n                \n                   \n                  1\n                   \n                  \n                    \n                      w\n                      e\n                      e\n                      k\n                    \n                  \n                   \n                \n                \n                   \n                  7\n                   \n                  \n                    \n                      y\n                      e\n                      a\n                      r\n                      s\n                    \n                  \n                   \n                \n              \n            \n            +\n            \n              \n                \n                   \n                  1\n                   \n                  \n                    \n                      w\n                      e\n                      e\n                      k\n                    \n                  \n                   \n                \n                \n                   \n                  28\n                   \n                  \n                    \n                      y\n                      e\n                      a\n                      r\n                      s\n                    \n                  \n                   \n                \n              \n            \n          \n          )\n        \n         \n        ×\n         \n        \n          \n            \n               \n              7\n               \n              \n                \n                  d\n                  a\n                  y\n                  s\n                \n              \n               \n            \n            \n               \n              1\n               \n              \n                \n                  w\n                  e\n                  e\n                  k\n                \n              \n               \n            \n          \n        \n      \n    \n    {\\displaystyle \\left",
  "fetched_at": "2026-02-09T06:15:57.779745"
}