{
  "url": "https://en.wikipedia.org/wiki/List_of_Unicode_characters",
  "title": "List of Unicode characters",
  "text": "As of Unicode version 17.0, there are 297,334 assigned characters with code points, covering 172 modern and historical scripts, as well as multiple symbol sets. As it is not technically possible to list all of these characters in a single page, this list is limited to a subset of the most important characters for English-language readers, with links to other pages which list the supplementary characters. This article includes the 1,062 characters in the Multilingual European Character Set 2 (MES-2) subset, and some additional related characters.\n\n\n== Character reference overview ==\n\nHTML and XML provide ways to reference Unicode characters when the characters themselves either cannot or should not be used. A numeric character reference refers to a character by its Universal Character Set/Unicode code point, and a character entity reference refers to a character by a predefined name.\nA numeric character reference uses the format\n\n&#nnnn;\nor\n\n&#xhhhh;\nwhere nnnn is the code point in decimal form, and hhhh is the code point in hexadecimal form. The x must be lowercase in XML documents. The nnnn or hhhh may be any number of digits and may include leading zeros. The hhhh may mix uppercase and lowercase, though uppercase is the usual style.\nIn contrast, a character entity reference refers to a character by the name of an entity which has the desired character as its replacement text. The entity must either be predefined (built into the markup language) or explicitly declared in a Document Type Definition (DTD). The format is the same as for any entity reference:\n\n&name;\nwhere name is the case-sensitive name of the entity. The semicolon is required.\nBecause numbers are harder for humans to remember than names, character entity references are most often written by humans, while numeric character references are most often produced by computer programs.\n\n\n== Control codes ==\n\n65 characters, including DEL. All belong to the common script.\n\nFootnotes:\n\n1 Control-C has typically been used as a \"break\" or \"interrupt\" key.\n2 Control-D has been used to signal \"end of file\" for text typed in at the terminal on Unix / Linux systems. Windows, MS-DOS, and older minicomputers used Control-Z for this purpose.\n3 Control-G is an artifact of the days when teletypes were in use. Important messages could be signaled by striking the bell on the teletype. This was carried over on PCs by generating a buzz sound.\n4 Line feed is used for \"end of line\" in text files on Unix / Linux systems.\n5 Carriage Return (accompanied by line feed, and thus usually written as 'CRLF') is used as \"end of line\" character by Windows, MS-DOS, and most minicomputers other than Unix- / Linux-based systems. Classic Mac OS and other vintage OS used CR only.\n6 Control-O has been the \"discard output\" key. Output is not sent to the terminal, but discarded, until another Control-o is typed.\n7 Control-Q has been used to tell a host computer to resume sending output after it was stopped by Control-S.\n8 Control-S has been used to tell a host computer to postpone sending output to the terminal. Output is suspended until restarted by the Control-Q key.\n9 Control-U was originally used by Digital Equipment Corporation computers to cancel the current line of typed-in text. Other manufacturers used Control-X for this purpose.\n10 Control-X was commonly used to cancel a line of input typed in at the terminal.\n11 Control-Z has commonly been used on minicomputers, Windows and MS-DOS systems to indicate \"end of file\" either on a terminal or in a text file. Unix / Linux systems use Control-D to indicate end-of-file at a terminal.\n\n\n== Latin script ==\n\nThe Unicode Standard (version 17.0) classifies 1,492 characters as belonging to the Latin script.\n\n\n=== Basic Latin ===\n\n95 characters; the 52 alphabet characters belong to the Latin script. The remaining 43 belong to the common script.\nThe 33 characters classified as ASCII Punctuation & Symbols are also sometimes referred to as ASCII special characters",
  "fetched_at": "2026-02-09T06:13:36.238973"
}