{
  "url": "https://en.wikipedia.org/wiki/List_of_characters_in_mythology_novels_by_Rick_Riordan",
  "title": "List of characters in mythology novels by Rick Riordan",
  "text": "A description of most characters featured in various mythology series by Rick Riordan.\n\n\n== Camp Half-Blood Chronicles ==\n\n\n=== Introduced in Percy Jackson & the Olympians ===\n\n\n==== Percy Jackson ====\n\nPerseus Jackson, commonly known as Percy Jackson, is a demigod, son of the mortal Sally Jackson and the Greek god of the sea, Poseidon. Percy lives on the Upper East Side of Manhattan. He has black hair and sea-green eyes. He has inherited special abilities from Poseidon, which include the ability to control water, boats, and ships; create small hurricanes; breathe and see clearly underwater; and talk to horse-like creatures and most aquatic animals. He struggles in his mortal life, having ADHD and dyslexia. This made him at first the subject of bullying from his peers. Percy is the first-person narrator in the Percy Jackson & the Olympians series and The Senior Year Adventures series.\nPercy Jackson is a gifted swordsman using his shape-shifting sword pen Anaklusmos (ancient Greek for \"Riptide\") for battle. It always appears back in his pocket even if he loses it. He is currently dating Annabeth Chase. \nIn the films, Percy Jackson is portrayed by Logan Lerman. In the musical, he is portrayed by Chris McCarrell. Walker Scobell portrays the role in the TV series, with Azriel Dalman playing a younger Percy in flashbacks.\n\n\n==== Grover Underwood ====\nGrover Underwood is a satyr and Percy's best friend. He has curly reddish-brown hair and fur, acne, and a wispy goatee. His horns grow larger as the series progresses, and he must take increasingly careful measures to hide them and his goat legs while posing as a human. When he first appears, he walks with crutches, which Percy eventually learns are to hide his goat-like trot. Also, he has a taste for enchiladas. He uses reed pipes to play music and sometimes has a cudgel. In The Battle of the Labyrinth, Grover is bestowed a part of Pan's essence by the Lord of the Wild himself Pan. Grover also begins a relationship with the dryad Juniper.\nIn The Lightning Thief, he gets a \"searcher's license\" after delivering Percy safely, allowing him to search for the lost god Pan. When Polyphemus captures him in The Sea of Monsters, he activates an empathic link with Percy that he had established a year prior and allows telepathic communication across great distances. At the end of The Last Olympian, he is named a Lord of the Wild and given a seat on the satyrs' ruling council, the Council of Cloven Elders.\nIn The Heroes of Olympus series, Grover mainly appears as one of Camp Half-Blood's satyr allies reporting on Gaea's rising and participating in negotiations with the Romans to get Reyna to help transport the Athena Parthenos statue across the world.\nIn The Dark Prophecy, Meg McCaffrey summons Grover after getting a prophecy stating that she and Apollo will need a satyr guide. In The Burning Maze, Grover guides the two through the Labyrinth and, alongside the other nature spirits, aids in their fight against Medea and Caligula. After the death of Medea and Helios fading from existence, ending the California wildfires that he was causing, Grover returns to Camp Half-Blood.\nIn The Chalice of the Gods, Grover volunteers to join Percy's quests to get recommendation letters from the gods so that he can get into New Rome University. Grover uses his nature spirit connections to help search for Ganymede's chalice of immortality and then to help Percy sneak into Mount Olympus to return it to Ganymede in the midst of Zeus' brunch for his mother Rhea.\nIn Wrath of the Triple Goddess, Grover drinks a strawberry-flavored potion. He destroys Hecate's mansion and Hecuba and Gale escape the mansion, but, later in the book, he helps to fix the mansion and get the pets back.\nIn the films, he is portrayed by Brandon T. Jackson and Bjorn Yearwood as young Grover in the second film. In the musical, he is portrayed by George Salazar. Aryan Simhadri portrays Grover in the TV series.\n\n\n==== Annabeth Chase ====\n\nAnnabeth ",
  "fetched_at": "2026-02-09T05:58:00.688907"
}