{
  "url": "https://en.wikipedia.org/wiki/Removal_of_Confederate_monuments_and_memorials",
  "title": "Removal of Confederate monuments and memorials",
  "text": "There are more than 160 Confederate monuments and memorials to the Confederate States of America (CSA; the Confederacy) and associated figures that have been removed from public spaces in the United States, all but three of them since 2015. Some have been removed by state and local governments; others have been torn down by protestors.\nMore than seven hundred monuments and memorials have been created on public land, the vast majority in the South during the era of Jim Crow laws from 1877 to 1964. Efforts to remove them began after the Charleston church shooting, the Unite the Right rally, and the murder of George Floyd later increased.\nProponents of the removal of the monuments cite historical analysis which supports their belief that the monuments were not built as memorials, instead, they were built to intimidate African Americans and reaffirm white supremacy after the Civil War; and that they memorialize an unrecognized, treasonous government, the Confederacy, whose founding principle was the perpetuation and expansion of slavery. They also argue that the presence of these memorials more than a hundred years after the defeat of the Confederacy continues to disenfranchise and alienate African Americans. However, opponents believe that the removal of the monuments is the erasure of history, or they believe that it is a sign of disrespect for their Southern heritage. Some Southern states passed state laws restricting or prohibiting the removal or alteration of public monuments.\nAccording to The Washington Post, five Confederate monuments were removed after the Civil War, eight in the two years after the Charleston shooting, 48 in the three years after the Unite the Right rally, and 110 in the two years after George Floyd's murder. In 2022, Defense Secretary Lloyd Austin said he would order the renaming of U.S. military bases which are named after Confederate generals, as well as the renaming of other Defense Department property that honors Confederates.\nThe campaign to remove monuments has been extended beyond the United States; around the world, many statues and other public works of art which are related to the transatlantic slave trade and European colonialism have been removed or destroyed.\n\n\n== Background ==\n\nMost of the Confederate monuments on public land were built during periods of racial conflict, such as the period when Jim Crow laws were being passed during the late 19th century as well as at the start of the 20th century or the period of the civil rights movement of the 1950s and 1960s. These two periods also coincided with the 50th and 100th year after the end of the Civil War, including the American Civil War Centennial.  The peak in construction of Civil War monuments occurred between the late 1890s up to 1920, with a second smaller peak in the late-1950s to mid-1960s.\n\n\n== Academic commentary ==\n\nIn an August 2017 statement on the monuments controversy, the American Historical Association (AHA) said that to remove a monument \"is not to erase history, but rather to alter or call attention to a previous interpretation of history\". The AHA said that most monuments were erected \"without anything resembling a democratic process\", and recommended that it was \"time to reconsider these decisions\". Most Confederate monuments were erected during the late-nineteenth and early-twentieth century, and this undertaking was \"part and parcel of the initiation of legally mandated segregation and widespread disenfranchisement across the South\". Memorials to the Confederacy erected during this period \"were intended, in part, to obscure the terrorism required to overthrow Reconstruction, and to intimidate African Americans politically and isolate them from the mainstream of public life\". A later wave of monument building coincided with the civil rights movement, and according to the AHA, \"these symbols of white supremacy are still being invoked for similar purposes.\"\nMichael J. McAfee, curator of history at the West Point Museum, ",
  "fetched_at": "2026-02-09T05:48:12.018074"
}