{
  "url": "https://en.wikipedia.org/wiki/1860_Grand_National",
  "title": "1860 Grand National",
  "text": "The 1860 Grand National was the 22nd renewal of the Grand National horse race that took place at Aintree near Liverpool, England, on 7 March 1860.\n\n\n== The Course ==\nThe course was unchanged from the previous year. First circuit: Starting from the field used every year since 1851, Fence 1 {15} Bank, Fence 2 {16} Hedge and ditch, Fence 3 {17} Post and Rails, Fence 4 {18} Rails and ditch, Fence 5 {19} Becher's Brook, Fence 6 {20} Rails and a ditch, Fence 7 {21} Post and rails Fence 8 {22} Canal side turn bank, Fence 9 {23} Valentine's Brook, Fence 10 {24} Ditch and quickset, Fence 11 {25} Post and rails, Fence 12 {26} Stump hedge and ditch.\nThe runners then turned at the first opportunity on re-entering the racecourse and made towards the fences in front of the stands. Fence 13 Thorn topped hurdles, Fence 14 Made brook 15' wide.\nSecond circuit: The runners then turned away from the Grandstands again and crossed Proceed's lane, following the same circuit until reaching the racecourse again. This time the runners continued to the wider extreme of the course before turning to run up the straight in front of the stands where Fence 27 the Distance hurdles had to be jumped.\nThe runners then bypassed the Gorsed Hurdle and Made brook inside before reaching the winning post in front of the Main Stand.\n\n\n== Build up and leading contenders ==\nTwenty five horses appeared on the race card but only nineteen lined up with six non runners, including the heavily backed Jealousy, which caused much anger among the many of the crowd.\nAnatis had been the favourite for weeks before the race. Since finishing fifth last year, the horse had run seven times, winning at Shrewsbury, Abergavenny and the Grand Annual at Worcester. Tommy Pickernell, an amateur who rode under a pseudonym, Mr Thomas retained the last year. Described as a powerful tearing mare who was trained specifically for the National, The public had huge faith in the mare on that basis. \nTease had already been sent of as a Grand National favourite two years earlier under the name Little Tom but with Ben Land Junior in the saddle, had fallen twice. Now renamed, he was again a hugely popular choice with the public. George Ede, another amateur who rode under a pseudonym, Mr Edwards was booked to ride but when the horse trod on his own bandages, revealing suspiciously fragile legs and also throwing Ede, who was too shaken to ride in the race. Walter White, whose own mount had already been withdrawn, was quickly booked to ride. By then many in the crowd had seen enough for his price to drift out from 5/1 to 7/1 at the off.\nXanthus had been going well when coming to grief in the previous years race, having finished third the year before, both with Gus Balchin in the saddle, who took the ride for a third time. His previous experience stood him in good stead and he galloped in great style in the preliminaries, being sent off at 10/1.\nMaria Agnes was a picture of perfection in the paddock and with George Stevens in the saddle was a naturally popular choice at 10/1\nLinkboy was another that looked particularly good in the paddock and in the canters with Willy Bevill taking his second ride in the race at 12/1. \n\n\n== The race ==\nThe runners were sent away to a good first time start, taking the first fence in a cluster before Congreve and Miss Harkaway both refused the second fence. \nXanthus white jacket and blue garters was showing in front by the third fence before Goldsmith rushed to the front at the fourth, setting a harsh pace by Becher's Brook with The Curate, Xanthus and Telegram all well up with Kilcock, Maria Agnes and Brunette heading the remainder with last placed Sir Robert less than a dozen lengths behind the leader. \nThe Curate took a heavy fall at the post and rails beyond Becher's, with, several of those behind him having to take avoiding action. Goldsmith unshipped Land when swerving and Clay's battles to stay on board Shylock cost him a good sixty yards, while Captain Townley lost both ",
  "fetched_at": "2026-02-09T02:51:31.544125"
}