{
  "url": "https://en.wikipedia.org/wiki/Mar_Ammo",
  "title": "Mar Ammo",
  "text": "Mar Ammo was a 3rd-century Manichean disciple of the prophet Mani. According to Manichaen tradition he spread Manichaeism eastward into Sogdiana during the time period when Mani was living. Mar Ammo is well known as the apostle of the east in Manichean literature nevertheless his exact origins are unknown. His Syriac name (from ʿAmmānūēl) may denote that he was Syrian in origin. However, a Parthian origin may also be seen and is mentioned by some scholars, especially due to his outstanding role in establishing the Parthian language as the official language of the eastern Manichean Church, later to be replaced by Sogdian in the sixth century. Furthermore, Mar Ammo is widely regarded as the composer of the Manichaean Parthian hymn-cycles (Huwīdagmān and Angad Rōšnan).\n\n\n== Missionary work ==\nOn his way to eastern Iran, Mar Ammo was accompanied by the Parthian prince Ardavan. According to Manichaean tradition, when he reached the river Oxus on the Sogdian frontier the spirit who guarded it denied Mar Ammo entry across it. Mar Ammo fasted and prayed for two days and he either was confronted by Mani or had a vision of him who told him to read a chapter from his book The Treasury of Life which is generally believed to be a component of the Manichaean canon. When the spirit returned she asked why he was on a journey he responded that he wished to teach fasting and absentation from wine, flesh and woman. The spirit responded that there were similar men in her lands  perhaps referring to Buddhists in Sogdiana. However, when Mar Ammo read from one of Mani's books she realized he was a bringer of the \"true religion\" and allowed him to pass. The spirit can be identified with the goddess Ardvakhsh who has associations with the river. However fragmentary texts from Turpan tell a slightly different story in which Mani himself encounters the frontier spirit.\n\n\n== Later life and influences ==\nBecause of Mar Ammo, Manichaeism became established in Sogdiana. He was also closely associated with Mani. Mani also spent the last hours of his life with Mar Ammo whom he called \"his dearest son\". Following the death of Mani in 276 CE, at the command of the Sassanid King Bahram I, Sogdiana became home to a large Manichaean Community. This was dually because of the work of Mar Ammo and the eastward migrations of Manichaeans due to their persecution in Persia. Although Manichaeism has been a fairly unified religion, three hundred years after the death of Mar Ammo there was a schism between the Manichaean church in Babylonia and the Sogdian Manichaeans. The Sogdian Manichaeans, known as the Denawars (Middle Persian Dēnawar), viewed Mar Ammo as the founder of their sect and called themselves the \"Pure Ones\". However, another head of the Manichaean community, Shad Ohrmazd, is mentioned as the actual founder of the Denawari School (Dīnāvarīya). The rift between the eastern and western Manichaeans was not caused by any doctrinal matters. The capital of the sect by the 8th century was centered in Kocho, on the northern Silk Road. At the time it was at least active from Samarkand to Chang'an. The schism between the eastern and western churches was worked out and ended by the eighth century. Manichaeism, following its introduction into Sogdiana, would be spread in part by Sogdians eastward into the Tarim Basin and China.\n\n\n== See also ==\nAugustine of Hippo\nBardaisan\nGnosticism\nMarcion\nMar Zaku\n\n\n== Notes ==\n\n\n== Sources ==",
  "fetched_at": "2026-02-09T06:00:03.660038"
}