{
  "url": "https://en.wikipedia.org/wiki/Apocalyptic_literature",
  "title": "Apocalyptic literature",
  "text": "Apocalyptic literature is a genre of prophetical writing that developed in post-Exilic Jewish culture and was popular among millennialist early Christians. Apocalypse (Ancient Greek: ἀποκάλυψις, romanized: apokálupsis) is a Greek word meaning \"revelation\", \"an unveiling or unfolding of things not previously known and which could not be known apart from the unveiling\".\nAs a genre, apocalyptic literature details the authors' visions of the end times/end of the age as revealed by an angel or other heavenly messenger. The apocalyptic literature of Judaism and Christianity embraces a considerable period, from the centuries following the Babylonian exile down to the close of the Middle Ages.\n\n\n== Origins ==\nApocalyptic elements can be detected in the prophetic books of Joel and Zechariah, while Isaiah chapters 24–27 and 33 present well-developed apocalypses. The second half of the Book of Daniel (chs. 7–12) offers a fully matured and classic example of this genre of literature.\n\n\n=== Unfulfilled prophecy ===\nThe non-fulfillment of prophecies served to popularize the methods of apocalyptic in comparison with the non-fulfillment of the advent of the Messianic kingdom. Thus, though Jeremiah had promised that after seventy years Israelites should be restored to their own land, and then enjoy the blessings of the Messianic kingdom under the Messianic king, this period passed by and things remained as of old. Some believe that the Messianic kingdom was not necessarily predicted to occur at the end of the seventy years of the Babylonian exile, but at some unspecified time in the future. The only thing for certain that was predicted was the return of the Jews to their land, which occurred when Cyrus the Persian conquered Babylon in c. 539 BCE. Thus, the fulfillment of the Messianic kingdom remained in the future for the Jews.\nHaggai and Zechariah explained the delay by the failure of Judah to rebuild the temple, and so hope of the kingdom persisted, until in the first half of the 2nd century the delay is explained in the Books of Daniel and Enoch as due not to man's shortcomings but to the counsels of God. Regarding the 70 years of exile predicted in Jeremiah 29:10, the Jews were first exiled in 605 BCE in the reign of king Jehoiakim and were allowed to return to their land in c. 536 BCE when King Cyrus conquered Babylon. This period was approximately 70 years, as prophesied by Jeremiah. Others connect the 70 years of Jeremiah with the 70 weeks of years mentioned by the angel in Daniel 9. Enoch 85 interprets the 70 years of Jeremiah as the 70 successive reigns of the 70 angelic patrons of the nations, which are to come to a close in his own generation. The Book of Enoch, however, was not considered inspired Scripture by the Jews, so that any failed prophecy in it is of no consequence to the Jewish faith.\nThe Greek empire of the East was overthrown by Rome, and prompted a new interpretation of Daniel. The fourth and last empire was declared to be Roman by the Apocalypse of Baruch chapters 36–40 and 4 Ezra 10:60–12:35. Again, these two books were not considered inspired Scripture by the Jews, and thus were not authoritative on matters of prophecy. In addition, earlier in Daniel chapter 7 and also in chapter 2, the fourth world empire is considered to be Rome since Babylon, Medo-Persia (Achaemenid Empire), Greece, and Rome were world empires which all clearly arrived in succession.\nSuch ideas as those of \"the day of Yahweh\" and the \"new heavens and a new earth\" were re-interpreted by the Jewish people with fresh nuances in conformity with their new settings. Thus the inner development of Jewish apocalyptic was conditioned by the historical experiences of the nation.\n\n\n=== Traditions ===\nAnother source of apocalyptic thought was mythological and cosmological traditions, in which the eye of the seer could see the secrets of the future. Thus the six days of the world's creation, followed by a seventh of rest, were regarded as at once a history of",
  "fetched_at": "2026-02-09T05:58:13.604578"
}