{
  "url": "https://en.wikipedia.org/wiki/Unite_the_Right_rally",
  "title": "Unite the Right rally",
  "text": "The Unite the Right rally was a white supremacist rally that took place in Charlottesville, Virginia, from August 11 to 12, 2017. Marchers included members of the alt-right, neo-Confederates, neo-fascists, white nationalists, white supremacists, neo-Nazis, Klansmen, and far-right militias. The organizers' stated goals included the unification of the American white nationalist movement and opposing the proposed removal of the statue of General Robert E. Lee from Charlottesville's former Lee Park.\nThe event had hundreds of participants and sparked a national debate over Confederate iconography, racial violence, and white supremacy. The rally occurred amid the controversy which was generated by the removal of Confederate monuments by local governments following the Charleston church shooting in 2015, in which a white supremacist shot and killed nine at a black church.\nThe rally turned violent after protesters clashed with counter-protesters, resulting in more than 30 injured. In the afternoon of August 12, self-identified white supremacist James Alex Fields Jr. deliberately rammed his car into a crowd of counter-protesters about 1⁄2 mile (800 m) away from the rally site, killing Heather Heyer and injuring 35 people. Fields fled the scene in his car but was arrested soon afterward. In 2018, he was tried and convicted in Virginia state court of first-degree murder, malicious wounding, and other crimes. The following year, Fields pleaded guilty to 29 federal hate crimes in a plea agreement to avoid the death penalty in this trial.\nUS president Donald Trump's remarks about the rally generated negative responses, which were criticized as implying a moral equivalence between the far-right protesters and the counter-protesters. The rally and resulting death and injuries resulted in a backlash against white supremacist groups in the United States. After Charlottesville refused to approve another march, Unite the Right held an anniversary rally on August 11–12, 2018, called \"Unite the Right 2\", in Washington, D.C.\n\n\n== Description ==\nThe Unite the Right rally was a white supremacist rally that took place in Charlottesville, Virginia, from August 11 to 12, 2017. Marchers included members of the alt-right, neo-Confederates, neo-fascists, white nationalists, neo-Nazis, Klansmen, and far-right militias. Some groups chanted racist and antisemitic slogans and carried weapons, Nazi and neo-Nazi symbols, the valknut, Confederate battle flags, Deus vult crosses, flags, and other symbols of various past and present antisemitic and anti-Islamic groups. The organizers' stated goals included the unification of the American white nationalist movement and opposing the proposed removal of the statue of General Robert E. Lee from Charlottesville's former Lee Park. The event had hundreds of participants.\nThe rally turned violent after protesters clashed with counter-protesters, resulting in more than 30 injured. On the morning of August 12, Virginia governor Terry McAuliffe declared a state of emergency, stating that public safety could not be safeguarded without additional powers. Within an hour, at 11:22 a.m., the Virginia State Police declared the rally to be an unlawful assembly.\nAt around 1:45 p.m., self-identified white supremacist James Alex Fields Jr. deliberately rammed his car into a crowd of counter-protesters about 1⁄2 mile (800 m) away from the rally site, killing Heather Heyer and injuring 35 people. Fields fled the scene in his car but was arrested soon afterward. He was tried and convicted in Virginia state court of first-degree murder, malicious wounding, and other crimes in 2018, with the jury recommending a sentence of life imprisonment plus 419 years. The following year, Fields pleaded guilty to 29 federal hate crimes in a plea agreement to avoid the death penalty in this trial.\nThe rally sparked a national debate over Confederate iconography, racial violence, and white supremacy. US president Donald Trump's remarks about the rally gene",
  "fetched_at": "2026-02-09T06:19:10.756887"
}