{
  "url": "https://en.wikipedia.org/wiki/Mandaeans",
  "title": "Mandaeans",
  "text": "Mandaeans (Mandaic: ࡌࡀࡍࡃࡀࡉࡉࡀ) (Arabic: المندائيون al-Mandāʾiyyūn), also known as Mandaean Sabians (الصابئة المندائيون al-Ṣābiʾa al-Mandāʾiyyūn) or simply as Sabians (الصابئة al-Ṣābiʾa), are an ethnoreligious group who are followers of Mandaeism. They believe that John the Baptist was the final and most important prophet.\nThey may have been among the earliest religious groups to practise baptism, as well as among the earliest adherents of Gnosticism, a belief system of which they are the last surviving representatives. The Mandaeans were originally native speakers of Mandaic, an Eastern Aramaic language, before they nearly all switched to Mesopotamian Arabic or Persian as their main language.\nAfter the invasion of Iraq by the United States and its allies in 2003, the Mandaean community of Iraq, which before the war numbered 60,000–70,000 persons, collapsed with most of the community relocating to Iran, Syria and Jordan, or forming diaspora communities beyond the Middle East.\nThe remaining community of Iranian Mandaeans has also been dwindling as a result of religious persecution over the decades. Unlike other religious minorities such as Christians, Jews and Zoroastrians, Mandaeans have no protection from persecution whatsoever, similar to Baháʼís in Iran. By 2007, the population of Mandaeans in Iraq had fallen to approximately 5,000.\nThere are estimated to be 60,000–100,000 Mandaeans worldwide. About 10,000 Mandaeans live in Australia and between 10,000 and 20,000 in Sweden, making them the countries with the most Mandaeans. There are about 2,500 Mandaeans in Jordan, the largest Mandaean community in the Middle East outside of Iraq and Iran.\n\n\n== Etymology ==\nThe name \"Mandaean\" comes from the Mandaic word manda, meaning \"to have knowledge\".\nIn Muslim countries, Mandaeans are sometimes also called Sabians (Arabic: الصابئة al-Ṣābiʾa), a Quranic epithet historically claimed by several religious groups (see also below). The etymology of the Arabic word Ṣābiʾ is disputed. According to one interpretation, it is the active participle of the Arabic root ṣ-b-ʾ ('to turn to'), meaning 'converts'. Another widely cited hypothesis is that it is derived from an Aramaic root meaning 'to baptize'.\n\n\n== History ==\n\n\n=== Origin ===\nAccording to a theory first proposed by Ignatius of Jesus in the 17th century, the Mandaeans originated in Judea and later migrated east to the Mesopotamian Marshes. This theory was gradually abandoned, but was revived in the early 20th century through the first translation of Mandaean texts, which Biblical scholars like Rudolf Bultmann believed capable of shedding new light on the development of early Christianity. However, most New Testament scholars rejected the Judean origin thesis, which by World War II was again largely deserted by scholars. It was revived in the 1960s by Rudolf Macúch; it is now accepted by Mandaean scholars such as Jorunn Jacobsen Buckley and Şinasi Gündüz. According to Macúch, the eastward migration from the Roman province of Judea to southern Iraq took place in the first century CE, while other scholars such as Kurt Rudolph think it probably took place in the third century.\nThere are also other theories. Kevin van Bladel has argued that the Mandaeans originated in Sasanian-ruled Mesopotamia in the fifth century. According to Carlos Gelbert, Mandaeans formed a vibrant community in Edessa in late antiquity. Brikha Nasoraia, a Mandaean priest and scholar, accepts a two-origin theory in which he considers the contemporary Mandaeans to have descended from both a line of Mandaeans who had originated from the Jordan Valley, as well as another group of Mandaeans (or Gnostics) who were indigenous to southern Mesopotamia. Thus, the historical merging of the two groups gave rise to the Mandaeans of today.\nThere are several indications of the ultimate origin of the Mandaeans. Early religious concepts and terminologies recur in the Dead Sea Scrolls, and Yardena (Jordan) has been the name of every bapti",
  "fetched_at": "2026-02-09T05:56:41.554214"
}