{
  "url": "https://en.wikipedia.org/wiki/Manichaeism",
  "title": "Manichaeism",
  "text": "Manichaeism (; in Persian: آئین مانی, romanized: Āʾīn-i Mānī; Chinese: 摩尼教; pinyin: Móníjiào) was a major world religion founded in the third century CE by the Parthian Iranian prophet Mani (216–274) in the Sasanian Empire. It taught an elaborate dualistic cosmology describing the struggle between a good spiritual world of light, and an evil material world of darkness. Through an ongoing process in human history, light is gradually removed from the world of matter and returned to the world of the divine. \nMani's teachings were intended to integrate, succeed, and surpass the \"partial truths\" of various prior faiths and belief systems, including Platonism, Christianity, Zoroastrianism, Buddhism, Marcionism, Hellenistic and Rabbinic Judaism, Gnosticism, Ancient Greek religion, Babylonian religion, other ancient Mesopotamian religions, and the Greco-Roman mysteries. Some forms of Manichaeism viewed Mani as the final prophet after Zoroaster, the Buddha, and Jesus. The canon of Manichaean scripture included seven works attributed to Mani, written originally in the Syriac language. Manichaean sacramental rites included prayers, almsgiving, and fasting. Communal life centered on confession and the singing of hymns.\nWith its message of universal salvation and emphasis on active proselytism, Manichaeism was quickly successful and spread throughout Aramaic-speaking regions, the Mediterranean, and the Middle East. It thrived between the third and seventh centuries CE, and at its height was one of the most widespread religions in the world. Manichaean churches and scriptures existed as far east as China and as far west as Roman Iberia. Before the spread of Islam, Manichaeanism was briefly the main rival to early Christianity. It was increasingly persecuted both by the Roman state and the nascent Christian church, largely disappearing from Roman lands by the end of the sixth century.\nManichaeism survived and expanded in the East. It maintained its historic presence in West Asia until being repressed by the latter Abbasid Caliphate rulers in the 10th century. Trade and missionary activity brought Manichaeism to Tang China in the seventh century, where it developed into its own local form. Manichaeism was the official religion of the Uyghur Khaganate until its collapse in 830; shortly thereafter, it was banned by the Tang court but experienced a resurgence under the later Mongol Yuan dynasty during the 13th and 14th centuries. Continued persecution by Chinese emperors led to Manichaeism becoming subsumed into Buddhism and Taoism before the end of the 14th century. \nSome historic Manichaean sites still exist in China, including the temple of Cao'an in Jinjiang, Fujian, and the religion may have influenced later movements in the European Middle Ages, including Paulicianism, Bogomilism, and Catharism. While most original Manichean writings have been lost, numerous translations and fragmentary texts have survived.\n\n\n== Terminology ==\nThe spelling Manichaeism is a hypercorrection of Manichaism, which derives from Koine Greek Μανιχαϊσμός(Manikhaïsmós) via Latin Manichaismus. The Greek word is built on Μανιχαῖος (Manikhaîos; 'Manichaeus'), one of the names of Mani in Greek sources.\nIn English, an adherent of Manichaeism is called a Manichaean, Manichean, or Manichee.\n\n\n== History ==\n\n\n=== Life of Mani ===\n\nMani was an Iranian born in 216 CE in or near Ctesiphon (now al-Mada'in, Iraq) in the Parthian Empire. According to the Cologne Mani-Codex, Mani's parents were members of the Jewish Christian Gnostic sect known as the Elcesaites.\nMani composed seven works, six of which were written in the late-Aramaic Syriac language. The seventh, the Shabuhragan, was written by Mani in Middle Persian and presented to the Sasanian emperor Shapur I by Mani himself. Although there is no evidence that Shapur I was a follower of Mani, he tolerated the spread of Manichaeism and refrained from persecuting it within his empire's boundaries.\nAccording to Michel Tardieu, M",
  "fetched_at": "2026-02-09T02:45:19.602915"
}