{
  "url": "https://en.wikipedia.org/wiki/Metatron",
  "title": "Metatron",
  "text": "Metatron (Mishnaic Hebrew: מֶטָטְרוֹן‎ Meṭāṭrōn), or Matatron (מַטַּטְרוֹן‎, Maṭṭaṭrōn), is an angel in Judaism and Gnosticism. Metatron is mentioned three times in the Talmud, in a few brief passages in the Aggadah, the Targum, and in mystical Kabbalistic texts within Rabbinic literature. The figure forms one of the traces for the presence of dualist proclivities in Gnosticism and the otherwise monotheistic vision of the Tanakh. In Rabbinic literature, he is sometimes portrayed as serving as the celestial scribe. The name Metatron is not mentioned in the Torah or the Bible, and how the name originated is a matter of debate. In Islamic tradition, he is also known as Mīṭaṭrūn (Arabic: ميططرون), the angel of the veil. \nIn Jewish apocrypha, early Kabbalah, and rabbinic literature, Metatron is the name that Enoch received after his transformation into an angel.\n\n\n== Etymology ==\nNumerous etymologies have been proposed to account for the name Metatron, but there is no consensus, and its precise origin is unknown. Some scholars, such as Philip Alexander, believe that if the name Metatron originated in Hekhalot literature and Merkabah texts such as 3 Enoch, then it may have been a magical word like Adiriron and Dapdapiron.\nHugo Odeberg, Adolf Jellinek, and Marcus Jastrow suggest the name may have originated from either mattara (מטרא, lit. 'keeper of the watch') or the verb memater (ממטר, 'to guard' or 'to protect'). An early derivation of this can be seen in Shimmusha Rabbah, where Enoch is clothed in light and is the guardian of the souls ascending to heaven. Odeberg also suggested that the name Metatron might have been adopted from the Old Persian name Mithra. Citing Wiesner, he drew up several parallels that appeared to link Mithra and Metatron based on their positions in heaven and duties.\nAnother hypothesis would derive Metatron from a combination of two Greek words, μετά (meta, meaning 'after') and θρóνος (thronos, meaning 'throne'), which, taken together, would suggest the idea of 'one who serves behind the throne' or 'one who occupies the throne next to the throne of glory'. The primary arguments against this etymology are that Metatron's function as a servant of the celestial throne emerges only later in the traditions regarding him, and θρóνος itself is not attested as a word in Talmudic literature.\nA connection with the word σύνθρονος (synthronos) used as 'co-occupant of the divine throne', has been advanced by some scholars; This, like the above etymology, is not found in any source materials. It is supported by Saul Lieberman and Peter Schäfer, who give further reasons why this might be a viable etymology. The Latin word metator ('messenger, guide, leader, measurer') had been suggested by Eleazar of Worms (c. 1165 – c. 1230), Nachmanides, and brought to light again by Hugo Odeberg. When transliterated into the Hebrew language, it is given as מטיטור (mṭyṭwr) or מיטטור (myṭṭwr). Gershom Scholem argues that there is no data to justify the conversion of metator to Metatron. Philip Alexander also suggests this as a possible origin of Metatron, stating that the word metator also occurs in Greek as mitator – a word for an officer in the Roman army who acted as a forerunner. Using this etymology, Alexander suggests the name may have come about as a description of 'the angel of the Lord who led the Israelites through the wilderness: acting like a Roman army metator guiding the Israelites on their way'.\nOther ideas include μέτρον (metron, 'a measure'). Charles Mopsik believes that the name Metatron may be related to the sentence from Genesis 5:24, \"Enoch walked with God, then he was no more, because God took him\". The LXX version of the Hebrew word לָקַ֥ח (\"took\") is μετέθηκεν.\nIn the entry entitled \"Paradigmata\" in his study \"'The Written' as the Vocation of Conceiving Jewishly\", John W. McGinley gives an accounting of how this name functions in the Bavli's version of \"four entered pardes\".\n\n\n== Origins ==\nIn the Hellenistic peri",
  "fetched_at": "2026-02-09T02:44:54.994226"
}