{
  "url": "https://en.wikipedia.org/wiki/Amharic",
  "title": "Amharic",
  "text": "Amharic is an Ethio-Semitic language, which is a subgrouping within the Semitic branch of the Afroasiatic languages. It is spoken as a first language by the Amhara people, and also serves as a lingua franca for all other metropolitan populations in Ethiopia.\nThe language serves as the official working language of the Ethiopian federal government, and is also the official or working language of several of Ethiopia's federal regions. In 2020 in Ethiopia, it had over 33.7 million mother-tongue speakers of which 31 million are ethnically Amhara, and more than 25.1 million second language speakers in 2019, making the total number of speakers over 58.8 million. Amharic is the largest, most widely spoken language in Ethiopia, and the most spoken mother-tongue in Ethiopia. Amharic is also the second most widely spoken Semitic language in the world (after Arabic).\nAmharic is written left-to-right using a system that grew out of the Geʽez script. The segmental writing system in which consonant-vowel sequences are written as units is called an abugida (አቡጊዳ). The graphemes are called fidäl (ፊደል), which means 'script, alphabet, letter, character'.\nThere is no universally agreed-upon Romanization of Amharic into Latin script. The Amharic examples in the sections below use one system that is common among linguists specializing in Ethiopian Semitic languages.\n\n\n== Dialects ==\nNot much has been published about Amharic dialect differences. All dialects are mutually intelligible, but certain minor variations are noted.\n\n\n=== Jewish Amharic ===\nThe Beta Israel who today live mostly in Israel speak a dialect of Amharic called Jewish Amharic (Hebrew: אמהרית מעוברת) or Judeo-Amharic. It replaced many Christian phrases with Jewish ones. One example is the replacing the phrase \"It is good that Mary had pardoned you\" with \"It is good that God has relieved you peacefully\"; these phrases are used to congratulate a mother on successful childbirth. Another example is calling a type of grasshopper \"Moses's horses\" instead of \"Mary's horses\". This variety also contains influence from Modern Hebrew due to the large Beta Israel presence in Israel. Currently Jewish Amharic is declining as the Beta Israel gradually abandon Amharic in favor of Hebrew.\n\n\n== History ==\nAmharic has been the official working language of Ethiopia, language of the courts, the language of trade and everyday communications and of the military since the late 12th century. The Amhara nobles supported the Zagwe prince Lalibela in his power struggle against his brothers which led him to make Amharic Lisane Negus (tongue of the king) as well as fill the Amhara nobles in the top positions of his kingdom. The appellation of 'language of the king' (Ge'ez: ልሳነ ነጋሢ, Lǝssanä nägaśi; Amharic: የነጋሢ ቋንቋ, Yä-nägaśi qʷanqʷa) and its use in the royal court are otherwise traced to the Amhara Emperor Yekuno Amlak. It is one of the official languages of Ethiopia, together with other regions like Oromo, Somali, Afar, and Tigrinya. Amharic is an Afro-Asiatic language of the Southwest Semitic group and is related to Geʽez, or Ethiopic, the liturgical language of the Ethiopian Orthodox church; Amharic is written in a slightly modified form of the alphabet used for writing the Geʽez language. There are 34 basic characters, each of which has seven forms depending on which vowel is to be pronounced in the syllable. There are also 49 \"wa\" letters, which form compound sounds involving \"w.\" All together, the alphabet has some 280 letters. Until 2020 Amharic was the sole official language of Ethiopia. The 2007 census reported that Amharic was spoken by 21.6 million native speakers in Ethiopia. More recent sources state the number of first-language speakers in 2018 as nearly 32 million, with another 25 million second-language speakers in Ethiopia. Additionally, 3 million emigrants outside of Ethiopia speak the language. Most of the Ethiopian Jewish communities in Ethiopia and Israel speak Amharic. Furthermore, Amharic",
  "fetched_at": "2026-02-09T06:13:36.545662"
}