{
  "url": "https://en.wikipedia.org/wiki/Leonardo_Torres_Quevedo",
  "title": "Leonardo Torres Quevedo",
  "text": "Leonardo Torres Quevedo (Spanish: [leoˈnaɾðo ˈtores keˈβeðo]; 28 December 1852 – 18 December 1936) was a Spanish civil engineer, mathematician and inventor, known for his numerous engineering innovations, including aerial trams, airships, catamarans, and remote control. He was also a pioneer in the field of computing and robotics. Torres was a member of several scientific and cultural institutions and held such important positions as the seat N of the Real Academia Española (1920–1936) and the presidency of the Spanish Royal Academy of Sciences (1928–1934). In 1927 he became a foreign associate of the French Academy of Sciences.\nHis first groundbreaking invention was a cable car system patented in 1887 for the safe transportation of people, an activity that culminated in 1916 when the Whirlpool Aero Car was opened in Niagara Falls. In the 1890s, Torres focused his efforts on analog computation. He published Sur les machines algébriques (1895) and Machines à calculer (1901), technical studies that gave him recognition in France for his construction of machines to solve real and complex roots of polynomials. He made significant aeronautical contributions at the beginning of the 20th century, becoming the inventor of the non-rigid Astra-Torres airships, a trilobed structure that helped the British and French armies counter Germany's submarine warfare during World War I. These tasks in dirigible engineering led him to be a key figure in the development of radio control systems in 1901–05 with the Telekine, which he laid down modern wireless remote-control operation principles.\nFrom his Laboratory of Automation created in 1907, Torres invented one of his greatest technological achievements, El Ajedrecista (The Chess Player) of 1912, an electromagnetic device capable of playing a limited form of chess that demonstrated the capability of machines to be programmed to follow specified rules (heuristics) and marked the beginnings of research into the development of artificial intelligence. He advanced beyond the work of Charles Babbage in his 1914 paper Essays on Automatics, where he speculated about thinking machines and included the design of a special-purpose electromechanical calculator, introducing concepts still relevant like floating-point arithmetic. British historian Brian Randell called it \"a fascinating work which well repays reading even today\". Subsequently, Torres demonstrated the feasibility of an electromechanical analytical engine by successfully producing a typewriter-controlled calculating machine in 1920.\nHe conceived other original designs before his retirement in 1930, some of the most notable were in naval architecture projects, such as the Buque campamento (Camp-Vessel, 1913), a balloon carrier for transporting airships attached to a mooring mast of his creation, and the Binave (Twin Ship, 1916), a multihull steel vessel driven by two propellers powered by marine engines. In addition to his interests in engineering, Torres also stood out in the field of letters and was a prominent speaker and supporter of Esperanto.\n\n\n== Early life and education ==\nTorres was born on 28 December 1852, on the Feast of the Holy Innocents, in Santa Cruz de Iguña, Cantabria, Spain. His father, Luis Torres Vildósola y Urquijo (1818–1891), was a civil engineer in Bilbao, where he worked as a railway engineer. His mother was Valentina Quevedo de la Maza (1825–1891). He had two siblings, Joaquina (b. 1851) and Luis (b. 1855). The family resided for the most part in Bilbao, although they also spent long periods in his mother's family home in Cantabria's mountain region. As a child, he spent considerable time apart from his parents due to their work travels. He was therefore cared for by the Barrenechea sisters, relatives on his father’s side, who named him their heir, enabling his future independence.\nHe studied high school in Bilbao and later went to Paris, to the college of the Christian Brothers, to complete studies for two years (1868",
  "fetched_at": "2026-02-09T02:50:58.742934"
}