{
  "url": "https://en.wikipedia.org/wiki/The_Gods_from_Outer_Space",
  "title": "The Gods from Outer Space",
  "text": "The Gods from Outer Space (German: Die Götter aus dem All, Polish: Bogowie z kosmosu; also Według Ericha von Dänikena) is a science fiction comic book series, published in the years 1978–1982 by German publishing house Bastei Verlag, written and drawn by Polish artists. The authors of the script Arnold Mostowicz and Alfred Górny, and the drawings were made by Bogusław Polch. The story was based on the views of Erich von Däniken, a proponent of the fringe theory that in ancient times the Earth was visited by ancient astronauts – representatives of an extraterrestrial civilization.\nThe series was translated into at least twelve languages, and sold several million copies. It has been widely popular in Poland, where it is considered a cult classic. A collected volume, published in Poland in 2015, has received generally positive reviews; in particular, nearly all reviewers highly praised the quality of Polch's art. It has been called \"One of Polch’s most recognized series\" as well as \"one of the most famous and successful Polish comic book series\".\n\n\n== Development ==\nIn the late 1970s Polish writer and publisher, Alfred Górny, became interested in the ideas of Erich von Däniken and started publishing his books in Poland. Shortly afterward he started a collaboration with the German publisher Econ Verlag (and later Bastei Verlag) on a comic book series, offering Polish writers and illustrators for the joint venture. Górny collaborated on the scripts with another Polish writer and a fellow enthusiast of Däniken's theories, Arnold Mostowicz, and for the illustrator they chose Bogusław Polch. The series was published in eight books in Germany, from 1978 to 1982. It was also published in Poland, from 1982 to 1990, by Krajowa Agencja Wydawnicza; however in 1990, after publishing volume 7, KAW went through reorganization and ceased publication of the series. The final volume 8 would not be published in Poland until the early 2000s. While most attribute the delay of the publication of the last volume in Poland to accidental, unfortunate timing, it has also been suggested that the controversial theme of the last volumes, dealing with Biblical history, might have been an additional factor in the delay, as the publishers might have wanted to avoid antagonising the Catholic Church, which had become resurgent in Polish politics.\nIn the UK the first four books were published by Methuen/Magnet Publishing as The Gods from Outer Space series, around the same time as the German edition. Six volumes were published in Spain under the title Los Dioses del universo (1979–1981). In France the series was called Ceux venus de l'espace, but only a single book was published in 1979; the same for Sweden (1978) and the Czech Republic (1990).\nIn total, the series was published in at least twelve languages. As of the early 2000s the Polish editions had sold over 1.5 million copies of the books from the series, and as of 2015, five million copies sold worldwide were reported.\n\n\n== Plot ==\nIn prehistoric times, an expedition from the distant planet (called Des in the Polish edition; Delos in German) comes to Earth on behalf of the Great Brain, an immortal entity and a genius, the highest authority on Des (Delos). Its commander is a woman named Ais, who aims to find beings for an uplift process. The first attempts turn out to be unsuccessful, as the alien base in the Andes is destroyed by a volcanic eruption. However, thanks to the help of members of the next two expeditions, Enes and Rama, the work on the Big Island, a.k.a. Atlantis, is continued. Ais and her crew face many other challenges, most notably internal problems, caused first by the rebellion of one of the deputies, and then by open warfare led by the non-Delosiani Dr. Satham, a scrupulous scientist and his henchmen.\nWhile the uplift experiment seems to progress, eventually the Great Brain, the highest authority on Des (Delos), decides to stop and destroy the work of Ais and her colleagues. However, Ais ",
  "fetched_at": "2026-02-09T05:54:22.109983"
}