{
  "url": "https://en.wikipedia.org/wiki/Psalm_2",
  "title": "Psalm 2",
  "text": "Psalm 2 is the second psalm of the Book of Psalms, beginning in English in the King James Version: \"Why do the heathen rage\". In Latin, it is known as \"Quare fremuerunt gentes\". The Book of Psalms is part of the Ketuvim (Writings)—the third section of the Hebrew Bible—and a book of the Christian Old Testament. Psalm 2 does not specify its author with a superscription, but in Acts 4:24–26 of the Christian New Testament, it is attributed to King David. Rabbi Samuel ben Nahman, referencing Rabbi Yochanan, is recorded in tractate Berakhot 10a:1 of the Talmud—the Rabbinic commentary on the Mishnah in Rabbinic Judaism—as teaching that Psalm 2 is a continuation of Psalm 1.\nThe psalm is a regular part of Jewish, Catholic, Lutheran, and Anglican liturgies, as well as the general Protestant psalmody. It has often been set to music; George Frideric Handel, for example, set nine of its verses in Part II of his Messiah.\n\n\n== Background and themes ==\n\n\n=== Judaism ===\nAccording to the Talmud, in tractate Berakhot 9b:28 and 10a:1, Psalm 2 is a continuation of Psalm 1. Tenth-century CE rabbi Saadia Gaon, in his commentary on the Psalms, concurs with the Talmud that Psalm 1 begins with the word \"happy\" (אַשְׁרֵי, ashrei) and the last verse of Psalm 2 ends with the word \"happy\", joining them thematically.\nFurthermore, Chazal, in tractate Sukkah 52a:6 and tractate Avodah Zarah 3b:5, and later commentators, including Saadia Gaon, Abraham ibn Ezra, and the Karaite Yefet ben Ali, argue that Psalm 1 is messianic in theme, referring to the advent of the Jewish Messiah preceded by the wars of Gog and Magog. In this vein, the \"king\" of Psalm 2 is interpreted not as David but as the future King Messiah from the Davidic line (Messiah ben David), who will restore Israel to its former glory and bring world peace. Similarly, the Midrash Tehillim teaches:\n\nThree persons were bidden, \"Ask\"—Solomon, Ahaz, and the King Messiah. Solomon: \"Ask what I shall give thee\" (I Kings 3:5). Ahaz: \"Ask thee a sign\" (Isaiah 7:11). The King Messiah: \"Ask of Me\" (Psalms 2:8). Rashi and Rabbi David Kimhi (also known as Radak), however, identify the subject of this psalm as David, following his victory over the Philistines. Mariano Gomez Aranda, in a 2018 article in the Journal of Hebrew Scriptures, suggests that Rashi's view was influenced by that of early Christian commentators, who interpreted verse 7 as referring to Jesus.\n\n\n=== Christianity ===\nSome Christian writers, such as Hermann Gunkel, and Hans-Joachim Kraus interpret the psalm as a \"song of the Judean king himself at the festival of his accession,\" while Hossfeld sees the psalm as merely being influenced by Ancient Egyptian and Hellenistic royal ideology. Furthermore, Christian scholars tend to interpret the subject of the psalm as Jesus and his role as the Messiah. Matthew Henry interprets verses 1–6 are viewed as threats against Jesus's kingdom, verses 7–9 as a promise to Jesus to be the head of this kingdom, and verses 10–12 as counsel to all to serve Jesus. Charles Spurgeon and Adam Clarke similarly interpret the psalm as referring to the opposition against Jesus's rulership, the selection of Jesus by God as his \"own son\", and the eventual victory and reign of Jesus over his enemies.\n\n\n== Text ==\nThe following table shows the Hebrew text of the Psalm with vowels, alongside the Koine Greek text in the Septuagint, the Latin text in the Vulgate and the English translation from the King James Version. Note that the meaning can slightly differ between these versions, as the Septuagint and the Masoretic Text come from different textual traditions.\n\n\n== Uses ==\n\n\n=== Judaism ===\nVerse 1 is recited during Selichot.\nThis psalm is also recited to alleviate a headache, and when caught in a sea gale.\n\n\n=== New Testament ===\nSome verses of Psalm 2 are referenced in the New Testament:\n\nVerses 1-2: in a speech attributed to Peter and John in Acts 4:25–26.\nVerse 7: in Acts 13:33; Hebrews 1:5; Hebrews 5:5.\nVerses 8-9: in Revelat",
  "fetched_at": "2026-02-09T06:03:29.982112"
}