{
  "url": "https://en.wikipedia.org/wiki/Jon_Snow_(character)",
  "title": "Jon Snow (character)",
  "text": "Jon Snow is a fictional main character in the A Song of Ice and Fire series of epic fantasy novels by American author George R. R. Martin, and its HBO television adaptation Game of Thrones, in which he is portrayed by Kit Harington. In the novels, he is a prominent point of view character. He is the protagonist and one of the most popular characters in the series. The New York Times cites him as one of the author's finest creations. Jon is a main character in the TV series, and his storyline in the season 5 finale generated a strong reaction among viewers. Speculation about the character's parentage has also been a popular topic of discussion among fans of both the books and the TV series.\nJon is introduced in 1996's A Game of Thrones as the illegitimate son of Ned Stark, Lord of Winterfell in the North of Westeros. Knowing his prospects are limited by his status as a bastard, Jon joins the Night's Watch, who guard the far northern borders from the wildlings living beyond The Wall. In A Clash of Kings (1998), Jon joins a scouting party investigating the growing threat from the otherworldly \"Others\" beyond the Wall, and infiltrates the wildlings. Jon learns of their plans to invade Westeros in A Storm of Swords (2000), and falls in love with the wildling woman Ygritte. Jon betrays the wildlings and Ygritte, returns to defend the Night's Watch against the wildlings' invasion, and is elected Lord Commander of the Watch. He appears briefly in A Feast for Crows (2005) and returns as a prominent character in A Dance with Dragons (2011), in which he works to negotiate an alliance between the Night's Watch and the wildlings against the Others; his policies are met with hostility by some among the Watch, and he is left for dead in a mutiny at the novel's end following a desired attempt to break his vows to fight House Bolton.\nIn the Game of Thrones television series, Jon's storyline initially follows the character's plot arc from the novel series. Seasons six through eight continue on from the events of Martin's latest published installment, detailing Jon's resurrection, and revealing him to have been born Aegon Targaryen, the legitimate son of Rhaegar Targaryen and Lyanna Stark, therefore possessing a stronger claim to the Iron Throne than Daenerys Targaryen. For the role, Harington was nominated for a Golden Globe Award for Best Actor – Television Series Drama in 2019, two Emmy Awards for Outstanding Supporting Actor in a Drama Series and Outstanding Lead Actor in a Drama Series in 2016 and 2019, and two Critics' Choice Television Awards.\n\n\n== Character ==\n\n\n=== Description ===\nIn A Game of Thrones, Jon Snow is introduced as the 14-year-old illegitimate son of Eddard \"Ned\" Stark, Lord of Winterfell, and half-brother to Robb, Sansa, Arya, Bran and Rickon. Jon is described as having strong Stark features with a lean build, long face, dark brown hair, and dark grey eyes. Jon has the surname \"Snow\" (customarily used for illegitimate noble children in the North) and is resented by Ned's wife Catelyn, who views him as a constant reminder of Ned's infidelity. Jon is the same age as Robb and enjoys a warm relationship with his siblings, particularly the tomboy Arya (who resembles Jon and like him, does not feel like she fits in). Ned treats Jon as much like his other children as propriety and his honor will allow. Still, as somewhat of an outsider, Jon has learned to be independent and to fend for himself when necessary. Jon idolizes his father, but is wounded by Ned's refusal to tell him about his mother. At the beginning of the story, Jon adopts the albino direwolf that he names Ghost. He later finds that at times, he can \"inhabit\" the wolf and share its experiences.\nDavid Orr of The New York Times describes Jon as \"a complex, thoughtful and basically good character\". David Benioff and D. B. Weiss, the creators and executive producers of the television adaptation of the series, explain that Jon is one of several characters in the series wh",
  "fetched_at": "2026-02-09T05:21:02.305272"
}