{
  "url": "https://en.wikipedia.org/wiki/The_War_of_the_Messiah",
  "title": "The War of the Messiah",
  "text": "The War of the Messiah is a series of Dead Sea Scroll fragments describing the conclusion of a battle led by the Leader of the Congregation. The fragments that make up this document include 4Q285, also known as The Pierced Messiah Text, and 11Q14 with which it was found to coincide. It is possible that it also represents the conclusion of the War Scroll, as the two read coherently and discuss related thematic issues.\n\n\n== Pierced Messiah text (4Q285) ==\nThis six-line fragment, commonly referred to as the \"Pierced Messiah\" text, is written in a Herodian script of the first half of the 1st Century and refers to the \"stump of Jesse\"—the Messiah—from the Branch of David, to a judgement, killing, and cleansing of the land of the dead by the Messiah's soldiers.\n\n\n== Translation from Hebrew ==\nHebrew is primarily made up of consonants; vowels must be supplied by the reader. The appropriate vowels depend on the context. Thus, the text (line 4) may be translated as \"and the Prince of the Congregation, the Branch of David, will kill him,\" or alternately read as \"and they killed the Prince.\" Because of the second reading, the text was dubbed the \"Pierced Messiah\".\n\n\n== Readings ==\nIn September 1992, Time magazine published an article on the War Rule fragment displayed here (object no. 12) exploring the differing interpretations.  A \"piercing messiah\" reading would support the traditional Jewish view of a triumphant messiah. If, on the other hand, the fragment were interpreted as speaking of a \"pierced messiah,\" it would anticipate the New Testament view of the preordained death of the messiah. The scholarly basis for these differing interpretations—but not their theological ramifications—are reviewed in \"A Pierced or Piercing Messiah?\"\n\n\n=== Piercing Messiah reading ===\n(Serekh ha-Milhamah) 4Q285 (SM) Courtesy of the Israel Antiquities Authority (12)\n\n[...]Isaiah the prophet: [The thickets of the forest] will be cut [\ndown with an axe and Lebanon by a majestic one will f]all. And there shall come forth a shoot from the stump of Jesse [\n] the Branch of David and they will enter into judgement with [\n] and the Prince of the Congregation, the Bran[ch of David] will kill him [\nby stroke]s and by wounds. And a Priest [of renown (?)] will command [\nthe s]lai[n] of the Kitti[m]\nTranscription and translation by G. Vermes\n\n\n=== Pierced Messiah reading ===\n\"[...]Isaiah the prophet: [The thickets of the forest] will be fell [ed\nwith an axe and Lebanon shall f]all by a mighty one]. A staff shall rise from the root of Jesse, [and a planting from his roots will bear fruit ...\n] the Branch of David. They will enter into judgment with [...\n] and they will put to death the Prince of the Congregation, the Bran[ch of David ...\n]  and with woundings, and the (high) priest will command [ ...\nthe s]lai[n] of the Kitti[m]\"\nTranscription and translation by Eisenman and Wise\n\n\n== Terminology ==\n11Q14 describes a Leader of the Congregation, that is, a messianic figure known from other Dead Sea Scrolls. References to Kittim refer to an opposing force, and scholars agree that it most likely refers to the Romans. The stump of Jesse and Branch of David in Frag. 1 Col. 1 refer to the coming of a Messiah from the line of King David.\n\n\n== References ==\n\n\n== Bibliography ==\nVermes, G. \"The Oxford Forum for Qumran Research: Seminar on the Rule of the War from Cave 4 (4Q285),\" Journal of Jewish Studies 43 (Spring 1992):85-90.\nWise, Michael O.; Abegg, Martin G.; Cook, Edward M. (25 October 2005). The Dead Sea Scrolls - Revised Edition. San Francisco: Harper Collins. ISBN 0-06-076662-X.",
  "fetched_at": "2026-02-09T06:00:19.377532"
}