{
  "url": "https://en.wikipedia.org/wiki/2014_Isla_Vista_killings",
  "title": "2014 Isla Vista killings",
  "text": "Two misogynistic terrorist attacks occurred in Isla Vista, California, United States on the evening of May 23, 2014. 22-year-old Elliot Rodger murdered six people and injured fourteen others by gunshot, stabbing, and vehicle-ramming near the campus of the University of California, Santa Barbara (UCSB) before fatally shooting himself.\nIn Rodger's apartment, he ambushed and stabbed to death his two roommates and their friend, killing them separately as they arrived. About two hours later, he drove to a sorority house and, after failing to gain entry, he shot three women walking near the sorority house, two of whom died. He then drove past a nearby delicatessen, and shot and killed a man who was inside. Following this, he drove around Isla Vista, shooting and wounding several pedestrians from his car, and striking others with his car. He exchanged gunfire with police twice and was injured in the hip. After Rodger's car crashed into a parked vehicle, he was found dead inside with a self-inflicted gunshot wound to the head.\nBefore driving to the sorority house, Rodger uploaded a video titled \"Elliot Rodger's Retribution\", in which he outlined his planned attack and his motives, to the video-sharing platform YouTube. In the video, Rodger said he wanted to \"punish\" women for rejecting him, and sexually active men because he envied them. He also emailed a lengthy, autobiographical manuscript to friends, family members, and his therapist; the document appeared on the Internet and became widely known as his manifesto. In the document, Rodger described his childhood, family conflicts, frustration over his inability to find a girlfriend, his hatred of women, his contempt for couples, and his plans for \"retribution\".\n\n\n== Background ==\n\nElliot Oliver Robertson Rodger was born on July 24, 1991, in London, England. Rodger faced mental health problems as a child; he struggled in social situations, often cried in crowds, and displayed repetitive behaviors. He repeatedly talked about killing himself but had no history of violence. In 2007, he was diagnosed with pervasive developmental disorder not otherwise specified. As an adult, he showed anger toward couples and had difficulties socializing.\nRodger wrote a 137-page manifesto titled My Twisted World: The Story of Elliot Rodger about his life and frustrations at having never had sexual intercourse, a situation for which he blamed women. In his manifesto, Rodger wrote about his plan to carry out an attack, calling it a \"Day of Retribution\". Initially, Rodger was unsure whether to target Santa Barbara City College or Isla Vista for his attacks, but ultimately chose Isla Vista. He had planned to drive to his father's home where he intended to kill his stepmother Soumaya Akaaboune and half-brother. He intended to steal their car and drive it back to Isla Vista, targeting the Alpha Phi sorority house with plans to kill its occupants before setting it on fire. Rodger then planned to shoot and run over as many people with the car as possible in Isla Vista.\n\nRodger posted videos to YouTube describing his views on life and frustrations at his romantic failures. In April 2014, he uploaded to YouTube videos expressing his deep loneliness and frustration at his unsuccessful attempts at attracting a girlfriend. He also posted on misogynistic and anti-feminism online forums like PUAHate. Denizens of these forums, including Rodger, identified themselves as \"involuntary celibates\" or \"incels\"; they discussed their difficulties with finding a romantic or sexual partner, and expressed disdain towards women and pick-up artists.\nIn February 2012, after being unable to find a girlfriend, Rodger wrote in his manifesto that his attack had become a possibility. He became fixated on winning a lottery, believing gaining wealth was the only way for him to attain a sexual experience. By June 2012, Rodger wrote he would not carry out his attacks if he won the Mega Millions jackpot. When he did not win the jackpot in Septe",
  "fetched_at": "2026-02-09T06:15:58.357704"
}