{
  "url": "https://en.wikipedia.org/wiki/Emmerson_Mnangagwa",
  "title": "Emmerson Mnangagwa",
  "text": "Emmerson Dambudzo Mnangagwa (US:   mə-nəng-GAH-gwə, Shona: [m̩naˈᵑɡaɡwa]; born 15 September 1942) is a Zimbabwean politician who has served as the president of Zimbabwe since 2017. A member of ZANU–PF and a longtime ally of former president Robert Mugabe, he held a series of cabinet portfolios and he was Mugabe's first-vice president from 2014 until 2017, when he was dismissed before coming to power in a coup d'état. He secured his first full term as president in the disputed 2018 general election.  Mnangagwa was re-elected in the 2023 Zimbabwean general election with 52.6% of the vote.\nMnangagwa was born in 1942 in Shabani, Southern Rhodesia, to a large Shona family. His parents were farmers, and in the 1950s he and his family were forced to move to Northern Rhodesia because of his father's political activism. There he became active in anti-colonial politics, and in 1963 he joined the newly formed Zimbabwe African National Liberation Army, the militant wing of the Zimbabwe African National Union (ZANU). He returned to Rhodesia in 1964 as leader of the \"Crocodile Gang\", a group that attacked white-owned farms in the Eastern Highlands. In 1965, he bombed a train near Fort Victoria (now Masvingo) and was imprisoned for ten years, after which he was released and deported to the recently independent Zambia. He later studied law at the University of Zambia and practiced as an attorney for two years before going to Mozambique to rejoin ZANU. In Mozambique, he was assigned to be Robert Mugabe's assistant and bodyguard and accompanied him to the Lancaster House Agreement which resulted in Zimbabwe's recognised independence in 1980.\nAfter independence, Mnangagwa held a series of senior cabinet positions under Mugabe. From 1980 to 1988, he was the country's first minister of state security, and oversaw the Central Intelligence Organisation. His role in the Gukurahundi massacres, in which thousands of Ndebele civilians were killed during his tenure, is controversial. Mnangagwa was Minister of Justice, Legal and Parliamentary Affairs from 1989 to 2000 and then Speaker of the Parliament from 2000 until 2005, when he was demoted to Minister of Rural Housing for openly jockeying to succeed the aging Mugabe. He returned to favour during the 2008 general election, in which he ran Mugabe's campaign, orchestrating political violence against the opposition Movement for Democratic Change – Tsvangirai. Mnangagwa served as Minister of Defence from 2009 until 2013, when he became justice minister again. He was also appointed First Vice-President in 2014 and was widely considered a leading candidate to succeed Mugabe.\nMnangagwa's ascendancy was opposed by Mugabe's wife, Grace Mugabe, and her Generation 40 political faction. Mugabe dismissed Mnangagwa from his positions in November 2017, and he fled to South Africa. Soon after, General Constantino Chiwenga, backed by elements of the Zimbabwe Defence Forces and members of Mnangagwa's Lacoste political faction, launched a coup. After losing ZANU–PF's support, Mugabe resigned, and Mnangagwa returned to Zimbabwe to assume the presidency.\nMnangagwa is commonly nicknamed \"Garwe\" or \"Ngwena\" (Shona: 'The crocodile'). It came initially from the name of the guerrilla group he founded, but later came to denote his political shrewdness. Reflecting this, the pro-Mnangagwa faction within ZANU–PF is named Lacoste after the French clothing company, known for its crocodile logo. He is also known in his home province of Midlands as \"the Godfather\". Mnangagwa was included in Time magazine's 100 Most Influential People of 2018.\n\n\n== Early life and education ==\n\n\n=== Early childhood: 1942–1955 ===\nDambudzo Mnangagwa was born on 15 September 1942 in Shabani (now Zvishavane), a mining town in central Southern Rhodesia. His parents, Mafidhi and Mhurai Mnangagwa, were politically active farmers. He belonged to a large family; his grandfather had six wives and 32 sons (daughters were not counted), and Mnangagwa himself is the ",
  "fetched_at": "2026-02-09T06:18:40.301369"
}