{
  "url": "https://en.wikipedia.org/wiki/Sariel",
  "title": "Sariel",
  "text": "Sariel (Hebrew and Aramaic: שָׂרִיאֵל Śārīʾēl, \"God is my Ruler\"; Greek: Σαριηλ Sariēl, Coptic: ⲥⲟⲩⲣⲓⲏⲗ Souriēl; Amharic: ሰራቁያል Säraquyael, ሰረቃኤል Säräqael) is an angel mainly from Judaic tradition. Other possible versions of his name are Suriel, Suriyel (in some Dead Sea Scrolls translations), Seriel, Sauriel, Saraqael, Sarakiel, Suruel, Surufel, and Souriel.\nIn 1 Enoch (20:6), he is said to be \"one of the [seven] holy angels [who watch], who is set over the spirits, who sin in the spirit\". Origen identified Suriel as one of seven angels who are considered primordial powers by the Ophites. In Gnosticism, Sariel is invoked for his protective powers. He is commemorated by the Coptic Orthodox Church on 27 Tobi in the Coptic calendar.\nHe is not to be confused with the fallen watcher Sahariel (Hebrew & Aramaic: שַׂהֲרִיאֵל Śahărīʾēl; \"God is my moon\") who bears a similar name. In 1 Enoch (8:1), he is said to have taught humans the course of the moon.\nIn traditional texts, the archangel Sariel is one of the holy angels, who is set over the spirits that sin in the spirit, and is one of the angels who look upon the bloodshed on Earth, along with Gabriel, Michael, Raphael and Uriel.\nIn the book of 2 Enoch he is listed, with the name of Samuil or Sariel, as one of the angels that brought Enoch to heaven.\nThe book of War of the Sons of Light Against the Sons of Darkness, from the Dead Sea Scrolls, lists the name of Sariel (שריאל, \"God is my Ruler\") along with Michael, Raphael, and Gabriel as names to write upon the shields of soldiers in a tower during maneuvers (1QM 9,15). It is used on the shields of the third Tower (1QM 9,16).\nThe angel Suriyel is briefly mentioned in the Conflict of Adam and Eve with Satan as bearing Adam and Eve from the top of a high mountain to the Cave of Treasures.\n\n\"… bring what he had brought, and give it to Adam. And they did so, one by one. 6 And God commanded Suriyel and Salathiel to bear up Adam and Eve, and bring them down from the top of the high mountain, and …\" - Bible. O. T. Apocryphal books. English First Book of Adam and Eve.\nIn the Ladder of Jacob, Sariel is dispatched by the Lord to Jacob to explain to him the meaning of the dream about the ladder.\nThe book of Liber Juratus by Honorius of Thebes has a number of translations which lists Sariell as one of \"The names of the angels of the eighth month, which is called marquesnan heshvan\", and Sariel as one of \"The names of the angels of the tenth month, which is called Tevet\". The month of Heshvan marquesnan would make Sariel's ruler Barfiell, or the month of Tevet would make the ruler Anael.\nThe Lesser Key of Solomon lists the dukes Asteliel and Gediel as commanding Sariel by night. The book A Dictionary of Angels by Gustav Davidson and The Complete Book of Devils and Demons by Leonard Ashley list Sariel as a fallen angel. The Greek Magical Papyri represents him as a deity to be called upon in rites using the \"Souriel\" variation of his name.\nThe University of Michigan has a section in its library collection devoted to Traditions of Magic in Late Antiquity, Protective Magic, Babylonian Demon Bowls. One clay bowl from Seleucia-on-Tigris dated to the 6th or 7th century A.D. lists Sariel twice:\n\n\"I wrote all of the curses upon a new bowl of clay and I sent back the curses of those who cursed Negray daughter of Denday to their masters until they release and bless in the name of Sariel the angel and Barakiel the angel and in the name of Sariel and Barakiel you release from the curses of those who curse Negray daughter of Denday as a man is freed from the house of bondage and from the house of weapons amen amen selah.\"\n\n\n== In media ==\n\n\n=== Video games ===\nIn the bullet hell series Touhou Project, the first game, Highly Responsive to Prayers, portrays Sariel as the final boss of the Makai (魔界) route. Sariel is also the true final boss of Bloodstained: Curse of the Moon 2.\n\n\n== See also ==\nList of angels in theology\n\n\n== References ==\n\n\n== External links ==",
  "fetched_at": "2026-02-09T06:06:55.787633"
}