{
  "url": "https://en.wikipedia.org/wiki/Book_of_Jubilees",
  "title": "Book of Jubilees",
  "text": "The Book of Jubilees is an ancient Jewish apocryphal text of 50 chapters (1,341 verses), considered canonical by the Ethiopian Orthodox Tewahedo Church, Eritrean Orthodox Tewahedo Church, as well as by Haymanot Judaism, a denomination observed by members of the Ethiopian Jewish community. Jubilees is considered one of the pseudepigrapha by the Eastern Orthodox, Catholic, and Protestant churches. Apart from Haymanot, the book is not considered canonical within any of the denominations of Judaism.\nIt was well known to early Christians, as evidenced by the writings of Epiphanius, Justin Martyr, Origen, Diodorus of Tarsus, Isidore of Alexandria, Isidore of Seville, Eutychius of Alexandria, John Malalas, George Syncellus, and George Kedrenos. The text was also utilized by the community that collected the Dead Sea Scrolls. No complete Hebrew, Greek or Latin version is known to have survived, but the Ge式ez version is considered to be an accurate translation of the fragments in Biblical Hebrew found in the Dead Sea Scrolls.\nThe Book of Jubilees presents a \"history of the division of the days of the law and of the testimony, of the events of the years, of their (year) weeks, of their jubilees throughout all the years of the world, as the Lord spoke to Moses on Mount Sinai when he went up to receive the tables of the law and of the commandment\" as revealed to Moses (in addition to the Torah or \"Instruction\") by angels while he was on Mount Sinai for forty days and forty nights. The chronology given in Jubilees is based on multiples of seven. The jubilee year is the year that follows the passage of seven \"weeks of years\" (seven cycles of sabbatical years, or 49 total years), into which all of time has been divided.\n\n\n== Manuscripts ==\nUntil the discovery of extensive fragments among the Dead Sea Scrolls, the earliest surviving manuscripts of Jubilees were four complete Ge式ez texts dating to the 15th and 16th centuries and several quotations by the early Church Fathers such as Epiphanius, Justin Martyr, Origen, Diodorus of Tarsus, Isidore of Alexandria, Augustine of Hippo, Isidore of Seville, Eutychius of Alexandria, John Malalas, George Syncellus, and George Kedrenos. There is also a preserved fragment of a Latin translation of the Greek that contains about a quarter of the whole work.\nThe Ge式ez Biblical texts, now numbering twenty-seven, are the primary basis for translations into English. Passages in the texts of Jubilees that are directly parallel to verses in Genesis do not directly reproduce either of the two surviving manuscript traditions. Consequently, even before the Qumran discoveries, R. H. Charles had deduced that the Hebrew original had used an otherwise unrecorded text for Genesis and for the early chapters of Exodus, one independent either of the Masoretic Text () or of the Hebrew text that was the basis for the Septuagint. According to one historian, the variation among parallel manuscript traditions that are exhibited by the Septuagint compared with the , and which are embodied in the further variants among the Dead Sea Scrolls, demonstrates that even canonical Hebrew texts did not possess any single \"authorized\" manuscript tradition before the Common Era. Others write about the existence of three main textual manuscript traditions (namely the Babylonian, Palestinian and pre- \"proto\" textual traditions). Although the pre- text may have indeed been authoritative back then, arguments can be made for and against this concept.\nBetween 1947 and 1956, approximately fifteen scrolls of Jubilees were found in five caves at Qumran, all written in Biblical Hebrew. The large number of manuscripts (more than for any Biblical books except for Psalms, Deuteronomy, Isaiah, Exodus, and Genesis, in descending order) indicates that Jubilees was widely used at Qumran. A comparison of the Qumran texts with the Ge式ez version, performed by James VanderKam, found that the Ge式ez was in most respects an accurate and literalistic translation.\n",
  "fetched_at": "2026-02-09T02:48:30.530936"
}