{
  "url": "https://en.wikipedia.org/wiki/Muspilli",
  "title": "Muspilli",
  "text": "Muspilli is an Old High German alliterative verse poem known in incomplete form (103 lines) from a ninth-century Bavarian manuscript. Its subject is the fate of the soul immediately after death and at the Last Judgment. Many aspects of the interpretation of the poem, including its title, remain controversial among scholars.\n\n\n== Manuscript ==\nThe text is extant in a single ninth-century manuscript:  Clm 14098 of the Bavarian State Library, Munich.\nThe bulk of the manuscript contains a Latin theological text presented between 821 and 827 by Adalram, bishop of Salzburg, to the young Louis the German (c. 810–876). Into this orderly written manuscript, the text of the Muspilli was untidily entered, with numerous scribal errors, using blank pages, lower margins and even the dedication page.\nThough in Carolingian minuscules, the handwriting is not that of a trained scribe. The language is essentially Bavarian dialect of the middle or late 9th century. The poem's beginning and ending are missing: they were probably written on the manuscript's outer leaves, which have since been lost. Legibility has always been a problem with this text, and some early editors used reagents which have left permanent stains.\nThere are many conjectural readings, some of them crucial to modern interpretation of the work.\n\n\n== Metrical form ==\nMost of the poem is in alliterative verse of very uneven quality.\nSome lines contain rhymes, using a poetic form pioneered in the ninth century by Otfrid of Weissenburg (c. 790–875).\nThis formal unevenness has often led scholars to regard the surviving text as a composite made up of older material and younger accretions – an impression reinforced by the poem's thematic and stylistic diversity. But it is also possible that a single poet deliberately chose to vary the verse forms in this way.\n\n\n== Synopsis ==\n(Lines 1–17) Directly after death, armies of angels and devils will fight for a person's soul, and they will transport it immediately, either to the joys of an eternal dwelling in Heaven, or to the fire, darkness and torments of Hell.\n(18–30) Everyone must therefore do God's will in this world. Divine help can no longer be obtained, once a person lies suffering in Hell.\n(31–36) When the Mighty King issues His summons (daz mahal kipannit), all humans must attend and account for their actions on earth.\n(37–47) The poet has heard dia uueroltrehtuuîson (possibly: 'men wise in the laws of the world') saying that Elias (the Old Testament prophet Elijah) will fight with and defeat the Antichrist. Elias will be acting with God's help as a champion of those seeking righteousness, to secure for them a place in Heaven. The Antichrist will be supported by Satan. He will pull him down. He will therefore be denied a victory in the encounter.\n(48–62) But (many?) men of God (gotmann-) believe that in that battle Elias will be wounded (or killed?). (When?) Elias's blood drips onto the earth, (then?) mountains will burst into flame, trees will no longer stand, waters will dry up, the moon will fall, the sky will smoulder, middle-earth (mittilagart) will burn. With the Day of Punishment or Penance (stuatago) at hand, no man is able to help a kinsman before the muspilli. Amidst this destruction, what is left of the borderlands where humans once fought alongside their kinsfolk? Damned souls have no further chance of remorse and will be taken off to Hell.\n(63–72) A man should judge fairly on earth, because then he need not worry when standing before the Heavenly Judge. When a man disrupts the law by taking bribes, he is being secretly watched by the Devil, who will recall his misdeeds at the Final Judgment.\n(73–99a) When the Heavenly Horn is sounded, the Judge, accompanied by an unconquerable host of angels, sets out for the place marked out for judgment. Angels will wake the dead and guide them to the judicial assembly (ding). All human beings will rise from the earth, free themselves from the bondage of the grave-mounds (lossan sih a",
  "fetched_at": "2026-02-09T05:21:02.259689"
}