{
  "url": "https://en.wikipedia.org/wiki/Chinese_character_structures",
  "title": "Chinese character structures",
  "text": "Chinese character structures (simplified Chinese: 汉字结构; traditional Chinese: 漢字結構; pinyin: hànzì jiégòu) are the patterns or rules in which the characters are formed by their writing units. There are two aspects of Chinese character structures:\nThe external structures are on the writing strokes, components and whole characters as well as their structural relations on the pure dimension of character forms. \nThe internal structures studies the relationship between the forms, sounds and meanings of Chinese characters.\n\n\n== External structures ==\n\nChinese character external structure is on how the writing units are combined level by level into a complete character. There are three levels of structural units of Chinese characters: strokes, components, and whole characters. For example, character 字 (character) is composed of two components, each of which is composed of three stokes:\n\n字 = 宀(㇔㇔㇇) + 子(㇇㇚㇐).\n\n\n=== Strokes ===\n\nStrokes (笔画; 筆劃; bǐhuà) are the smallest building units of Chinese characters. When writing a Chinese character, the trace of a dot or a line left on the writing material (such as paper) from pen-down to pen-up is called a stroke.\nStrokes combine with each other in a Chinese character in different ways. There are three types of combinations between two strokes:\n\nSeparation: the strokes are separated from each other. Such as: 八, 三, 小.\nConnection: the strokes are connected, such as 匕, 正, 厂, 弓, 凹, 凸.\nIntersection: the strokes are intersected. Such as: 十, 丈, 車.\n\n\n=== Components ===\n\nChinese character components (部件; bùjiàn) are Chinese character building blocks composed of strokes. In most cases, a component is larger than a stroke (i.e., consists of more than one stroke) and smaller than the whole character (combines with some other components to form a character). For example, in character \"件\", there are two components (亻 and 牛), each with more than one strokes, (亻: ㇓㇑) and (牛: ㇓㇐㇐㇑). In the special cases of one-stroke characters, such as \"一\" and \"乙\", a stroke is a component and is a character.\nChinese character component analysis is to divide or separate a character into components.\nThere are two ways for Chinese character dividing, hierarchical dividing and plane dividing. Hierarchical dividing separate layer by layer from larger to smaller components, and finally get the primitive components. Plane dividing separate out the primitive components at one time. Hierarchical dividing can display the external structure of Chinese characters, while plane splitting can be regarded as omitting the higher splitting levels, and directly writing out the final separating result of primitive components.\n\n\n=== Whole characters ===\n\nA Chinese whole character (整字; zhěngzì) is a complete character. It lies at the final level of the stroke-component-character composition.\nAccording to their structures, Chinese characters can be divided into undecomposable characters and decomposable characters.\nAn undecomposable character (独体字; 獨體字) consists of one primitive component, which is directly formed by strokes and can not be decomposed into smaller components, for example, \"一, 二, 三, 止, 正\".\nA decomposable character (合体字; 合體字) consists of more than one components. There are two frequently used modes of component combination in the study of Chinese character structures: first-level component combination and primitive component combination.\nAccording to first-level component combination, the structures of decomposable characters can be divided into 13 categories:\n\nLeft to right (⿰, 2FF0), for example: 部, 件, 結 and 構.\nLeft to middle and right (⿲, 2FF2): 衡, 班 and 辯.\nAbove to below (⿱, 2FF1): 要, 思 and 想.\nAbove to middle and below (⿳, 2FF3): 鼻, 曼 and 率.\nFull surround (⿴, 2FF4): 圍, 國 and 囪\nSurround from above (⿵, 2FF5): 問, 同 and 風\nSurround from below (⿶, 2FF6): 凶, 画 and 函\nSurround from left (⿷, 2FF7): 匡, 匠 and 匣\nSurround from upper left (⿸, 2FF8): 廣, 居 and 病.\nSurround from upper right (⿹, 2FF9): 句, 可 and 氧.\nSurround from lower left (⿺, 2FFA): 這, 建",
  "fetched_at": "2026-02-09T05:19:35.733589"
}