{
  "url": "https://en.wikipedia.org/wiki/Demon",
  "title": "Demon",
  "text": "A demon is an evil or malevolent supernatural entity. Historically, belief in demons, or stories about demons, occurs in folklore, mythology, religion, occultism, and literature; these beliefs are reflected in media including\nfiction, comics, film, television, and video games. Belief in demons probably goes back to the Paleolithic age, stemming from humanity's fear of the unknown, the strange and the horrific. In ancient Near Eastern religions and in the Abrahamic religions, including early Judaism and ancient-medieval Christian demonology, a demon is considered a harmful spiritual entity that may cause demonic possession, calling for an exorcism. Large portions of Jewish demonology, a key influence on Christianity and Islam, originated from a later form of Zoroastrianism, and was transferred to Judaism during the Persian era.\nDemons may or may not be considered to be devils: minions of the Devil. In many traditions, demons are independent operators, with different demons causing different types of evils (destructive natural phenomena, specific diseases, etc.) in general, while devils appear more often as demons within a theological framework; demons opposing the Divine principle. As lesser spirits doing the Devil's work, they have additional duties— causing humans to have sinful thoughts and tempting humans to commit sinful actions.\nThe original Ancient Greek word daimōn (δαίμων) did not carry negative connotations, as it denotes a spirit or divine power. The Greek conception of a daimōn notably appears in the philosophical works of Plato, where it describes the divine inspiration of Socrates. In Christianity, morally ambivalent daimōn were replaced by demons, forces of evil only striving for corruption. Such demons are not the Greek intermediary spirits, but hostile entities, already known in Iranian beliefs. In Western esotericism and Renaissance magic, which grew out of an amalgamation of Greco-Roman magic, Jewish Aggadah, and Christian demonology, a demon is believed to be a spiritual entity that may be conjured and controlled.\nBelief in demons remains an important part of many modern religions and occult traditions. Demons are still feared largely due to their alleged power to possess living creatures. In contemporary Western esoteric traditions, demons may be used as metaphors for inner psychological processes (\"inner demons\").\n\n\n== Etymology ==\n\nThe Ancient Greek word δαίμων (daimōn) denotes a spirit or divine power, much like the Latin genius or numen. Daimōn most likely came from the Greek verb daiesthai ('to divide' or 'distribute'). The Greek conception of a daimōn notably appears in the philosophical works of Plato, where it describes the divine inspiration of Socrates. The original Greek word daimōn does not carry the negative connotation initially understood by implementation of the Koine δαιμόνιον (daimonion), and later ascribed to any cognate words sharing the root.\nThe Greek terms do not have any connotations of evil or malevolence. By the early centuries of the Roman Empire, cult statues were seen, by Pagans and their Christian neighbors alike, as inhabited by the numinous presence of the Greco-Roman gods: \"Like pagans, Christians still sensed and saw the gods and their power, and as something, they had to assume, lay behind it, by an easy traditional shift of opinion they turned these pagan daimones into malevolent 'demons', the troupe of Satan. Far into the Byzantine period, Christians eyed their cities' old pagan statuary as a seat of the demons' presence. It was no longer beautiful, it was \"infested.\" The term had first acquired its negative connotations in the Septuagint translation of the Hebrew Bible into Greek, which drew on the mythology of ancient Semitic religions. This was then inherited by the Koine text of the New Testament.\nThe English use of demon as synonym for devils goes back at least as far as about 825. The German word (Dämon), however, is different from devil (Teufel) and demons as evil",
  "fetched_at": "2026-02-09T06:01:12.022705"
}