{
  "url": "https://en.wikipedia.org/wiki/Greek_Minor_Prophets_Scroll_from_Nahal_Hever",
  "title": "Greek Minor Prophets Scroll from Nahal Hever",
  "text": "The Greek Minor Prophets Scroll from Nahal Hever (8HevXII gr) is a Greek manuscript of a revision of the Septuagint dated to the 1st century BC and the 1st century CE. The manuscript is kept in the Rockefeller Museum in Jerusalem. It was first published by Dominique Barthélemy in 1963. The Rahlfs-Siglum is 943.\n\n\n== Discovery and history ==\nIn the 1st century CE, the 8HevXII gr with several documents was taken by Jewish fugitives (Bar Kokhba's troops, women and children) who were taking refuge in the Caves of Nahal Hever. After accepting their death, unable to leave because of the presence of Roman camps outside the caves, who besieged the inmates as a military camp located above the cave shows, the refugees decided to make a large bonfire and burn all their belongings, but buried the Greek Minor Prophets Scroll and other important documents between the rocks of the end chamber. Inside the caves, a burnt layer was found which suggests that the last inhabitants of the cave had burned all their possessions. The scroll had been buried, and other documents that would have provided information about other insurgents that wanted to destroy them so as not to let them fall into the hands of the Romans. This practice is mainly known from the later Jewish tradition (Geniza), but was also observed in this twelve-prophet scroll apparently from Wadi Murabba'at.\nBetween 1946 and 1947 the Dead Sea Scrolls were discovered by Bedouins. Since 1948, Nahal Hever has been part of Israel, but the Bedouins reported that the manuscripts came from Wadi Seiyal to legitimize their possession. Due to the excavations of the Bedouins, the archaeological context could no longer be determined. The Bedouins sold their finds to researchers in East Jerusalem, which was under Jordanian control at the time, while Wadi Seiyal was in Israel.\nFrom 1952 to 1954 the manuscripts that comprised what was known as the Seiyâl collection was acquired by the Palestine Archaeological Museum (today is Rockefeller Museum), from clandestine excavators. Among the fragments were also parts of a scroll of the Twelve Prophets book, and were catalogued as Se2grXII (Seiyâl Collection No. 2).\nIn 1953, scarcely a year after the Bedouin had brought these materials to the École biblique et archéologique française in Jordanian Jerusalem, Dominique Barthélemy published a \"brief analysis of the fragments\" in French of the Greek Minor Prophets scroll from the then \"unknown provenance\" somewhere south of Wadi Murabba'at.\nAmongst other things, in response to rumors that parts of the sold scrolls came from Israel, Hebrew University of Jerusalem sent two expeditions, in 1960 and 1961, for exploration through the Wadi to the west of the Dead Sea. In the expedition B of the company in spring 1961 under the direction of Yohanan Aharoni, who examined mainly the caves on the southern edge of Nahal Hever, in Cave no. 8 (the Cave of Horror) it found, among other things, fragments of the Greek scroll. Most of which only a few centimeters between large fragments could still be associated with the twelve minor prophets. It also became apparent relatively quickly that the fragments were parts of the same scroll that had been purchased ten years earlier. The locality of this role - as well as most of the other scrolls of the Seiyâl Collection - was therefore contrary to the specification of the Bedouin of the Nachal Hever determined previously.\nThe other fragments found in expedition B of the Hebrew University of Jerusalem in cave No. 8 in Nahal Hever (Judean Desert) named Cave of Horror, were examined by Baruch Lifshitz. Lifshitz published the Se2grXII fragments together with the other new fragments found in the Cave of Horror. In 1961 and 1962, Lifshitz published the fragments with photographs in Yediot and in Israel Exploration Journal which Emanuel Tov called \"the first edition, still substandard\". Tov wrote that \"these small fragments were published by B. Lifshitz, \"The Greek Documents from th Cave of H",
  "fetched_at": "2026-02-09T02:48:19.124706"
}