{
  "url": "https://en.wikipedia.org/wiki/Athena_relief_of_Sömek",
  "title": "Athena relief of Sömek",
  "text": "The Athena relief of Sömek is a Greco-Roman rock relief, located some two kilometres north of the village of Sömek in Silifke district of Mersin province in Turkey, near the valley of the Limonlu river, the ancient Lamos. In antiquity, the river formed the border between \"Rugged Cilicia\" (Kilikia Tracheia) in the west and \"Flat Cilicia\" (Kilikia Pedias) in the east.\n\n\n== Description ==\n\nThe relief is carved in the living rock at a height of some 1.5 metres above the ground. It has a total height of 1.3 metres. In a niche finished with a conch-shaped top, the image of a woman is found, who can be identified as the goddess Athena thanks to the inscription, among other things. On both sides the niche is formed from blocky pilasters, topped by wide capitals. The goddess is dressed in a peplos, the apoptygma, or upper layer, of which is bound by a girdle at the waist. On the lower part, the robe is tightly fitted to her body, such that her calves are clearly visible underneath. The material covers up her ankles and feet, at the sides of it wrinkle lines go from it to the ground.\n\nThe right arm of the figure is raised and holds a lance. Her left, pointing down to the ground, holds a shield on edge. The lance rests on a column, which connects directly to the left pilaster. A snake winds around the lance and column, with its lower end reaching along the ground to Athena's feet. The head and mane of a bridled horse can be seen above the shield and left arm of the goddess and its hindquarters disappear behind her right arm. On the right pilaster there is a star, a crescent moon and a thunderbolt to be seen. Between the moon and the thunderbolt, traces of a servered head can be made out. Similar traces are found to the left of the left pilaster, which is itself undecorated. To the right of the righthand limit of the image, a symbol has been engraved, consisting of a stand with two crescent moons on top and a ball with star. Serra Durugönül, who investigated the Cilician rock reliefs in the 1980s, thought this was a candelabrum, that is a cult object, to be interpreted as a simplified depiction of a Jewish menorah.\nBetween the lance on the left and the female figure an inscription of 13 lines is engraved in a narrow field. In it the goddess is referred to as ΑΘΗΝΑ ΚΡΙΣΟΑ (Athena Krisoa);. The epithet ΚΡΙΣΟΑ, derived from a place name, indicates a local variant of the divinity, but the place connected with the epithet cannot yet be located. It would certainly have been found in the north of Rough Cilica, however.  The same epithet shows up in another inscription in the area and in both inscriptions Athena is also referred to as ΟΡΕΙΑ (Oreia, meaning \"mountaindweller\")\n\n\n== Interpretation and dating ==\nThe depiction of the goddess corresponds to the Athena Parthenos type, modelled on Phidias' free-standing statue in the Parthenon on the Athenian Acropolis. Numerous imitations of this statue were made even in ancient times – another one has also been found in Cilicia. Similarities with Phidias' original include, above all, the clothing, the shield and the column standing on the left. In the original statue, this was a support of the right hand, in which Athena held Nike. Even though this no longer has a function, since this statue is carved in relief and does not hold Nike, the artist was unwilling to omit this characteristic attribute.\nParticularly on account of the type of clam-shell vault of the relief, Durugönül identified two possible dates for the creation of the relief. The first would be the time of the Emperors Claudius and Nero in the 1st century, the second would be the period after Hadrian in the 2nd and 3rd centuries AD.  She inclines to the second, dating the relief to the 2nd century, on the basis of comparison with other rock reliefs of Asia Minor, among which is that of a moongod at Sumatar Harabesi in Osrhoene, which an inscription dates after 165.\n\n\n== See also ==\nWarrior relief of Efrenk – another Greco-Roman relief, loca",
  "fetched_at": "2026-02-09T02:48:15.938489"
}