{
  "url": "https://en.wikipedia.org/wiki/Solomon_Areda",
  "title": "Solomon Areda",
  "text": "Solomon Areda Waktolla (Amharic: ሰለሞን አረዳ ዋቅቶላ, Oromo: Solomoon Araddaa Waqtolaa) is an Ethiopian lawyer who had served as the Deputy Chief Justice/Vice President of the Federal Supreme Court of Ethiopia from 2018 to 2023. Solomon is a prominent lawyer with 26 years of experience in the practice of law, public administration and policy research who is committed for seeing a free and independent judiciary in Ethiopia. Solomon had worked in the judiciary mainly as a judge for 20 years on different levels of the court in both regional and federal positions. In addition, he has been appointed to the membership of the Permanent Court of Arbitration (PCA) at The Hague, Netherlands for a six-year term to serve as an Arbitrator.\nSolomon was appointed on 15 November 2022 by the UN General Assembly as a Half-time Judge of the United Nations Dispute Tribunal for a mandate starting on 1 July 2023 and ending on 30 June 2030. Furthermore, he has been appointed by the Board of Directors of the African Development Bank as a Judge of the Administrative Tribunal of the African Development Bank, effective from November 2023.\n\n\n== Early life and education ==\nSolomon Areda Waktolla born in the town of Garba Guracha, Salalee, North Shewa zone of Oromia regional state in Ethiopia.\nJustice Solomon Waktolla attended his elementary and high school education in a public school in the town of Garba Guracha. He then attended Addis Ababa University and obtained a bachelor's degree in law in 1997. He received a Master of Laws degree (LL.M) from Harvard Law School and Master of public Administration (MPA) from Harvard Kennedy School of Government. He obtained HIID Merit Scholarship award from Harvard University. At Harvard Kennedy School of Government, Solomon completed the fellowship of Edward S. Mason Program in public Policy and Management. In addition, he received Master of Laws (LL.M) in International Economic Law at the University of Amsterdam.\nHe is a member of the Harvard Alumni Association and currently serving as Harvard University Contact Person in Ethiopia. Solomon is a fellow of Golda Meir Mount Carmel International Training Center and an alumnus of the Center for American and International Law.\n\n\n== Judicial career ==\nAfter graduating from the law school, Solomon began working as an assistant judge in the Oromia Region Supreme Court. After his clerkship, Solomon was appointed as a judge of the Regional High Court in West Shewa Zone of Oromia region in Ambo Town. During his years in the Ambo High Court, he served in both Civil and Criminal divisions of the court. In 2001, Solomon started his judgeship at the Federal First Instance Court of Ethiopia. From February 2003 to January 2009, Solomon served as a Federal High Court Judge and sat in Commercial, Criminal and Labor Divisions of the Federal High Court.\nDuring his six-years tenure at the Federal High Court, Justice Solomon presided over the historical Ethiopian Red Terror genocide trial where the former Ministers and other Higher Officials that served during the Derg regime were prosecuted for genocide and crimes against humanity.\nIn January 2009, the Ethiopian House of Parliament appointed Solomon to serve as the Vice President of the Federal First Instance Court of Ethiopia.\n\n\n== Private legal practice ==\nAfter graduating from Harvard law School, in December 2014 Solomon started the private legal practice, establishing his own firm named Solomon Areda Law Office in Addis Ababa. Solomon Areda Law office offered a diversified expertise on various areas of the law; ranging from dealing in complex litigation and arbitration, corporate and commercial transactions, banking and finance, labor and employment, intellectual property, energy and infrastructure, mining and natural resources, construction law and Tax law. He advised both local, as well as global multi-nationals seeking to do business in Ethiopia and other African Countries Solomon also represented local and international companies on mu",
  "fetched_at": "2026-02-09T06:00:51.818190"
}