{
  "url": "https://en.wikipedia.org/wiki/Giant",
  "title": "Giant",
  "text": "In folklore, giants (from Ancient Greek: gigas, cognate giga-) are beings of humanoid appearance, but are at times prodigious in size and strength or bear an otherwise notable appearance. The word giant is first attested in 1297 from Robert of Gloucester's chronicle. It is derived from the Gigantes (Ancient Greek: Γίγαντες) of Greek mythology. \nFairy tales such as Jack the Giant Killer have formed the modern perception of giants as dimwitted and violent ogres, sometimes said to eat humans or livestock. In more recent portrayals, like those of Jonathan Swift and Roald Dahl, some giants are both intelligent and friendly.\n\n\n== Literary and cultural analysis ==\nGiants appear many times in folklore and myths. Representing the human body enlarged to the point of being monstrous, giants evoke terror and remind humans of their body's frailty and mortality. They are often portrayed as monsters and antagonists, but there are exceptions. Some giants intermingle with humans in a friendly way and can even be part of human families, their offspring portrayed as regular humans often referred to as half-giants.\n\nFolklorists and historians examine the role giants are assigned in regional geomythologies. For example, Fionn mac Cumhaill is said to have built the Giant's Causeway on the island of Ireland. Per a 1965 examination in an American studies journal, It is generally admitted today that Paul Bunyan was a synthetic figure conceived by advertising men rather than the spontaneous product of the folk mind, yet he has been adopted by the American people with enthusiasm...Paul and his blue ox Babe are supposed to have altered the appearance of the American continent; the animal's hoof prints became the lake beds of the Northwest and from its drinking trough spilled the Mississippi River. Fossilized remains of ancient mammals and reptiles common to the Sivalik Hills of India may have influenced aspects of the Mahābhārata that tell of battles in which \"hundreds of mighty, and sometimes gigantic, heroes, horses, and war elephants are said to have died.\"\n\n\n== Archeology and paleontology ==\nClaudine Cohen, in her 2002 book The Fate of the Mammoth, argued that the history of human interaction with fossil bones of prehistoric megafauna was heavily influenced by giant lore. Per Cohen, the proto-scientific study of giants appears in several phases of human history: Herodotus reported that the remains of Orestes were found in Tegea; Pliny described a giant's skeleton found in Crete after an earthquake, and seemed to refer to evolution as the process by which giants become human-size over time; and Saint Augustine mentions what is believed to have been the fossilized molar of an ancient Elephantidae in his City of God, in a passage reflecting on the nature and meaning of the Noahacian deluge. \nThe academic consideration of giants continued through the Middle Ages, Renaissance, and even the early modern period. Boccaccio devoted a passage of his Genealogies of the Pagan Gods to purported archeological discoveries in Sicily that he thought might be evidence of the historicity of The Odyssey's Polyphemus. Rabelais created a wholly \"fabricated giantology\" for his 16th-century Gargantua and Pantagruel. Massive bones found in 1613 in France were initially assigned to Teutobochus but the examinations of them by various physicians and their publication of diverging conclusions about the bones kicked off a \"pamphlet war\" between anatomists and surgeons of the day.  The discovery of the so-called Claverack Giant in colonial New York triggered giantological investigations by two important early American intellectuals, Cotton Mather and Edward Taylor.\n\n\n== Religion and mythology ==\n\n\n=== Abrahamic ===\n\nGenesis tells of the Nephilim before and after Noah's Flood. The word Nephilim is loosely translated as giants in some translations of the Hebrew Bible, but left untranslated in others. According to Genesis 7:23, the Nephilim were destroyed in the Flood, but Nephilim a",
  "fetched_at": "2026-02-09T05:45:29.820404"
}