{
  "url": "https://en.wikipedia.org/wiki/Cher",
  "title": "Cher",
  "text": "Cher (  SHAIR; born Cheryl Sarkisian, May 20, 1946) is an American singer and actress. Dubbed the \"Goddess of Pop\", she is known for her androgynous contralto voice, bold fashion and visual presentation, and multifaceted career. Her screen roles often reflect her public image as a strong-willed, outspoken woman. An influential figure in popular culture, Cher has sustained a career spanning more than six decades through continual reinvention.\nCher rose to fame in 1965 as part of the folk rock duo Sonny & Cher, whose hit single \"I Got You Babe\" became emblematic of 1960s counterculture. She simultaneously launched a solo career with moody pop songs such as \"Bang Bang (My Baby Shot Me Down)\", whose theatrical storytelling foreshadowed her 1970s US Billboard Hot 100 number-one singles \"Gypsys, Tramps & Thieves\", \"Half-Breed\" and \"Dark Lady\". After a period of acting, she released the hair metal albums Cher (1987), Heart of Stone (1989) and Love Hurts (1991), scoring international number-one hits \"If I Could Turn Back Time\" and \"The Shoop Shoop Song (It's in His Kiss)\". At 52, she released the dance-pop album Believe (1998), which introduced the \"Cher effect\"—a stylized use of Auto-Tune to distort vocals. Its title track became 1999's number-one song in the US and the UK's best-selling single by a female artist. In the 21st century, she released her highest-charting US Billboard 200 albums, Closer to the Truth (2013) and Dancing Queen (2018), each debuting at number three.\nCher became a TV star in the 1970s with The Sonny & Cher Comedy Hour and her solo variety show Cher, both on CBS, which drew more than 30 million weekly viewers. She later gained critical acclaim with her Broadway debut and the film adaptation of Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982). Transitioning to film, she earned two Academy Award nominations—for Silkwood (1983) and Moonstruck (1987), winning Best Actress for the latter—and received the Cannes Film Festival's Best Actress Award for Mask (1985). Other starring roles include The Witches of Eastwick (1987), Mermaids (1990), If These Walls Could Talk (1996, her directorial debut), Tea with Mussolini (1999), Burlesque (2010) and Mamma Mia! Here We Go Again (2018).\nOne of the best-selling music artists in history, Cher has sold over 100 million records and is the only solo artist with number-one singles on the US Billboard charts in seven consecutive decades (1960s–2020s). Her accolades include two Grammy Awards—among them the Grammy Lifetime Achievement Award—a Primetime Emmy Award, three Golden Globe Awards, the Billboard Icon Award and the Kennedy Center Honors. She is the only performer to have won an Academy Award for acting and been inducted into the Rock and Roll Hall of Fame. Her 2002–2005 Living Proof: The Farewell Tour was the highest-grossing concert tour by a female artist at the time, earning $250 million—about $400 million in 2024. Her life and career inspired the 2018 jukebox musical The Cher Show. Beyond entertainment, Cher is known for her progressive politics and advocacy for causes including LGBTQ rights and HIV/AIDS awareness.\n\n\n== Life and career ==\n\n\n=== 1946–1961: Early life ===\nCheryl Sarkisian was born in El Centro, California, on May 20, 1946. Her father, John Sarkisian, an Armenian-American truck driver with drug and gambling problems, was rarely present during her early life. Her mother, Georgia Holt, was a model and actress of Irish, English, German and Cherokee descent. Cher's paternal grandparents were survivors of the Armenian genocide. Cher's parents divorced when she was 10 months old. Before leaving, her father placed her in an orphanage for several months; Holt was allowed to visit once a week, only able to see Cher through a window. Both found the experience traumatic.\n\nIn 1951, Holt married actor John Southall, with whom she had Cher's half-sister, Georganne. Holt's marriage to Southall ended when Cher was nine; Cher later described him as her \"real father\" ",
  "fetched_at": "2026-02-09T06:07:16.806209"
}