{
  "url": "https://en.wikipedia.org/wiki/Moses",
  "title": "Moses",
  "text": "In Abrahamic religions, Moses was the Hebrew prophet who led the Israelites out of slavery in the Exodus from Egypt. He is considered the most important prophet in Judaism and Samaritanism, and one of the most important prophets in Christianity, Islam, the Baháʼí Faith, and other Abrahamic religions. According to the Abrahamic scriptures, God dictated the Mosaic Law to Moses, which he wrote down and which formed part of the Torah.\nAccording to the Book of Exodus, Moses was born in a period when his people, the Israelites, who were an enslaved minority, were increasing in population; consequently, the Egyptian Pharaoh was worried that they might ally themselves with Egypt's enemies. When Pharaoh ordered all newborn Hebrew boys to be killed in order to reduce the population of the Israelites, Moses' Hebrew mother, Jochebed, secretly hid him in the bulrushes along the Nile river. The Pharaoh's daughter discovered the infant there and adopted him as a foundling. Thus, he grew up with the Egyptian royal family. After killing an Egyptian slave-master who was beating a Hebrew, Moses fled across the Red Sea to Midian, where he encountered the Angel of the Lord, speaking to him from within a burning bush on Mount Horeb.\nGod sent Moses back to Egypt to demand the release of the Israelites from slavery. Moses said that he could not speak eloquently, so God allowed Aaron, his elder brother, to become his spokesperson. After the Ten Plagues, Moses led the Exodus of the Israelites out of Egypt and across the Red Sea, after which they based themselves at Mount Sinai, where Moses received the Ten Commandments. After 40 years of wandering in the desert, Moses died on Mount Nebo at the age of 120, within sight of the Promised Land.\nThe majority of scholars see the biblical Moses as a legendary figure, while retaining the possibility that Moses or a Moses-like figure existed in the 13th century BCE. Rabbinic Judaism calculated a lifespan of Moses corresponding to 1391–1271 BCE; Jerome suggested 1592 BCE, and James Ussher suggested 1571 BCE as his birth year. Moses has often been portrayed in art, literature, music and film, and he is the subject of works at a number of U.S. government buildings.\n\n\n== Etymology of name ==\n\nThe Egyptian root msy ('child of') or mose has been considered as a possible etymology, arguably an abbreviation of a theophoric name with the god's name omitted. The suffix mose appears in Egyptian pharaohs' names like Thutmose ('born of Thoth') and Ramose ('born of Ra'). One of the Egyptian names of Ramesses was Ra-mesesu mari-Amon, meaning 'born of Ra, beloved of Amon'. Ms by itself also has multiple attestations as an Egyptian personal name in the New Kingdom. Linguist Abraham Yahuda, based on the spelling given in the Tanakh, argues that it combines \"water\" or \"seed\" and \"pond, expanse of water,\" thus yielding the sense of \"child of the Nile\" (mw-š).\nThe biblical account of Moses' birth provides him with a folk etymology to explain the ostensible meaning of his name. He is said to have received it from the Pharaoh's daughter: \"he became her son. She named him Moses [מֹשֶׁה, Mōše], saying, 'I drew him out [מְשִׁיתִֽהוּ, mǝšīṯīhū] of the water'.\" This explanation links it to the Semitic root משׁה, m-š-h, meaning \"to draw out\". The eleventh-century Tosafist Isaac b. Asher haLevi noted that the princess names him the active participle 'drawer-out' (מֹשֶׁה, mōše), not the passive participle 'drawn-out' (נִמְשֶׁה, nīmše), in effect prophesying that Moses would draw others out (of Egypt); this has been accepted by some scholars.\nThe Hebrew etymology in the Biblical story may reflect an attempt to cancel out traces of Moses' Egyptian (i.e. Gentile) origins. The Egyptian character of his name was recognized as such by ancient Jewish writers like Philo and Josephus. Philo linked Moses' name (Ancient Greek: Μωϋσῆς, romanized: Mōysēs, lit. 'Mōusês') to the Egyptian (Coptic) word for 'water' (môu, μῶυ), in reference to his finding in t",
  "fetched_at": "2026-02-09T05:48:30.669395"
}