{
  "url": "https://en.wikipedia.org/wiki/2_Enoch",
  "title": "2 Enoch",
  "text": "The Second Book of Enoch (abbreviated as 2 Enoch and also known as Slavonic Enoch, Slavic Enoch, or the Secrets of Enoch) is a pseudepigraphic text in the apocalyptic genre. It describes the ascent of the patriarch Enoch, ancestor of Noah, through ten heavens of an Earth-centered cosmos. The Slavonic edition and translation of 2 Enoch is of Christian origin in the 8th century but is based on an earlier work. 2 Enoch is distinct from the Book of Enoch, known as 1 Enoch, and there is also an unrelated 3 Enoch, although none of the three books are considered canonical scripture by the majority of Jewish or Christian bodies. The numbering of these texts has been applied by scholars to distinguish each from the others.\nThe cosmology of 2 Enoch corresponds closely with beliefs of the Early Middle Ages about the metaphysical structure of the universe. It may have been influential in shaping them. The text was lost for several centuries, then recovered and published at the end of the nineteenth century. The full text is extant only in Church Slavonic, but Coptic fragments have been known since 2009. The Church Slavonic version itself represents a translation from an earlier Greek version.\nSome scholars attribute 2 Enoch to an unidentified Jewish sect, while others regard it as the work of first-century Christians. Some consider it a later Christian work. It is not included in either the Jewish or the Christian canon, except that it was heavily utilized by the Bogomils.\n\n\n== Manuscript tradition ==\n2 Enoch has survived in more than twenty Old Bulgarian manuscripts and fragments, dated from the 14th to 18th centuries AD. These Old Bulgarian materials did not circulate independently but were included in collections that often rearranged, abbreviated, or expanded them. Typically, Jewish pseudepigraphic texts in Slavic milieux were transmitted as part of larger historiographical, moral, and liturgical codexes and compendiums, where ideologically marginal and mainstream materials were mixed.\n2 Enoch exists in longer and shorter recensions. The first editors considered the longer version to be the original. Since 1921, Schmidt and many authors challenged this theory, and considered the shorter recension to be more ancient. Vaillant showed in 1952 that the additional parts found only in the longer version use more recent terms. Other scholars suggest that both of them preserve original material, and posit the existence of three or even four recensions.\nTwo different ways of numbering verses and chapters are used for 2 Enoch: the more widely accepted is Popov's of 73 chapters, while De Santos Otero proposed division into 24 chapters.\nThe best family of manuscripts are copies of the compilation of rearranged materials from Chapters 40–65 found in a 14th-century judicial codex titled The Just Balance (Merilo Pravednoe). It is the oldest of all the manuscripts. The main manuscripts of the longer version are designated R, J, and P. The main manuscripts of the shorter version are designated U, B, V, and N. Several other manuscripts exist.\nThere is one fragment of 2 Enoch in Glagolitic in the Croatian dialect. It dates to the 17th century.\nMost scholars believe that the Old Bulgarian version was translated from one or more lost Greek versions, since the text attests to some traditions that make sense only in the Greek language. For example, a tradition found in 2 Enoch 30 that derives Adam’s name from the Greek designations of the four corners of the world. Semitisms found in various parts of the text, such as the words Ophanim and Raqia Arabot, point to the possibility of a Semitic original behind the Greek version.\nIn 2009, four fragments in Coptic from Chapters 36–42 were identified. They follow the short recension and are related to Manuscript U.\n\n\n== Dating ==\nDates ranging from the 1st century BCE to the 10th century CE have been proposed, with the late 1st century CE often preferred. The date of the text can be deduced solely on the basis of ",
  "fetched_at": "2026-02-09T02:51:31.739880"
}