{
  "url": "https://en.wikipedia.org/wiki/The_Book_of_Giants",
  "title": "The Book of Giants",
  "text": "The Book of Giants is an apocryphal book which expands upon the Genesis narrative of the Hebrew Bible, in a similar manner to the Book of Enoch. Together with this latter work, The Book of Giants \"stands as an attempt to explain how it was that wickedness had become so widespread and muscular before the flood; in so doing, it also supplies the reason why God was more than justified in sending that flood.\" The text's composition has been dated to before the 2nd century BC.\nThe Book of Giants is an antediluvian (pre-Flood) narrative that was received primarily in Manichaean literature and known at Turfan. However, the earliest known traditions for the book originate in Aramaic copies of a The Book of Giants among the Dead Sea Scrolls.  References to the Giants mythology are found in: Genesis 6:1-4, the books of Enoch (Ethiopic, Slavonic, Hebrew, Greek), Jubilees, Genesis Apocryphon, 2 and 3 Baruch (Slavonic), the Damascus Document, and visions in Daniel 7:9-14. This book tells of the background and fate of these antediluvial giants and their fathers, the Watchers (called grigori in the Slavonic 2 Enoch),  the sons of God or holy ones (Daniel 4:13, 17) who rebelled against heaven when—in violation of the strict \"boundaries of creation\"—they commingled, in their lust, with the \"daughters of men.\"\nTheir even more corrupt offspring, the giants, were variously called thereafter nephilim, gibborim, or rephaim, being the earthly half-breed races that fought against God and his righteous followers whose numbers diminished as the world was overwhelmed with corruption and evil; the Manichaean fragments give these wicked ones the general name demons (Greek Enoch calls them bastards). Though the terms for the Watchers and their offspring are often confused in their various translations and iterations, collectively these rebellious races are referred to as the fallen angels in the apocryphal sources, as also in the biblical narratives that reference them.\n\n\n== Origins in ancient tradition ==\nSince before the latter half of the twentieth century, The Book of Giants had long been known as a Middle Iranian work (which some scholars now believe was written originally in Eastern Aramaic) that circulated among the Manichaeans as a composition attributed to Mani (c. AD 216–274)—a Parthian citizen of southern Mesopotamia who appears to have been a follower of Elkesai, a Jewish-Christian prophet and visionary who lived in the early years of the second century. Some scholars, concordant with supporting evidence for the ancient sect's geographical distribution, have posited both genetic and ritual-custom similarities between the Elcesaites and the earlier Second Temple Jewish sect of the Essenes (Essaioi \"Saints\").\nDuring the twentieth century a number of finds shed considerable light on the literary evidence for The Book of Giants. The 1943 publication by W. B. Henning of the Manichaean fragments from The Book of Giants discovered at Turfan in Western China (in what is now Xinjiang Province) have substantiated the many references to its circulation among, and use by, the Manichaeans. Further identification of the Manichaeans edition of The Book of Giants was revealed in 1971 when Jósef T. Milik discovered several additional Aramaic fragments of Enochic works among the Dead Sea Scrolls; finding that the fragments bore close resemblance to Mani's The Book of Giants, he concluded that Giants was originally an integral part of 1 Enoch itself. These fragmentary scrolls in Aramaic, which represented an Enochic tradition that was likely introduced to Mani in his sojourn with the Elcesaites, appeared to have been the primary source utilized by Mani in the compilation of his book, in which he made the legend of the Watchers and the giants \"a cornerstone of his theological speculations.\" For many scholars, the Qumran fragments confirmed The Book of Giants to originally have been an independent composition from the Second Temple period.\nAmong the fragments disco",
  "fetched_at": "2026-02-09T02:50:56.928713"
}