{
  "url": "https://en.wikipedia.org/wiki/The_Hudsucker_Proxy",
  "title": "The Hudsucker Proxy",
  "text": "The Hudsucker Proxy is a 1994 screwball comedy film co-written, produced, and directed by Joel and Ethan Coen. Sam Raimi co-wrote the script and served as second unit director. The film stars Tim Robbins as a naïve but ambitious business school graduate who is installed as president of a manufacturing company, Jennifer Jason Leigh as a newspaper reporter, and Paul Newman as a company director who hires the graduate as part of a stock scam.\nThe script was finished in 1985, but production did not start until 1991, when Joel Silver acquired the script for Silver Pictures. Warner Bros. subsequently agreed to distribute the film, with further financing from PolyGram Filmed Entertainment and Working Title Films. Filming at Carolco Studios in Wilmington, North Carolina, lasted from November 1992 to March 1993. The New York City scale model set was designed by Michael J. McAlister and Mark Stetson, with further effects provided by The Computer Film Company.\nUpon its release in March 1994, The Hudsucker Proxy received mixed reviews from critics and bombed at the box office, but has since gained a cult following.\n\n\n== Plot ==\nIn December 1958, Norville Barnes, a business college graduate from Muncie, Indiana, arrives in New York City, looking for a job. He struggles due to lack of experience and becomes a mailroom clerk at Hudsucker Industries, a large corporation. Soon thereafter, the company's founder and president, Waring Hudsucker, unexpectedly commits suicide during a business meeting by jumping out of a top-floor window.\nAfterward, Sidney J. Mussburger, a ruthless member of the company's board of directors, knowing that Hudsucker Industries' bylaws call for Hudsucker's stock shares to be sold to the public, suggests a scheme to buy the controlling interest in the company by temporarily depressing the stock price by hiring a clearly incompetent president to run the business.\nIn the mailroom, Norville is assigned to deliver a \"Blue Letter\" to Mussburger. The letter is a top-secret communication from Hudsucker, sent shortly before his death. However, Norville does not deliver the letter; instead, he pitches Mussburger an invention of his (indicated with no other explanation than a simple drawing of a circle and his cryptic explanation, \"you know: for kids\"). Believing Norville to be an idiot, Mussburger selects him as a proxy for Hudsucker.\nAcross town, Amy Archer, a brassy Pulitzer Prize–winning reporter for the Manhattan Argus newspaper, is assigned to write a story about Norville and find out what kind of man he really is. She obtains a job at Hudsucker Industries as his personal secretary, pretending to be yet another desperate graduate from his alma mater in Muncie.\nOne night, Amy searches the building for clues and meets Moses, who operates the tower's giant clock and knows \"just about anything if it concerns Hudsucker\". He tells her Mussburger's plot, and she takes the story back to her Chief, but he does not believe it.\nThe other executives at Hudsucker Industries decide to produce Norville's invention in hopes that it will flop and further depress the company's stock. However, the invention is the hula-hoop, which initially fails in obscurity but then becomes an enormous success.\nNorville allows success to go to his head and becomes yet another uncaring tycoon. Amy, who had fallen for his naive charm, is infuriated over Norville's new attitude and leaves him. Buzz, the eager elevator operator, pitches a new invention: the bendy straw, which Buzz calls the \"Buzz-sucker.\" Norville insults the idea and cruelly fires Buzz, ignoring his pleas that he needs the job.\nMeanwhile, Aloysius, a Hudsucker janitor, discovers Amy's true identity and informs Mussburger. Mussburger reveals Amy's secret identity to Norville and tells him he will be dismissed as president after the new year. Mussburger also convinces the board that Norville is insane and must be sent to the local psychiatric hospital.\nOn New Year's Eve, Amy finds Norville drun",
  "fetched_at": "2026-02-09T02:44:53.911815"
}