{
  "url": "https://en.wikipedia.org/wiki/Nampa_figurine",
  "title": "Nampa figurine",
  "text": "The Nampa figurine (also known as the Nampa Image or the Nampa Doll) is a 1.5-inch (38 mm) fired clay doll found near Nampa, Idaho, in 1889. The figurine has been dyed red, possibly due to iron oxide deposition, and depicts a female figure with jewelry and clothing. The artifact has been the subject of substantial controversy over its apparent age. While scholarly consensus today holds that the doll is a hoax, initial estimates of the artifact placed its age at 2 million years old, significantly outdating any other clay artifacts and humanity's arrival in the Americas.\nWhile archeologists have debated whether the figurine was a hoax or not, the consensus is that the artifact is not 2 million years old. Archeologists George Frederick Wright, William Henry Holmes, and Keith Fitzpatrick-Matthews have argued that the object descended rapidly due to a geological phenomenon or was displaced by the drilling mechanism that originally uncovered the figurine. Wright, whilst being a strong proponent of the object's validity, estimated the age in terms of thousands of years. Wright's support of the Nampa figurine's genuineness has been heavily criticized as being religiously motivated. Daniel Garrison Brinton and John W. Powell argued the artifact was a 19th-century doll made by the Pocatello, with modern-day archeologists holding the belief the artifact was a hoax. Members of the Pocatello Native American tribe have also affirmed the figurine was a hoax. Due to the controversy surrounding the artifact's age, many conspiracy theories have arisen around the artifact's origin.\n\n\n== Description ==\nThe Nampa figurine is a small female figure made out of fired clay. The object is 1.5 inches (38 mm) in size and contains pieces of clay, quartz, and traces of iron oxide. The figure was found to be well worn with faint markings that may have represented clothing or jewelry around the chest and neck. The right leg of the figure was broken off.\nLater, a reproduction of the figurine was created by geologist Albert Allen Wright and chemist Frank Fanning Jewett, who concluded that the piece could not have been made by a novice craftsman. The scientists noted that the red coloration of the doll was possibly due to iron oxide deposition, and not the doll's original color. Both Wright and Jewett were able to replicate the color through the use of acid staining. The figurine has often been compared to the Venus of Tan-Tan.\n\n\n== History ==\nThe figurine was found in Nampa, Idaho in July 1889 by Mark A. Kurtz (1841–1906), a local businessman. Kurtz and his business partners were drilling for water, hitting a depth of 320 feet (98 m) while lining the bore hole as they went. Once the drill had penetrated through the basalt layer, approximately 60 feet (18 m) deep, the men transitioned to a pump mechanism to remove the quicksand and ceased drilling. Following this, the drill pump brought the figure to the surface whilst removing the sand layer at 261 to 301 feet (80 to 92 m) deep. Union Pacific Railroad president Charles Francis Adams Jr. alongside a team of archeologists were contacted to perform the initial dating of the artifact.\n\nOn September 8, Adams wrote to Wright:The day after the image was thrown up by the borer, Mr. Cumming, the general manager of the Union Pacific lines in that district, chanced to be in Boisé City, and saw it. Mr. Cumming is a graduate of Harvard College, and a thoroughly trained man. His evidence I should take as conclusive in regard to the facts.On November 6, Adams wrote from Boston to Professor Henry W. Haynes to endorse the character of George Miller Cumming. Adams had apparently forgotten that Cumming had been in Boise the next day and had not been \"on the spot the day the 'find' was made\":I should regard his evidence in this matter as entitled to as much consideration as the evidence of any scientific man would be. He was on the spot the day the 'find' was made, and his estimate of it would in my mind carry very great weight. ",
  "fetched_at": "2026-02-09T02:44:54.003766"
}