{
  "url": "https://en.wikipedia.org/wiki/Physical_attractiveness",
  "title": "Physical attractiveness",
  "text": "Physical attractiveness is the extent to which a person's physical features are considered aesthetically pleasing or beautiful. The term often implies sexual attractiveness or desirability but can also be distinct from them. Many factors influence one person's attraction to another, with physical aspects being one of them. Physical attraction  includes universal perceptions common across human cultures, such as facial symmetry, as well as socioculturally dependent attributes, and personal preferences unique to each individual.\nIn many cases, humans subconsciously attribute positive characteristics, such as intelligence and honesty, to physically attractive people, a psychological phenomenon called the halo effect. Research done in the United States and United Kingdom found that objective measures of physical attractiveness and intelligence are positively correlated, and that the association between the two attributes is stronger among men than among women. Evolutionary psychologists have tried to answer why individuals who are more physically attractive should also, on average, be more intelligent, and have put forward the notion that both general intelligence and physical attractiveness may be indicators of underlying genetic fitness. A person's physical characteristics can signal cues to fertility and health, with statistical modeling studies showing that the facial shape variables that reflect aspects of physiological health, including body fat and blood pressure, also influence observers' perceptions of health. Attending to these factors increases reproductive success, furthering the representation of one's genes in the population.\nHeterosexual men tend to be attracted to women who have a youthful appearance and exhibit features such as a symmetrical face, full breasts, full lips, and a low waist–hip ratio. Heterosexual women tend to be attracted to men who are taller than they are and who display a high degree of facial symmetry, masculine facial dimorphism, upper body strength, broad shoulders, a relatively narrow waist, and a V-shaped torso.\n\n\n== General contributing factors ==\nGenerally, physical attractiveness can be viewed from a number of perspectives; with universal perceptions being common to all human cultures, cultural and social aspects, and individual subjective preferences. The perception of attractiveness can have a significant effect on how people are judged in terms of employment or social opportunities, friendship, sexual behaviour, and marriage.\nSome physical features are attractive in both men and women, particularly bodily and facial symmetry, although one contrary report suggests that \"absolute flawlessness\" with perfect symmetry can be \"disturbing\". Symmetry may be evolutionarily beneficial as a sign of health because asymmetry \"signals past illness or injury\". One study suggested people were able to \"gauge beauty at a subliminal level\" by seeing only a glimpse of a picture for one-hundredth of a second. Other important factors include youthfulness, skin clarity and smoothness of skin, and \"vivid colour\" in the eyes and hair. However, there are numerous differences based on gender.\nA 1921 study of the reports of college students regarding those traits argued that static traits, such as beauty or ugliness of features, hold a position subordinate to groups of physical elements like expressive behaviour, affectionate disposition, grace of manner, aristocratic bearing, social accomplishments and personal habits.\nGrammer and colleagues have identified eight \"pillars\" of beauty: youthfulness, symmetry, averageness, sex-hormone markers, body odor, motion, skin complexion, and hair texture. Traditionally in Samoa, body fat was acceptable or attractive.\n\n\n=== Facial features ===\nAn Italian study published in 2008 analyzed the positions of the 50 soft-tissue landmarks of the faces of 324 white Northern Italian adolescent boys and girls to compare the features of a group of 93 \"beautiful\" individuals selected b",
  "fetched_at": "2026-02-09T02:51:32.539042"
}