{
  "url": "https://en.wikipedia.org/wiki/Image_of_God",
  "title": "Image of God",
  "text": "The \"image of God\" (Hebrew: צֶלֶם אֱלֹהִים, romanized: ṣelem ʾĔlōhīm; Greek: εἰκών τοῦ Θεοῦ, romanized: eikón toú Theoú; Latin: imago Dei) is a concept and theological doctrine in Judaism and Christianity. It is a foundational aspect of Judeo-Christian belief with regard to the fundamental understanding of human nature. It stems from the primary text in Genesis 1:27, which reads (in the Authorized / King James Version): \"So God created man in his own image, in the image of God created he him; male and female he created them.\" The exact meaning of the phrase has been debated for millennia.\nFollowing tradition, a number of Jewish scholars, such as Saadia Gaon and Philo, argued that being made in the image of God does not mean that God possesses human-like features, but rather the reverse: that the statement is figurative language for God bestowing special honour unto humankind, which he did not confer unto the rest of creation.\nThe history of the Christian interpretation of the image of God has included three common lines of understanding: a substantive view locates the image of God in shared characteristics between God and humanity such as rationality or morality; a relational understanding argues that the image is found in human relationships with God and each other; and a functional view interprets the image of God as a role or function whereby humans act on God’s behalf and serve to represent God in the created order. These three views are not strictly competitive and can each offer insight into how humankind resembles God. Furthermore, a fourth and earlier viewpoint involved the physical, corporeal form of God, held by both Christians and Jews.\nDoctrine associated with God's image provides important grounding for the development of human rights and the dignity of each human life regardless of class, race, gender, or disability, and it is also related to conversations about the human body's divinity and role in human life and salvation.\n\n\n== Biblical sources ==\n\n\n=== Hebrew Bible ===\nThe phrase \"image of God\" is found in three passages in the Hebrew Bible, all in the Book of Genesis 1–11:\n\nAnd God said: 'Let us make man in our image/b'tsalmeinu, after our likeness/kid'muteinu; and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.' And God created man in His image, in the image of God He created him, male and female created He them. And God blessed them; and God said to them: 'Be fruitful, and multiply, and fill the earth, and subdue it; and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that creepeth upon the earth.'\nThis is the book of the generations of Adam. In the day that God created man, in the likeness of God made He him. Male and female created He them, and blessed them, and called their name Adam, in the day when they were created. And Adam lived a hundred and thirty years, and begot a son in his own likeness, after his image; and called his name Seth.\nOne who spills the blood of man, through/by man, his blood will be spilled, for in God's image/tselem He made man.\n\n\n=== Apocrypha / Deuterocanonical books ===\nIn the Apocrypha or Deuterocanon, there are three passages that explicitly use \"image\" terminology to describe humanity.\n\nFor God created man to be immortal, and made him to be an image of his own eternity.\nThe Lord created man of the earth, and turned him into it again. He gave them few days, and a short time, and power also over the thing therein. He endued them with strength by themselves, and made them according to his image, And put the fear of man upon all flesh, and gave him dominion over beasts and fowls.\nBut people, who have been formed by your hands and are called your own image because they are made like you, and for whose sake you have formed all things – have you also made them like the farmer's seed?\n\n\n=== New Testa",
  "fetched_at": "2026-02-09T06:01:34.498626"
}