{
  "url": "https://en.wikipedia.org/wiki/Cultural_Marxism_conspiracy_theory",
  "title": "Cultural Marxism conspiracy theory",
  "text": "Cultural Marxism is a far-right antisemitic conspiracy theory that misrepresents Western Marxism (especially the Frankfurt School) as being responsible for modern progressive movements, identity politics, and political correctness. The conspiracy theory posits that there is an ongoing and intentional academic and intellectual effort to subvert Western society via a planned culture war that undermines the supposed Christian values of traditionalist conservatism and seeks to replace them with culturally progressive values.\nA revival of the Nazi propaganda term \"Cultural Bolshevism\", the contemporary version of the conspiracy theory originated in the United States during the 1990s. Originally found only on the far-right political fringe, the term began to enter mainstream discourse in the 2010s and is now found globally. The conspiracy theory of a Marxist culture war is promoted by right-wing politicians, fundamentalist religious leaders, political commentators in mainstream print and television media, and white supremacist terrorists, and has been described as \"a foundational element of the alt-right worldview\". Scholarly analysis of the conspiracy theory has concluded that it has no basis in fact.\n\n\n== Origins ==\nEuropean reactionaries, following their defeat in the culture wars of the 1960s against liberals and Marxists, split from the mainstream conservatism of the \"Old Right\", forming a loose intellectual grouping (the \"New Right\") that criticised the contemporaneous society and attempted to transform cultural norms and values. In the 21st century, The European New Right influenced the US alt-right to focus on nonviolent ways to delegitimize the liberal status quo. This included criticising the perceived decline of Western culture and the influence of pop culture, which they claimed was the result of a collusion between capitalism and what they called \"Cultural Marxism\".\n\n\n=== Michael Minnicino and the LaRouche Movement ===\nMichael Minnicino's 1992 essay New Dark Age: The Frankfurt School and 'Political Correctness'  has been described as a starting point for the contemporary conspiracy theory in the United States. Minnicino's interest in the subject derived from his involvement in the LaRouche movement. Lyndon LaRouche had begun developing conspiracy theories regarding the Frankfurt School in 1974, when he alleged that Herbert Marcuse and Angela Davis were acting as part of COINTELPRO. Other features of the conspiracy theory had developed across the 1970s and 80s in the movement's magazine, EIR, according to the researcher Andrew Woods.\nMinnicino's essay argued that late twentieth-century America had become a \"New Dark Age\" as a result of the abandonment of Judeo-Christian and Renaissance ideals, which he claimed had been replaced in modern art with a \"tyranny of ugliness\". He attributed this to an alleged plot to instill cultural pessimism in America, carried out in three stages by Georg Lukács, the Frankfurt School, and elite media figures and political campaigners.\nMinnicino asserted there were two aspects of the Frankfurt School plan to destroy Western culture. Firstly, a cultural critique, by Theodor Adorno and Walter Benjamin, to use art and culture to promote alienation and replace Christianity with socialism. This included the development of opinion polling and advertising techniques to brainwash the populace and control political campaigning. Secondly, the plan supposedly included attacks on the traditional family structure by Herbert Marcuse and Erich Fromm to promote women's rights, sexual liberation, and polymorphous perversity to subvert patriarchal authority. Minnicino claimed the Frankfurt School was responsible for elements of the counterculture of the 1960s and a \"psychedelic revolution\", distributing hallucinogenic drugs to encourage sexual perversion and promiscuity.\nAfter the 2011 terrorist attacks in Norway by Anders Breivik, a follower of the conspiracy theory, Minnicino repudiated his own essay. Minni",
  "fetched_at": "2026-02-09T06:08:11.896691"
}