{
  "url": "https://en.wikipedia.org/wiki/Book_of_Exodus",
  "title": "Book of Exodus",
  "text": "The Book of Exodus (from Ancient Greek: Ἔξοδος, romanized: Éxodos; Biblical Hebrew: שְׁמוֹת Šəmōṯ, 'Names'; Latin: Liber Exodus) is the second book of the Bible. \nThe book is the first part of the narrative of the Exodus, the origin myth of the Israelites, in which they leave slavery in biblical Egypt through the strength of God, who chose them as his people. The Israelites then journey with the prophet Moses to Mount Sinai, where God gives them the Law of Moses and enters into a covenant with them and their descendants. God promises to make them a \"holy nation, and a kingdom of priests\" on condition of their faithfulness. He gives them laws and instructions to build the Tabernacle, the means by which he will come from heaven and dwell with them and lead them in a holy war to conquer Canaan (the \"Promised Land\"), which had earlier, according to the Book of Genesis, been promised to the \"seed\" of Abraham, the patriarch of the Israelites.\nTraditionally ascribed to Moses himself, the formation of the Pentateuch, including the Book of Exodus, is dated to the fifth through fourth centuries BC. Modern scholars see its initial composition as a product of the Babylonian exile (6th century BCE), based on earlier written sources and oral traditions, with final revisions in the Persian post-exilic period (5th century BCE). American biblical scholar Carol Meyers, in her commentary on Exodus, suggests that it is arguably the most important book in the Bible, as it presents the defining features of Israel's identity—memories of a past marked by hardship and escape, a binding covenant with their God, who chooses Israel, and the establishment of the life of the community and the guidelines for sustaining it. \nThe consensus of modern scholars is that the Pentateuch does not give an accurate account of the origins of the Israelites, who appear instead to have formed as an entity in the central highlands of Canaan in the late second millennium BCE (around the time of the Late Bronze Age collapse) from the indigenous Canaanite culture.\n\n\n== Title ==\nThe English name Exodus comes from the Ancient Greek: ἔξοδος, romanized: éxodos, meaning 'departure' or 'going out' (from ἐξ-, ex-, 'out' and ὁδός, hodós, 'path', 'road'), which is the name of the book in the Septuagint. It describes the main event of the book, the departure of the Israelites from slavery in Egypt.\nConsistent with the naming convention for the Torah, in Hebrew the book's title is שְׁמוֹת, shemōt, \"Names\", from the beginning words of the text: \"These are the names of the sons of Israel\" (Hebrew: וְאֵלֶּה שְׁמֹות בְּנֵי יִשְׂרָאֵל).\n\n\n== Historicity ==\n\nMost mainstream scholars do not accept the biblical Exodus account as historical for a number of reasons. It is generally agreed that the Exodus stories were written centuries after the apparent setting of the stories. Archaeologists Israel Finkelstein and Neil Asher Silberman argue that archaeology has not found evidence for even a small band of wandering Israelites living in the Sinai: \"The conclusion – that Exodus did not happen at the time and in the manner described in the Bible – seems irrefutable [...] repeated excavations and surveys throughout the entire area have not provided even the slightest evidence\". Instead, they argue how modern archaeology suggests continuity between Canaanite and Israelite settlements, indicating a heavily Canaanite origin for Israel, with little suggestion that a group of foreigners from Egypt comprised early Israel. They also argue that the exodus narrative perhaps evolved from vague memories of the Hyksos expulsion, spun to encourage resistance to the 7th century domination of Judah by Egypt.\nHowever, a majority of scholars also believe that the story has a historical core, despite disagreeing widely about what that historical kernel might have been. Kenton Sparks refers to it as \"charter myth\" and \"mythologized history\". Biblical scholar Graham I. Davies notes that several literary texts from Ancie",
  "fetched_at": "2026-02-09T05:56:04.663927"
}