{
  "url": "https://en.wikipedia.org/wiki/Spirit_(comics_character)",
  "title": "Spirit (comics character)",
  "text": "The Spirit is a fictional masked crimefighter appearing in American comic books. Created by cartoonist Will Eisner, he first appeared as the main feature of a tabloid-sized comic book insert distributed in the Sunday edition of Register and Tribune Syndicate newspapers. Popularly referred to as \"The Spirit Section\", the insert ran from June 2, 1940 to October 5, 1952.\nThe Spirit is the alias of Denny Colt, a private investigator and criminologist based in the fictional Central City, who falls into suspended animation while trying to apprehend the mad scientist Dr. Cobra. Officially pronounced dead, Colt revives after being interred in Wildwood Cemetery. With the blessing of his old friend, police Commissioner Eustace Dolan, Colt becomes a domino mask-wearing \"friendly outlaw\" who pursues criminals that might otherwise escape capture by traditional law enforcement. The Spirit usually does not possess any superpowers, but relies on his wits and physical prowess, as well as the myth of his supposed resurrection, in his battles against evildoers. He frequently encounters femme fatales over the course of his adventures, including serial seducer P'Gell, thief-turned-troubleshooter Silk Satin, and his estranged childhood friend Sand Saref; he also comes into conflict with his archenemy the Octopus, an unseen criminal mastermind. Other supporting characters include Ellen Dolan, Commissioner Dolan's headstrong daughter and the Spirit's primary love interest, and his recurring sidekick Ebony White, a young, diminutive cab driver.\n\"The Spirit Section\" was commissioned by Quality Comics publisher Everett M. \"Busy\" Arnold as a means of helping the Register and Tribune compete with the burgeoning comic book industry; Eisner, with the assistance of several ghost writers and artists, used The Spirit to reach a more mature readership compared to other comic books of the time. Although predominantly a mix of crime drama, noir and mystery, the series defied reader expectations by wildly experimenting with genre and tone, including horror, slapstick comedy, romance, fantasy, metafiction and science fiction. In some stories, the role of the Spirit himself amounts to only a cameo appearance, with Paul Gravett noting that the character would often take a \"back seat to the small dramas of losers, dreamers and ordinary joes\", and that the series as a whole was, \"as much as anything, about the human spirit\". At the peak of its popularity, \"The Spirit Section\" was included in 20 American newspapers, with a total circulation of five million copies.\nFrom the 1960s to the 1980s, Eisner wrote and drew a handful of new Spirit stories, which appeared in Harvey Comics and elsewhere. Warren Publishing and Kitchen Sink Press variously reprinted the newspaper feature in black-and-white comics magazines and color comic books; DC Comics reprinted the entirety of Eisner's run in a 26-volume color collection known as The Spirit Archives. From the 1990s to the 2010s, Kitchen Sink Press, DC Comics and Dynamite Entertainment also published new Spirit stories by other writers and artists.\nWidely regarded as Eisner's most famous creation, The Spirit has been credited with influencing the later underground comix movement and such filmmakers as William Friedkin and Brad Bird. In 2011, IGN ranked the Spirit as 21st in the Top 100 Comic Book Heroes of all time. In other media, the character was portrayed by Sam J. Jones in a 1987 television film and by Gabriel Macht in a 2008 film adaptation written and directed by Frank Miller.\n\n\n== Publication history ==\nIn late 1939, Everett M. \"Busy\" Arnold, publisher of the Quality Comics comic-book line, began exploring an expansion into newspaper Sunday supplements, aware that many newspapers felt they had to compete with the suddenly burgeoning new medium of American comic books, as exemplified by the Chicago Tribune Comic Book, premiering two months before \"The Spirit Section\". Arnold compiled a presentation piece with existing Quali",
  "fetched_at": "2026-02-09T06:06:34.935296"
}