{
  "url": "https://en.wikipedia.org/wiki/Child_abuse",
  "title": "Child abuse",
  "text": "Child abuse (also called child endangerment or child maltreatment) is physical, sexual, emotional and/or psychological maltreatment or neglect of a child, especially by a parent or a caregiver. Child abuse may include any act or failure to act by a parent or a caregiver that results in actual or potential wrongful harm to a child and can occur in a child's home, or in organizations, schools, or communities the child interacts with.\nDifferent jurisdictions have different requirements for mandatory reporting and have developed different definitions of what constitutes child abuse, and therefore have different criteria to remove children from their families or to prosecute a criminal charge.\n\n\n== History ==\nAs late as the 19th century, cruelty to children perpetrated by employers and teachers was commonplace and widespread, and corporal punishment was customary in many countries, but in the first half of the 19th century, pathologists studying filicide (the parental killing of children) reported cases of death from paternal rage, recurrent physical maltreatment, starvation, and sexual abuse. In an 1860 paper, French forensic medical expert Auguste Ambroise Tardieu compiled a series of 32 such cases, 18 of which were fatal, of the children dying from starvation and/or recurrent physical abuse. It included the case of Adeline Defert, who was returned by her grandparents at the age of 8, and for 9 years tortured by her parents – whipped every day, hung up by her thumbs and beaten with a nailed plank, burnt with hot coals and her wounds bathed in nitric acid, and deflorated with a baton. Tardieu made home visits and observed the effect on the children; he noticed that the sadness and fear on their faces disappeared when they were placed under protection. He commented, \"When we consider the tender age of these poor defenceless beings, subjected daily and almost hourly to savage atrocities, unimaginable tortures and harsh privation, their lives one long martyrdom – and when we face the fact that their tormentors are the very mothers who gave them life, we are confronted with one of the most appalling problems that can disturb the soul of a moralist, or the conscience of justice\". His observations were echoed by Boileau de Castélnau (who introduced the term misopédie – hatred of children), and confirmed by Aubry and several theses.\nThese early French observations failed to cross the language barrier, and other nations remained ignorant of the cause of many traumatic lesions in infants and toddlers; almost one hundred years would pass before humankind began to systematically confront Tardieu's \"appalling problem\". In the 20th century, evidence began to accumulate from pathology and paediatric radiology, particularly in relation to chronic subdural haematoma and limb fractures: subdural haematoma had a curious bimodal distribution, idiopathic in infants and traumatic in adults, while unexplained ossifying periostitis of the long bones was similar to that occurring after breech extractions. In 1946, John Caffey, the American founder of paediatric radiology, drew attention to the association of long bone fractures and chronic subdural haematoma, and, in 1955, it was noticed that infants removed from the care of aggressive, immature and emotionally ill parents developed no new lesions.\nAs a result, professional inquiry into the topic began again in the 1960s. The July 1962 publication of the paper \"The Battered Child-Syndrome\" authored principally by pediatrician C. Henry Kempe and published in The Journal of the American Medical Association represents the moment that child maltreatment entered mainstream awareness. Before the article's publication, injuries to children—even repeated bone fractures—were not commonly recognized as the results of intentional trauma. Instead, physicians often looked for undiagnosed bone diseases or accepted parents' accounts of accidental mishaps such as falls or assaults by neighborhood bullies.\nThe study of c",
  "fetched_at": "2026-02-09T05:58:13.459408"
}