{
  "url": "https://en.wikipedia.org/wiki/Reincarnation",
  "title": "Reincarnation",
  "text": "Reincarnation, also known as rebirth or transmigration, is the philosophical or religious concept that nonmaterial essence of a living being begins a new lifespan in a different physical form or body after biological death. In most beliefs involving reincarnation, the soul of a human being is immortal and does not disperse after the physical body has perished. Upon death, the soul merely transmigrates into a newborn baby or into an animal to continue its immortality. (The term \"transmigration\" means the passing of a soul from one body to another after death.)\nReincarnation (punarjanman) is a central tenet of Indian religions such as Hinduism, Buddhism, Jainism, and Sikhism. In various forms, it occurs as an esoteric belief in many streams of Judaism, in certain pagan religions (including Wicca), and in some beliefs of the Indigenous peoples of the Americas and of Aboriginal Australians (though most believe in an afterlife or spirit world). Some ancient Greek historical figures, such as Pythagoras, Socrates, and Plato, expressed belief in the soul's rebirth or migration (metempsychosis).\nAlthough the majority of denominations within the Abrahamic religions do not believe that individuals reincarnate, particular groups within these religions do refer to reincarnation; these groups include mainstream historical and contemporary followers of Catharism, Alawites, Hasidic Judaism, the Druze, Kabbalistics, Rastafarians, and the Rosicrucians. Recent scholarly research has explored the historical relations between different sects and their beliefs about reincarnation. This research includes the views of Neoplatonism, Orphism, Hermeticism, Manichaenism, and the Gnosticism of the Roman era, as well as those in Indian religions. In recent decades, many Europeans and North Americans have developed an interest in reincarnation, and contemporary works sometimes mention the topic.\n\n\n== Conceptual definitions ==\nThe word reincarnation derives from a Latin term that literally means 'entering the flesh again'. Reincarnation refers to the belief that an aspect of every human being (or all living beings in some cultures) continues to exist after death. This aspect may be the soul, mind, consciousness, or something transcendent which is reborn in an interconnected cycle of existence; the transmigration belief varies by culture, and is envisioned to be in the form of a newly born human being, animal, plant, spirit, or as a being in some other non-human realm of existence.\nAn alternative term is transmigration, implying migration from one life (body) to another. The term has been used by modern philosophers such as Kurt Gödel and has entered the English language.\nThe Greek equivalent to reincarnation, metempsychosis (μετεμψύχωσις), derives from meta ('change') and empsykhoun ('to put a soul into'), a term attributed to Pythagoras. Another Greek term sometimes used synonymously is palingenesis, 'being born again'.\nRebirth is a key concept found in major Indian religions, and discussed using various terms. Punarjanman (Sanskrit: पुनर्जन्मन्, 'rebirth, transmigration'), is discussed in the ancient Sanskrit texts of Hinduism, Buddhism, and Jainism, with many alternate terms such as punarāvṛtti (पुनरावृत्ति), punarājāti (पुनराजाति), punarjīvātu (पुनर्जीवातु), punarbhava (पुनर्भव), āgati-gati (आगति-गति, common in Buddhist Pali text), nibbattin (निब्बत्तिन्), upapatti (उपपत्ति), and uppajjana (उप्पज्जन). These religions believe that reincarnation is cyclic and an endless Saṃsāra, unless one gains spiritual insights that ends this cycle leading to liberation. The reincarnation concept is considered in Indian religions as a step that starts each \"cycle of aimless drifting, wandering or mundane existence\", but one that is an opportunity to seek spiritual liberation through ethical living and a variety of meditative, yogic (marga), or other spiritual practices. They consider the release from the cycle of reincarnations as the ultimate spiritual goal, and call t",
  "fetched_at": "2026-02-09T06:01:08.527163"
}