{
  "url": "https://en.wikipedia.org/wiki/Angels_(Neon_Genesis_Evangelion)",
  "title": "Angels (Neon Genesis Evangelion)",
  "text": "The Angels (使徒, shito; lit. 'apostles') are fictional entities from the anime television series Neon Genesis Evangelion, which was produced by Gainax studio and directed by Hideaki Anno. The Angels also appear in the manga adaptation of the same name, which was illustrated by Yoshiyuki Sadamoto.\nIn the original animated work, almost all of the Angels are antagonists of mankind who repeatedly try to reach the headquarters of the special agency Nerv in the city of Tokyo-3. Most of the Angels originate from an entity called Adam, but the eighteenth specimen, humanity, is descended from Lilith, the second Angel. To counter the Angels' invasion, Nerv builds the Evangelions, mechas that possess a force field called an AT Field, which the Angels also use to defend themselves.\nThe Angels appear in works from the animated series, in spin-off manga, video games, visual novels, in the yonkoma manga Petit Eva: Evangelion@School, and the Rebuild of Evangelion film tetralogy. The names of the Angels past Adam and Lilith, which are revealed in the fourteenth and twenty-third episodes of the series, refer to the namesake angels of non-canonical Judeo-Christian tradition. The characteristics and functions of each Angel are deliberately similar to those of their namesakes in ancient sacred texts. Their designs have been praised by critics and animation enthusiasts, and influenced subsequent animated series.\n\n\n== Conception ==\nDuring the making of Neon Genesis Evangelion, the production staff decided to set the work on a battle between gods and humans. In one early draft, which was published about two years before airing, Gainax included enemies named Apostolos (アポストロ, aposutoro), which they conceived as ancient relics scattered all over the globe and left in hibernation by a species called \"First Ancestral Race\" (第1始祖民族, dai'ichi shiso minzoku). These enemies were referred to as simple weapons with almost no biological component. According to Gualtiero Cannarsi, the editor who was in charge of the first Italian-language edition of the series, the Gainax studio members might have been inspired by James P. Hogan's Giants series, Arthur C. Clarke's short story \"The Sentinel\" and its film adaptation 2001: A Space Odyssey. The Apostolos would have been the servants and apostles of the giant Adam, the divine sentinel of a distant alien race formed long before humanity, drawing on Hogan's evolutionary and science fiction themes. Anno also drew inspirations from classic carnivorous kaiju such as Gyaos from the Gamera franchise and Gaira from the 1966 film The War of the Gargantuas.\nThe original authors intended there to have been twenty-eight enemies, the first of which, Adam, would have been found in the Dead Sea region but destroyed in an explosion fifteen years before the events of the series. The initial scenario also included the introduction of two Apostolos named Shateiel (シャテイエル, Shateieru), which was described as the \"Angel of silence\" and Turel (テゥレル, Tureru), \"the rock of God\". Writer Virginie Nebbia compared Turel design with the Emperor Neo mask from Nadia: The Secret of Blue Water. The project was shelved during the production, but the ideas were recycled for the Angels Ramiel and Sahaquiel. The first episode would have featured a confrontation between Eva-01, piloted by Rei, and a \"metal Angel\" named Raziel which would have had anthropomorphic features similar to those of a giant. In the twenty-fourth episode, titled \"Now, the Promised Time\" (今、契約時間, ima, keiyaku jikan), there would be a great lunar battle against twelve Apostolos; humans would realize their helplessness in the face of their enemies' overwhelming superiority and \"the promised time\" would approach. For their number, the authors took inspiration from the twelve apostles of the Lamb that are mentioned in the book of Revelation, but the idea of multiple clashes on the Moon was abandoned, eventually being recycled for the battle against the nine Mass Production Model Evangeli",
  "fetched_at": "2026-02-09T06:15:14.743606"
}