{
  "url": "https://en.wikipedia.org/wiki/Inodoro_Pereyra",
  "title": "Inodoro Pereyra",
  "text": "Inodoro Pereyra (The Renegade) is an Argentine comic created in 1972 by the writer and cartoonist Roberto Fontanarrosa. The main character is a cartoon of a lonely Argentine gaucho living in the Argentine Pampas. Full of social, psychological, political and philosophical humor, it parodies to comical effect the language and mannerisms of the gaucho, such as the name \"Inodoro\" a mock-typical gaucho name (taken from the Catholic santoral) like \"Isidoro\", \"Casimiro\" etc., but \"Inodoro\" meaning actually in Spanish \"toilet seat\".\n\n\n== Publication history ==\nThe comic appeared for first time at the end of 1972 in the popular humor magazine Hortensia, originating from the Córdoba Province (Argentina), which was the home of a pool of talented people at that time.\nThe comic was originally a parody about the linguistics and stereotypes of the native people. Specifically, the main characters were some gaucho characters from comic books (such as Santos Leiva, Lindor Covas \"the wild\", El Huinca or Fabián Leyes, etc). The comic at this time was more elaborate graphically. In all these early editions, Inodoro hosts a diverse and weird group of visitors in the Pampa region of Argentina, while his inseparable friend, Mendieta, the talking dog, shares the adventures of his owner. Mendieta frequently shares his opinions with Inodoro, giving birth to phrases like: \"Let us negotiate, Mr. Inodoro\" and \"Who gave birth to it!\" (similar meaning to \"Wow!\", or \"Who would have thought so...\").\nThen the comic appeared in the Mengano and Siete Días magazines, with adventures in each episode. Mendieta once declared that he was in reality \"a Christian man that was turned into a dog shape due to a moon eclipse\". Mendieta occupied the co-protagonist role in these times.\nThe episodes of Inodoro Pereyra in this period mostly consisted of two or three pages. Each series was composed of around 10 episodes.\nAt the beginning of each episode the author gives a short recap of what happened in the previous episode. The recap was in a humoristic style, using radio theater language, gauchesca poetry and feuilleton language in an ironic way. Finally, in 1976, Inodoro settled down with his partner, Eulogia Tapia, and Mendieta in a famous newspaper from Buenos Aires called Clarín, where the comic was published in single editions. The previous coverage of adventures gave way to a greater focus on dialogue and subtle humor.\nThe drawing style suffered a major change after 1975. From 1972 until 1975 the characters were drawn with a slim shape with thick lines and striking contrasts. From 1976 Inodoro Pereyra appeared with a drawing style that gave him a soft expression (rather than the angry wrinkles of the past), while his partner \"La Eulogia\" is no longer a young stylized woman but a rotund and clumsy housewife.\nAfter being placed in different areas of the newspaper, the comic was added to Viva, the Sunday magazine of Clarín. Here Inodoro was a more tranquil personality, settled in his humble house with his wife, dog, pigsty and a lonely tree. The Inodoro Pereyra comics were also published in book format by Ediciones de la Flor.\nThe main difference with other comics is that in Inodoro comics, the humoristic touch is not present exclusively at the end of the comic but usually in every frame (mainly since the comic started to be published as single editions).\nMost of the middle jokes and the ending ones are delivered by Mendieta, acting as the voice of reason in this comic of absurd and erratic humor. Also the humoristic touch of this comic in mainly based in the language used by Inodoro Pereyra, who uses a lot of word games and rhymes.\n\n\n== Characters ==\n\n\n=== Inodoro Pereyra ===\nHe is a parody of Pampa's stereotypical Argentine gaucho, based on Martín Fierro, a famous gaucho. He meditates in loneliness about life, accompanied by his dog Mendieta, and receives strangers in his home, to whom he gives peculiar advice. The humor of the comic is largely based around Inodoro's lang",
  "fetched_at": "2026-02-09T05:19:33.473979"
}