{
  "url": "https://en.wikipedia.org/wiki/Mont_Pelerin_Society",
  "title": "Mont Pelerin Society",
  "text": "The Mont Pelerin Society (MPS), founded in 1947, is an international academic society of economists, political philosophers, and other intellectuals who share a classical liberal outlook. It is headquartered at Texas Tech University in Lubbock, Texas, United States. The society advocates freedom of expression, free market economic policies, and an open society. Further, the society seeks to discover ways in which the private sector can replace many functions currently provided by government entities.\n\n\n== History ==\n\nThe MPS was established on April 10, 1947, at a conference organized by Friedrich Hayek at the base of Mont Pèlerin on Lake Geneva. The conferees met as the International Trade Organization (ITO) charter was being drafted at the opposite end of the lake in Geneva, Switzerland.\nThe MPS was originally to be named the Acton-Tocqueville Society. Frank Knight protested against naming the group after two \"Roman Catholic aristocrats,\" and Ludwig von Mises expressed concern that the mistakes made by Acton and Tocqueville would be connected with the society.\nIn its \"Statement of Aims\" on April 8, 1947, the scholars were worried about the dangers faced by civilization, stating:\n\nOver large stretches of the Earth's surface the essential conditions of human dignity and freedom have already disappeared. In others they are under constant menace from the development of current tendencies of policy.  The position of the individual and the voluntary group are progressively undermined by extensions of arbitrary power. Even that most precious possession of Western Man, freedom of thought and expression, is threatened by the spread of creeds which, claiming the privilege of tolerance when in the position of a minority, seek only to establish a position of power in which they can suppress and obliterate all views but their own.\nThe group also stated that it is \"difficult to imagine a society in which freedom may be effectively preserved\" without the \"diffused power and initiative\" associated with \"private property and the competitive market\" and found it desirable inter alia to study the following matters:\n\nThe analysis and exploration of the nature of the present crisis so as to bring home to others its essential moral and economic origins.\nThe redefinition of the functions of the state so as to distinguish more clearly between the totalitarian and the liberal order.\nMethods of re-establishing the rule of law and of assuring its development in such manner that individuals and groups are not in a position to encroach upon the freedom of others and private rights are not allowed to become a basis of predatory power.\nThe possibility of establishing minimum standards by means not inimical to initiative and functioning of the market.\nMethods of combating the misuse of history for the furtherance of creeds hostile to liberty.\nThe problem of the creation of an international order conducive to the safeguarding of peace and liberty and permitting the establishment of harmonious international economic relations.\nThe group \"seeks to establish no meticulous and hampering orthodoxy\", \"conduct propaganda\" or align with some party. It aims to facilitate \"the exchange of views [...] to contribute to the preservation and improvement of the free society.\"\nNotably absent are the range of human and political rights traditionally embraced by liberals (including the right to form coalitions and freedom of the press).\nIn 1947, 39 scholars, mostly economists with some historians and philosophers, were invited by Friedrich Hayek to meet to discuss the state and possible fate of classical liberalism, his goal being an organization which would resist interventionism and promote his conception of classical liberalism. The first meeting took place in the Hotel du Parc in the Swiss village of Mont Pèlerin, near the city of Vevey, Switzerland.\nFunding for the conference came from the William Volker Fund thanks to Harold Luhnow, the Bank of England owing to the hel",
  "fetched_at": "2026-02-09T06:17:19.211397"
}