{
  "url": "https://en.wikipedia.org/wiki/Hackensack,_New_Jersey",
  "title": "Hackensack, New Jersey",
  "text": "Hackensack is the most populous municipality in and the county seat of Bergen County, in the U.S. state of New Jersey. The area was officially named New Barbadoes Township until 1921, but has informally been known as Hackensack since at least the 18th century. As of the 2020 United States census, the city's population was 46,030, its highest decennial count ever and an increase of 3,020 (+7.0%) from the 2010 census count of 43,010, which in turn reflected an increase of 333 (+0.8%) from the 42,677 counted in the 2000 census.\nAn inner suburb of New York City, Hackensack is located approximately 12 miles (19 km) northwest of Midtown Manhattan and about 7 miles (11 km) from the George Washington Bridge. From a number of locations, including portions of Prospect Avenue, the New York City skyline can be seen.\nThe Metropolitan Campus of Fairleigh Dickinson University straddles the Hackensack River in both Hackensack and Teaneck. Hackensack is also the home of the former New Jersey Naval Museum and the World War II submarine USS Ling. Astronaut Wally Schirra is perhaps Hackensack's most famous native son.\nThe city has diverse neighborhoods and land uses located close to one another. Within its borders are the Hackensack University Medical Center, a residential high-rise district about a mile long (along Prospect Avenue between Beech Street and Passaic Street), suburban neighborhoods of single-family houses, stately older homes on acre-plus lots, older two-family neighborhoods, large garden apartment complexes, industrial areas, the Bergen County Jail, a tidal river, Hackensack River County Park, Borg's Woods Nature Preserve, various city parks, large office buildings, a major college campus, the Bergen County Court House, a vibrant small-city downtown district, and various small neighborhood business districts.\n\n\n== History ==\n\nThe earliest known inhabitants of the area were the Lenni Lenape, an Algonquian people who became known to settlers as 'the Delaware Indians.' They lived along a river they called Achinigeu-hach, or \"Ackingsah-sack\", which translates to stony ground—today this river is more commonly known by the name 'the Hackensack River.' A representation of Chief Oratam of the Achkinhenhcky appears on the Hackensack municipal seal. The most common explanation is that the city was named for the Native American tribe, though other sources attribute it to a Native American word variously translated as meaning \"hook mouth\", \"stream that unites with another on low ground\", \"on low ground\" or \"land of the big snake\", while another version described as \"more colorful than probable\" attributes the name to an inn called the \"Hock and Sack\".\nSettlement by the Dutch West India Company in New Netherland on the west banks of the Hudson River across from New Amsterdam (present-day lower Manhattan) began in the 1630s at Pavonia, eventually leading to the establishment of Bergen (at today's Bergen Square in Jersey City) in 1660.\nOratam, sachem of the Lenni Lenape, deeded the land along mid-Hackensack River to the Dutch in 1665. The area was soon taken by the English in 1667, but kept its Dutch name. Philip Cartaret, governor of what became the proprietary colony of East Jersey granted land to Captain John Berry in the area of Achter Kol and soon after took up residence and called it \"New Barbadoes,\" after having resided on the island of Barbados. In 1666, a deed was confirmed for the 2,260-acre (9.1 km2) tract that had been given earlier by Oratem to Sarah Kiersted in gratitude for her work as emissary and interpreter. Other grants were given at the English Neighborhood.\nIn 1675, the East Jersey Legislature established the administrative districts Bergen, Essex, Middlesex, and Monmouth. In 1683, Bergen (along with the three other counties) was officially recognized as an independent county by the Provincial Assembly. The seal of Bergen County bearing this date includes an image of an agreement between the European settlers and the Native A",
  "fetched_at": "2026-02-09T05:54:27.865623"
}