{
  "url": "https://en.wikipedia.org/wiki/Karl-Theodor_zu_Guttenberg",
  "title": "Karl-Theodor zu Guttenberg",
  "text": "Karl-Theodor Maria Nikolaus Johann Jacob Philipp Franz Joseph Sylvester Buhl-Freiherr von und zu Guttenberg (born 5 December 1971), known professionally as Karl-Theodor zu Guttenberg, is a German businessman, author, journalist, podcaster, and former politician of the Christian Social Union (CSU). He served as a member of the Bundestag from 2002 to 2011, as Secretary-General of the CSU from 2008 to 2009, as Federal Minister for Economics and Technology in 2009 and as Federal Minister of Defence from 2009 to 2011.\nAfter the discovery of extensive plagiarism in his doctoral dissertation and the decision of the University of Bayreuth to revoke his doctorate, an affair known as the Guttenberg plagiarism scandal, he resigned from all political posts in March 2011.\nIn 2011, Guttenberg joined the Center for Strategic and International Studies (CSIS). Guttenberg is the chairman and a founder of Spitzberg Partners, an advisory and investment firm based in New York City.\n\n\n== Education ==\nIn 1991, after finishing high school (Gymnasium) in Rosenheim, Guttenberg completed his mandatory military service reaching the rank of Sergeant. Guttenberg studied law at the University of Bayreuth, where he passed the first legal state examination (said to be the equivalent of a master's degree) in 1999. Guttenberg chose not to pursue the second state examination (the equivalent of a bar exam), and focused on running the Munich-based \"Guttenberg GmbH\" holding where, along with a few employees, he managed his family's significant assets and various participations. Due to the holding's low revenue and small number of employees, it was said that Guttenberg had exaggerated his business experience. The Guttenberg GmbH had assets under management of at least a quarter billion euros, including a 26.5 percent stake in Rhön-Klinikum AG, which was sold in March 2002 to Bayerische Hypo- und Vereinsbank for 260 million euros. From 1996 to 2002, Guttenberg was a member of the board of directors of Rhön-Klinikum AG. Until September 2004, he was a managing director of the KT-Kapitalverwaltung GbR in Munich. \nGuttenberg studied law at the University of Bayreuth. He successfully defended his dissertation Verfassung und Verfassungsvertrag. Konstitutionelle Entwicklungsstufen in den USA und der EU (lit. 'Constitution and Constitutional Treaty. Stages of Constitutional Development in the USA and EU'), and was awarded the academic degree Doctor of Law (Doktor der Rechte) in 2007. Following accusations of plagiarism in Guttenberg's dissertation, the University of Bayreuth conducted an investigation, culminating on 23 February 2011 with the revocation of Guttenberg's doctorate.\nIn 2019, Guttenberg was awarded a Doctor of Philosophy degree from the University of Southampton.\n\n\n== Political career ==\n\nGuttenberg is a member of the Christian Social Union of Bavaria (CSU) and held different positions within the party, including that of secretary general.\n\n\n=== Member of Parliament ===\nIn 2002, Guttenberg was elected to the Bundestag as the representative of Kulmbach. He was reelected in 2005, winning 60.0% of the votes in his constituency. In 2009, he was reelected again with 68.1% of the votes in his district, obtaining the highest percentage of votes of all elected representatives in Germany for that election cycle.\nFrom October 2005 to November 2008, Guttenberg served as chairman of the CDU/CSU parliamentary group in the Bundestag's Foreign Affairs Committee and as spokesman of the CDU/CSU parliamentary group in the Bundestag's Committee on disarmament, non-proliferation and arms control. He also chaired the CSU Foreign Policy Expert Committee and the German-British parliamentary group during that time.\n\n\n==== Political positions ====\nIn early 2004, Guttenberg introduced the concept of a Privileged Partnership between Turkey and the European Union as a viable alternative to accession of Turkey to the European Union into the German political discourse. Guttenberg based his o",
  "fetched_at": "2026-02-09T05:21:01.898254"
}