{
  "url": "https://en.wikipedia.org/wiki/Messiah_ben_Joseph",
  "title": "Messiah ben Joseph",
  "text": "In Jewish eschatology Messiah ben Joseph or Mashiach ben Yoseph (Hebrew: מָשִׁיחַ בֶּן־יוֹסֵף Māšīaḥ ben Yōsēf), also known as Mashiach bar/ben Ephraim (Aram./Heb.: מָשִׁיחַ בַּר/בֶּן אֶפְרַיִם‎ Māšīaḥ bar/ben Efrayīm), is a name for a Jewish messiah, believed to be from the tribe of Ephraim and a descendant of Joseph. The figure's origins are much debated. Some regard it as a rabbinic invention, but others defend the view that its origins are in the Torah.\n\n\n== Messianic tradition ==\nJewish tradition alludes to four messianic figures, called the Four Craftsmen, from a vision found in the Book of Zechariah. The four craftsmen are discussed in the Babylonian Talmud. Hana bar Bizna, attributed to Simeon the Just, identifies these four craftsmen as Messiah ben David, Messiah ben Joseph, Elijah, and the Righteous Priest. Each will be involved in ushering in the Messianic age.\nRashi's commentary on the Talmud gives more details. He explains that Messiah ben Joseph is called a craftsman because he will help rebuild the temple. Nahmanides also commented on Messiah ben Joseph's rebuilding of the temple. The roles of the Four Craftsmen are as follows. Elijah will be the herald of the eschaton. If necessary, Messiah ben Joseph will wage war against the evil forces and die in combat with the enemies of God and Israel.\nAccording to Saadia Gaon the need for his appearance will depend on the spiritual condition of the Jewish people.\nIn the Apocalypse of Zerubbabel and later writings, after his death a period of great calamities will befall Israel. God will then resurrect the dead and usher in the messianic age of universal peace. Messiah ben David will reign as a king during the period when God will resurrect the dead. With the ascendancy of Rabbinic Judaism, the Righteous Priest has largely not been the subject of Jewish messianic speculation.\n\n\n== Sources in chronological order ==\n\n\n=== The Dead Sea Scrolls ===\nWhile the Dead Sea Scrolls do not explicitly refer to a Messiah ben Joseph, a plethora of messianic figures are displayed.\n\nThe poly-messianic Testimonia text 4Q175 presents a prophet like Moses, a messianic figure and a priestly teacher. The Text contains four testimonia. The fourth testimonium is about Joshua and is generally viewed as non-messianic. However Alan Avery-Peck suggests that given its placement the text concerning Joshua should be read as referencing a war messiah from Ephraim. It is dated to the early 1st century BCE.\n4Q372 (c. 200 BCE) features a suffering, 'Joseph' king-figure, who having sinned in setting up a competing Temple to that in Jerusalem, cries out to God in his death-throes as 'My father', citing the Psalms 89 and 22, and predicts that he will arise again to do justice and righteousness.\n1QS lists a Messiah of Israel, a prophet and a priestly Messiah of Aaron. 1QS dates from around 100 BCE.\n\n\n=== Gabriel's Revelation ===\nGabriel's Revelation is a stone tablet with its text written in ink. Although the inscription is in a poor state of preservation, the meaning of the legible text is still a matter of scholarship.\nThe text seems to talk about a messianic figure from Ephraim who will break evil before righteousness by three days. Later the text talks about a \"prince of princes\" a leader of Israel who is killed by the evil king and not properly buried. The evil king is then miraculously defeated. The text seems to refer to Jeremiah Chapter 31. The choice of Ephraim as the lineage of the messianic figure described in the text seems to draw on passages in Jeremiah, Zechariah and Hosea. However, Matthias Henze suggests that this figure is not a reference to the Messiah ben Joseph who he believes is a later development but rather a pseudonym for the Messiah ben David and that Ephraim is simple a metonym in reference to Israel; Israel Knohl disagrees.\nThe text seems to be based on a Jewish revolt recorded by Josephus dating from 4 BCE. Both Josephus and Gabriel's Revelation describe three messianic leaders. Ba",
  "fetched_at": "2026-02-09T05:47:01.062079"
}