{
  "url": "https://en.wikipedia.org/wiki/Prophet",
  "title": "Prophet",
  "text": "In religion, a prophet or prophetess is an individual who is regarded as being in contact with a divine being and is said to speak on behalf of that being, serving as an intermediary with humanity by delivering messages or teachings from the supernatural source to other people. The message that the prophet conveys is called a prophecy.\nProphethood has existed in many cultures and religions throughout history, including Mesopotamian religion, Zoroastrianism, Judaism, Christianity, Manichaeism, Islam, the Baháʼí Faith, and Thelema.\n\n\n== Etymology ==\nThe English word prophet is the transliteration of a compound Greek word derived from pro (before/toward) and phesein (to tell); thus, a προφήτης (prophḗtēs) is someone who conveys messages from the divine to humans, including occasionally foretelling future events. In a different interpretation, it means advocate or speaker.  It is used to translate the Hebrew word נָבִיא (nāvî) in the Septuagint and the Arabic word نبي (nabī). W.F. Albright points to the Akkadian Nabu for the origin of these Hebrew (נָבִיא (nāvî) and the Arabic نبي (nabī) words.\nThe Akkadian nabû means \"announcer\" or \"authorised person\", derived from the Semitic root n-b-y or nbʾ. It is cognate with Classical Syriac: ܢܒܝܐ, romanized: nəḇiyyā, Arabic: نبي, romanized: nabiyy, and Hebrew: נביא, romanized: nāḇī, all meaning 'prophet'.\nIn Hebrew, the word נָבִיא (nāvî), \"spokesperson\", traditionally translates as \"prophet\". The second subdivision of the Tanakh, Nevi'im, is devoted to the Hebrew prophets. The meaning of navi is perhaps described in Deuteronomy 18:18, where God said, \"...and I will put My words in his mouth, and he shall speak unto them all that I shall command him.\" Thus, a navi was thought to be the \"mouth\" of God. A Jewish tradition was that the root nun-bet-alef (\"navi\") is based on the two-letter root nun-bet which denotes hollowness or openness; to receive transcendental wisdom, one must make oneself \"open\".\n\n\n== Mesopotamian origins ==\n\nBefore the advent of Zoroastrianism and the prophetic tradition established by Zoroaster, various ancient civilizations had individuals who served as intermediaries between humanity and the divine. In ancient Sumer, for instance, figures such as the \"ensi\" or \"lugal\" fulfilled roles akin to prophets, offering guidance and interpreting divine will through rituals, omens, and prayers.  The ensi was considered a representative of the city-state's patron deity. The functions of a lugal would include certain ceremonial and cultic activities, arbitration in border disputes, and military defence against external enemies. The ensis of Lagash would sometimes refer to the city's patron deity, Ningirsu, as their lugal (\"master\"). All of the above is connected to the possibly priestly or sacral character of the titles ensi and especially en (the latter term continuing to designate priests in subsequent times).\nThese prophets, while lacking the systematic theological framework found in later traditions, laid the groundwork for the concept of prophethood by demonstrating a connection with the divine and providing spiritual leadership within their communities. Despite the absence of codified scripture or organized religious institutions, these pre-Zoroastrian prophetic figures played a crucial role in shaping early religious thought and practices, paving the way for the structured prophetic tradition that emerged with Zoroaster and subsequent religious traditions.\n\n\n== Zoroastrianism ==\n\nZoroastrianism holds a significant position in shaping the concept of prophets and prophecy. Founded by the revered figure Zoroaster (or Zarathustra) in ancient Persia around the 6th century BCE, Zoroastrianism introduced fundamental ideas that profoundly influenced subsequent religious and philosophical traditions, particularly in its portrayal of prophetic figures.\nAt the heart of Zoroastrian belief lies the concept of a singular supreme deity, Ahura Mazda, engaged in an eternal struggle against",
  "fetched_at": "2026-02-09T06:14:50.900806"
}