{
  "url": "https://en.wikipedia.org/wiki/Great_Replacement_conspiracy_theory",
  "title": "Great Replacement conspiracy theory",
  "text": "The Great Replacement (French: grand remplacement), also known as replacement theory or great replacement theory, is a debunked white nationalist far-right conspiracy theory coined by French author Renaud Camus. Camus's theory states that, with the complicity or cooperation of \"replacist\" elites, the ethnic French and white European populations are deliberately being replaced by non-white peoples—especially from Muslim-majority countries—through mass migration, demographic growth and a drop in the birth rate of white Europeans. Since then, similar claims have been advanced in other national contexts, notably in the United States. A consensus of academic scholars have dismissed these claims of a conspiracy of \"replacist\" elites as rooted in a misunderstanding of demographic statistics and premised upon an unscientific, racist worldview.\nWhile similar themes have characterized various far-right theories since the late 19th century, the particular term was popularized by Camus in his 2011 book Le Grand Remplacement. The book associates the presence of Muslims in France with danger and destruction of French culture and civilization. Camus and other conspiracy theorists attribute recent demographic changes in Europe to intentional policies advanced by global and liberal elites (the \"replacists\") from within the Government of France, the European Union, or the United Nations; they describe it as a \"genocide by substitution\".\nThe conspiracy theory found support in Europe, and has also grown popular among anti-migrant and white nationalist movements from other parts of the West; many of their adherents maintain that \"immigrants [are] flocking to predominantly white countries for the precise purpose of rendering the white population a minority within their own land or even causing the extinction of the native population\". It aligns with (and is a part of) the larger white genocide conspiracy theory except in the substitution of antisemitic tropes with Islamophobia. This substitution, along with a use of simple catch-all slogans, has been cited as one of the reasons for its broader appeal in a pan-European context, although the concept remains rooted in antisemitism in many white nationalist movements, especially (but not exclusively) in the United States.\nAlthough Camus has publicly condemned white nationalist violence, scholars have argued that calls to violence are implicit in his depiction of non-white migrants as an existential threat to white populations. Several far-right terrorists, including the perpetrators of the 2019 Christchurch mosque shootings, the 2019 El Paso shooting, the 2022 Buffalo shooting and the 2023 Jacksonville shooting, have made reference to the \"Great Replacement\" conspiracy theory. American conservative media personalities, including Tucker Carlson and Laura Ingraham, have espoused ideas of a replacement.\n\n\n== Background ==\nRenaud Camus developed his conspiracy theory in two books published in 2010 and 2011, in the context of an increase in anti-immigrant rhetoric in public discourse during the previous decade. Europe also experienced an escalation in Islamic terrorist attacks during the 2000s–2010s, and a migrant crisis in the years 2015–2016, which exacerbated tensions and prepared public opinion for the reception of Camus's conspiracy theory. As the latter depicts a population replacement said to occur in a short time lapse of one or two generations, the migrant crisis was particularly conducive to the spread of Camus's ideas while the terrorist attacks accelerated the construction of immigrants as an existential threat among those who shared such a worldview.\nCamus's theme of a future demise of European culture and civilization also parallels a \"cultural pessimistic\" and anti-Islam trend among European intellectuals of the period, illustrated in several best-selling and straightforwardly titled books released during the 2010s: Thilo Sarrazin's Germany Abolishes Itself (2010), Éric Zemmour's The French S",
  "fetched_at": "2026-02-09T05:37:16.477405"
}