{
  "url": "https://en.wikipedia.org/wiki/Ophanim",
  "title": "Ophanim",
  "text": "The ophanim (Hebrew: אוֹפַנִּים ʼōp̄annīm, 'wheels'; singular: אוֹפָן ʼōp̄ān), alternatively spelled auphanim or ofanim, and also called galgalim (Hebrew: גַּלְגַּלִּים galgallīm, 'spheres, wheels, whirlwinds'; singular: גַּלְגַּל galgal), refer to the wheels seen in Ezekiel's vision of the chariot (Hebrew merkabah) in Ezekiel 1:15–21. One of the Dead Sea Scrolls (4Q405) construes them as angels; late sections of the Book of Enoch (61:10, 71:7) portray them as a class of celestial beings who (along with the Cherubim and Seraphim) never sleep, but guard the throne of God. In some systems of Christian angelology, they are one of the choirs (classes) of angels, and are also identified as Thrones.\nThese \"wheels\" have been associated with Daniel 7:9 (mentioned as galgal, traditionally \"the wheels of galgallin\", in \"fiery flame\" and \"burning fire\") of the four, eye-covered wheels (each composed of two nested wheels), that move next to the winged Cherubim, beneath the throne of God. The four wheels move with the Cherubim because the spirit of the Cherubim is in them. The late Second Book of Enoch (20:1, 21:1) also referred to them as the \"many-eyed ones\".\nThe First Book of Enoch (71.7) seems to imply that the Ophanim are equated to the \"Thrones\" in Christianity when it lists them all together, in order: \"...round about were Seraphim, Cherubim, and Ophanim\".\n\n\n== Function ==\n\nIt is said that they were the actual wheels of the Lord's Heavenly Chariot (Merkabah).\n\"The four wheels had rims and they had spokes, and their rims were full of eyes round about.\"\nThey are also frequently referred to as \"many-eyed ones\".\n\n\n== Ophanim in specific spiritual traditions ==\n\n\n=== Ophanim in Judaism ===\nMaimonides lists Ophanim as the second to closest of angels to God in his exposition of the Jewish angelic hierarchy.\n\n\n==== In prayer ====\nThe kedusha section in the morning prayer (in the blessings preceding the recitation of the Shema) includes the phrase, \"The ophanim and the holy living creatures with great uproar raise themselves up; facing the seraphim they offer praise, saying, 'Blessed be God's glory from His place.\" The inspiration behind this particular passage is Ezekiel's vision (ch. i.). The theme of angels praising God was inserted into the passage by paytanim (Jewish liturgical poets).\nOphanim are mentioned in the El Adon prayer, often sung by the congregation, as part of the traditional Shabbat morning service.\nIn the Jewish angelic hierarchy thrones and wheels are different. This is also true in the Kabbalistic angelic hierarchy.\n\n\n=== Thrones in the Orthodox Church ===\n\nDe Coelesti Hierarchia refers to the Thrones from the Old Testament description as the third Order of the first sphere, the other two superior orders being the Cherubim and Seraphim.\n\nThe name of the most glorious and exalted Thrones denotes that which is exempt from and untainted by any base and earthly thing, and the super mundane ascent up the steep. For these have no part in that which is lowest, but dwell in fullest power, immovably and perfectly established in the Most High, and receive the Divine Immanence above all passion and matter, and manifest God, being attentively open to divine participations.\nThis view was also accepted by the Catholic Church and by Thomas Aquinas.\n\n\n=== Lord of the Flame in the Western Wisdom Teachings ===\nThe Rosicrucian Cosmo-Conception refers that the \"Lord of the Flame\", the Hierarchy of Elohim astrologically assigned to Leo, are the Thrones (from the Old Testament description, \"because of the brilliant luminosity of their bodies and their great spiritual powers.\"); the other two superior hierarchies being also the Cherubim and Seraphim. According to this conception, the heavenly Seraphim and Cherubim as well as the Ophanim continue to aid humans in spiritual evolution; as do the heavenly Archangels and Angels.\n\n\n=== Connection to machine elves ===\nSeveral users of dimethyltryptamine (DMT) have reported encountering similar beings",
  "fetched_at": "2026-02-09T06:06:55.961429"
}