{
  "url": "https://en.wikipedia.org/wiki/Vecna",
  "title": "Vecna",
  "text": "Vecna ( VEK-nah) is a fictional character appearing in the Dungeons & Dragons fantasy role-playing game. Vecna has been named one of the greatest villains in the Dungeons & Dragons franchise.\nOriginally appearing in the Greyhawk campaign setting, Vecna was described as a powerful wizard who became a lich. He was eventually destroyed, and his left hand and left eye were the only parts of his body to survive. Even after the character achieved godhood—being a member of the third edition's default pantheon of D&D gods (the pantheon of Oerth)—he is still described as missing both his left eye and left hand. Vecna's holy symbol is an eye in the palm of a left hand.\nVecna's \"right-hand man\", who ultimately became his betrayer, is Kas the Bloody-Handed, a vampire whose sword, the Sword of Kas, is also an artifact.\n\n\n== Publication history ==\n\n\n=== Original Dungeons & Dragons ===\nIn Eldritch Wizardry (1976), the third supplement to the original Dungeons & Dragons rules, Brian Blume invented two artifacts he called the Hand and Eye of Vecna. These were supposedly the only remnants of an evil lich, Vecna, who had been destroyed long ago. \"The book contains no more detail on Vecna other than the fact that Kas was his bodyguard\". The name Vecna was an anagram of Vance, the surname of Jack Vance, the fantasy author whose works inspired the magic system used in Dungeons & Dragons. The Hand and Eye of Vecna on the other hand were inspired by similar items that appear in the Eternal Champion series by Michael Moorcock (the Hand of Kwll and the Eye of Rhynn).\nOn the artifacts, Gary Gygax later said, \"nary a detail of those items did [Blume] ever reveal to me\".\n\n\n=== 1st edition ===\nThe Hand and Eye of Vecna were then mentioned in the first edition Dungeon Master's Guide (1979) on page 124. During the Advanced Dungeons & Dragons years, Vecna was regarded only as a legend or myth, a long-destroyed legendary lich of great power, only able to threaten player characters who dared to use his Hand and Eye.\n\n\n=== 2nd edition ===\nTen years later, in Advanced Dungeons & Dragons 2nd edition's Dungeon Master's Guide (1989), Vecna's history was expanded under the description of his Hand. With the release of the adventure Vecna Lives! in 1990, written in support of The City of Greyhawk boxed set, Vecna finally appeared in person, reimagined as a demigod, and the chief antagonist of the adventure. At the end of the adventure—presuming the players defeat Vecna—he is transported to the Ravenloft campaign setting. Vecna's history, via his artifacts, was also further developed in the supplemental sourcebook Book of Artifacts (1993). After the publication of Vecna Lives! (1990), \"Vecna disappeared throughout the rest of the '90s, until Domains of Dread (1997)\" which confirmed his new location in the realm of Ravenloft. However, it wasn't until 1998 that there was a Ravenloft-centered follow-through, Vecna Reborn.\nIn 2000, Wizards of the Coast released the last adventure to be written for the 2nd edition ruleset, Die Vecna Die!, a three-part adventure tying Greyhawk to the Ravenloft and Planescape campaign settings. In this adventure, Vecna was given the rank of a lesser god. Die Vecna Die! set up the transition between the second and third editions of D&D. According to Shannon Appelcline, the adventure \"touched upon the oldest locales and the most ancient myths of the D&D game\" by involving the Eye and Hand of Vecna and using them to oppose Iuz the cambion demigod.\n\n\n=== 3rd and 3.5 edition ===\nWizards of the Coast continued the character's theme of ascending godhood in Dungeons & Dragons Third Edition (2000–2002) with the Player's Handbook (2000) listing him as a Lesser deity. Third Edition further raised Vecna's profile in the game, making him a member of the game's \"core pantheon\". Vecna's alignment was changed from Lawful Evil to Neutral Evil in Third Edition, and no in-game explanation has surfaced. Vecna's role in the 3rd edition Greyhawk setting was defined",
  "fetched_at": "2026-02-09T05:45:12.586724"
}