{
  "url": "https://en.wikipedia.org/wiki/Tigrinya_verbs",
  "title": "Tigrinya verbs",
  "text": "Unless otherwise indicated, Tigrinya verbs in this article are given in the usual citation form, the third person singular masculine perfect.\n\n\n== Roots ==\nA Tigrinya verb root consists of a set of consonants (or \"literals\"), usually three, for example, {sbr} 'break' (citation form: ሰበረ säbärä), {drf} 'sing' (citation form: ደረፈ däräfä).\nEach three-consonant (or \"triliteral\") root belongs to one of three conjugation classes, conventionally known as A, B, and C, and analogous to the three conjugations of verbs in Romance languages.  This division is a basic feature of Ethiopian Semitic languages.\nMost three-consonant roots are in the A class (referred to in this article as \"3A\").  In the citation form (perfect), these have no gemination and the vowel ä between both pairs of consonants.  Examples are ሰበረ säbärä and ደረፈ däräfä.  The B class (referred to in this article as \"3B\") is distinguished by the gemination of the second consonant in all forms.  Examples are ደቀሰ däk'k'äsä 'sleep' and ወሰኸ wässäxä 'add'.\nThe relatively few members of the C class (referred to in this article as \"3C\") take the vowel a between the first and second consonants.  Examples are ባረኸ baräxä 'bless' and ናፈቐ nafäx'ä 'long for, miss'.\nTigrinya also has a significant number of four-consonant (or \"quadriliteral\") roots (referred to in this article as \"4\").\nThese fall into a single conjugation class.\nExamples are መስከረ mäskärä 'testify' and ቀልጠፈ k'ält'äfä 'hurry'.\nThe language also has five-consonant (or \"quinquiliteral\") roots (referred to in this article as \"5\").  Most, if not all, of these are \"defective\" in the sense described below; that is, their simplest form takes the tä- prefix.  Examples are ተንቀጥቀጠ tä-nk'ät'k'ät'ä 'tremble' and ተምበርከኸ tä-mbärkäxä 'kneel'.\nAs is common in Semitic languages, roots containing \"laryngeal\" (that is, pharyngeal or glottal) consonants in any position or semivowels (y or w) in any but first position undergo various modifications.  These are dealt with below under Conjugation.\n\n\n== Derivation ==\nEach verb root can be modified through one or more basic derivational processes.  Each can be described in terms of its form and its function.\n\n\n=== Form ===\nChanges to the root form are of two types: prefixes and internal changes.\nThe prefixes are tä- and ’a- or their combination.  When the prefix tä- follows ’a-, it loses its vowel and assimilates to the following consonant (that is, the first root consonant).  Without ’a- its realization depends on the tense/aspect/mood of the verb.\nInternal changes are of two types.  One is a form of reduplication.  This produces an extra syllable, consisting of a copy of the second consonant from the end of the root followed by the vowel a; this syllable appears third from the end of the verb stem.  A second type of internal change inserts the vowel a, or replaces the existing vowel with a, following the third consonant from the end of the stem.  For three-consonant roots, this results in a pattern similar to that of C class verbs.\nThe table below shows the possible combinations of prefixes and internal changes and their functions, illustrating each with the verb {sbr} (3A).\n\n\n=== Function ===\nFor the most part, the two derivational prefixes signal grammatical voice; that is, they govern how the participants in the sentence map onto the roles in the event conveyed by the verb.  With neither prefix, the verb is normally in ACTIVE voice; the subject is the agent of the event.  By itself, the prefix tä- usually signals PASSIVE voice or REFLEXIVE voice.  Some participant which is not the subject of the active sentence, the patient or recipient, becomes the subject; or the subject is both the agent and the patient or recipient of the event.  By itself, the prefix ’a- usually signals CAUSATIVE voice; the subject of the sentence is then a causer of the event who is not the immediate agent.\nReduplication with neither of the prefixes signals FREQUENTATIVE, the repetition of the event conveyed by the verb. ",
  "fetched_at": "2026-02-09T06:18:48.699507"
}