{
  "url": "https://en.wikipedia.org/wiki/Personal_identity",
  "title": "Personal identity",
  "text": "Personal identity is the unique identity of a person over time. Discussions regarding personal identity typically aim to determine the necessary and sufficient conditions under which a person at one time and a person at another time can be said to be the same person, persisting through time.\nIn philosophy, the problem of personal identity is concerned with how one is able to identify a single person over a time interval, dealing with such questions as, \"What makes it true that a person at one time is the same thing as a person at another time?\" or \"What kinds of things are we persons?\"\nIn contemporary metaphysics, the matter of personal identity is referred to as the diachronic problem of personal identity. The synchronic problem concerns the question of what features and traits characterize a person at a given time. Analytic philosophy and continental philosophy both inquire about the nature of identity. Continental philosophy deals with conceptually maintaining identity when confronted by different philosophic propositions, postulates, and presuppositions about the world and its nature.\n\n\n== Continuity of substance ==\n\n\n=== Bodily substance ===\n\nOne way to explain how persons persist over time is to say that identity consists in physical or bodily continuity.  However, there are problems with this view. As the Ship of Theseus thought experiment illustrates, even for inanimate objects there are difficulties in determining whether one physical body at one time is the same thing as a physical body at another time. With humans, over time our bodies age and grow, losing and gaining matter, and over sufficient years will not consist of most of the matter they once consisted of. It is thus problematic to ground the persistence of personal identity over time in the continuous existence of our bodies. Nevertheless, this approach has its supporters, who define humans as biological organisms. They assert the proposition that a psychological relation is not necessary for personal continuity. This personal identity ontology assumes the relational theory of life-sustaining processes instead of bodily continuity.\nThe teletransportation problem proposed by Derek Parfit is designed to bring out intuitions about corporeal continuity. The thought experiment discusses cases in which a person is teleported from Earth to Mars. Ultimately, the inability to specify where on a spectrum the transmitted person stops being identical to the initial person on Earth appears to show that having a numerically identical physical body is not the criterion for personal identity.\nChristian List has argued against physicalist conceptions of consciousness and personal identity on the basis of how first-personal facts relate to third-personal facts. He argues that first-personal facts cannot supervene on third-personal facts, and that this refutes not only physicalism, but also most forms of dualism with purely third-personal metaphysics. List also argues that there exists a \"quadrilemma\" for theories of consciousness. He claims that at most three of the following metaphysical claims can be true: 'first-person realism', 'non-solipsism', 'non-fragmentation', and 'one world' – and thus at least one of these four must be false. List has proposed a model he calls the \"many-worlds theory of consciousness\" in order to reconcile the subjective nature of consciousness without lapsing into solipsism.\n\n\n=== Mental substance ===\n\nIn another concept of mind, the set of cognitive faculties are considered to consist of an immaterial substance, separate from and independent of the body. If a person is then identified with their mind, rather than their body—if a person is considered to be their mind—and their mind is such a non-physical substance, then personal identity over time may be grounded in the persistence of this non-physical substance, despite the continuous change in the substance of the body it is associated with.\nThe mind-body problem concerns the explanation of the ",
  "fetched_at": "2026-02-09T06:12:27.807603"
}