{
  "url": "https://en.wikipedia.org/wiki/Rijeka",
  "title": "Rijeka",
  "text": "Rijeka is the principal seaport and the third-largest city in Croatia. It is located in Primorje-Gorski Kotar County on Kvarner Bay, an inlet of the Adriatic Sea and in 2021 had a population of 107,964 inhabitants. Historically, because of its strategic position and its excellent deep-water port, the city was fiercely contested, especially between the Holy Roman Empire, the Republic of Venice, the Kingdom of Italy and Yugoslavia, changing rulers and demographics many times over centuries. According to the 2021 census data, 85% of its citizens are Croats, along with small numbers of Serbs, Bosniaks and Italians.\nRijeka is the main city and county seat of the Primorje-Gorski Kotar County. The city's economy largely depends on shipbuilding (shipyards 3. Maj and Viktor Lenac Shipyard) and maritime transport. Rijeka hosts the Croatian National Theatre Ivan pl. Zajc, first built in 1765, as well as the University of Rijeka.\nIn 2016, Rijeka was selected as the European Capital of Culture for 2020, alongside Galway, Ireland.\n\n\n== Name ==\nHistorically, Rijeka was called Tharsatica, Vitopolis (lit. 'City of [Saint] Vitus'), or Flumen (lit. 'River') in Latin. The city is called Rijeka in Croatian, Reka in Slovene, and Reka or Rika in the local dialects of Chakavian. It is called Fiume in Italian and in Fiuman Venetian. All these names mean 'river' in their respective languages. Meanwhile, in German the city has been called Sankt Veit am Flaum/Pflaum (lit. 'St. Vitus on the Flaum/Pflaum', with the name of the river being derived from Latin flumen).\nToday, the name Fiume is not used for official purposes for legal reasons. Beginning in 2018 there was an attempt on the initiative of the city's Italian community to install a number of signs, including a route confirmation sign, featuring both names on the west entrance to the city among other places, but as of 2021 no such signs have been installed due to technical difficulties.\n\n\n== Geography ==\n\nRijeka is located in western Croatia, 131 kilometres (81 miles) south-west of the capital, Zagreb, on the coast of Kvarner Gulf, in the northern part of the Adriatic Sea. Geographically, Rijeka is roughly equidistant from Milan (485 km [301 mi]), Budapest (502 km [312 mi]), Munich (516 km [321 mi]), Vienna (516 km [321 mi]) and Belgrade (550 km [340 mi]). Other major regional centers such as Trieste (76 km [47 mi]), Venice (240 km [150 mi]) and Ljubljana (115 km [71 mi]) are all relatively close and easily accessible. The Bay of Rijeka, which is bordered by Vela Vrata (between Istria and the island of Cres), Srednja Vrata (between Cres and Krk Island) and Mala Vrata (between Krk and the mainland) is connected to the Kvarner Gulf and is deep enough (about fifty metres or 160 feet) to accommodate large commercial ships. \nThe City of Rijeka lies at the mouth of the river Rječina and in the Vinodol micro-region of the Croatian coast. From three sides Rijeka is surrounded by mountains. To the west, the 1,396-metre (4,580 ft) Učka range is prominent. To the north/north-east are the Snežnik plateau and the 1,528 m (5,013 ft) Risnjak massif with its national park. To the east/south-east is the 1,533-metre (5,030 ft) Velika Kapela range. This type of terrain configuration prevented Rijeka from developing further inland (to the north) and the city mostly lies on a long and relatively narrow strip along the coast. Two important inland transport routes start in Rijeka. The first route runs north-east to the Pannonian Basin. This route takes advantage of Rijeka's location close to the point where the Dinaric Alps are the narrowest (about fifty kilometres or 31 miles) and easiest to traverse, making it the optimal route from the Hungarian plain to the sea. It also makes Rijeka the natural harbour for the Pannonian Basin (especially Hungary). The other route runs north-west across the Postojna Gate connecting Rijeka with Slovenia and further through the Ljubljana Gap with Austria and beyond. A third more coastal ",
  "fetched_at": "2026-02-09T05:55:37.368144"
}