{
  "url": "https://en.wikipedia.org/wiki/Book_of_Moses",
  "title": "Book of Moses",
  "text": "The Book of Moses, dictated by Joseph Smith, is part of the scriptural canon for some denominations in the Latter Day Saint movement. The book begins with the \"Visions of Moses\", a prologue to the story of the creation and the fall of man (Moses chapter 1), and continues with material corresponding to the Joseph Smith Translation of the Bible's (JST) first six chapters of the Book of Genesis (Moses 2–5, 8), interrupted by two chapters of \"extracts from the prophecy of Enoch\" (Moses chapters 6–7).\nThe Book of Moses begins with Moses speaking with God \"face to face\" and seeing a vision of all existence. Moses is initially overwhelmed by the immensity of the cosmos and humanity's smallness in comparison, but God then explains that he made the earth and heavens to bring humans to eternal life. The book subsequently provides an enlarged account of the Genesis creation narrative, which describes God having a corporeal body, followed by a rendering of the fall of Adam and Eve in celebratory terms that emphasizes eating the forbidden fruit as part of a process of gaining knowledge and becoming more like God. The Book of Moses also expands the story of Enoch, described in the Hebrew Bible as being an ancestor of Noah. In the expanded narrative, Enoch has a theophany in which he discovers that God is capable of sorrow, and that human sin and suffering cause him to grieve. Enoch then receives a prophetic calling, and he eventually builds a city of Zion so righteous that it is taken to heaven. Enoch's example inspired Smith's own hopes to establish the nascent Church of Christ as a Zion-esque community. The book also elaborates on passages that—in the view of Christians—foreshadowed the coming of Jesus, leading to explicit Christian doctrine of and faith in Jesus as a savior figure—effectively Christianizing the Hebrew Bible (Old Testament).\nPortions of the Book of Moses were originally published separately by the Church of Jesus Christ of Latter-day Saints (LDS Church) in 1851, but later combined and published as the Book of Moses in the Pearl of Great Price, one of the four books of its canon. The same material is published by the Community of Christ as parts of its Doctrine and Covenants and Inspired Version of the Bible.\n\n\n== Origin ==\n\nIn June 1830, Joseph Smith began a new translation of the Bible into English that was intended to restore \"many important points touching the salvation of men, [that] had been taken from the Bible, or lost before it was compiled.\" The chapters that now make up the Book of Moses were first published in the church newspapers Evening and Morning Star and Times and Seasons in the 1830s and 1840s.\n\n\n=== Publication by the Church of Jesus Christ of Latter-day Saints ===\n\nThe Book of Moses is considered part of the Standard Works, which constitute the scriptural canon of the Church of Jesus Christ of Latter-day Saints (LDS Church). The eight chapters of the Book of Moses were included as a separate book within the Pearl of Great Price through a series of events subsequent to Smith's death. Franklin D. Richards, who published the first edition of the Pearl of Great Price in 1851, only had access to the early versions of the JST found in church newspapers along with another incomplete handwritten part of JST Genesis, not the original manuscripts. For this reason the Book of Moses ended abruptly in the middle of the story of Noah. Richards published everything he had at the time, and what is now the Book of Moses was later added by Orson Pratt in the 1878 edition of the Pearl of Great Price. The Pearl of Great Price, including the Book of Moses, was officially canonized by the LDS Church in 1880.\n\n\n=== Publication by the Community of Christ ===\n\nThe Community of Christ, formerly known as the Reorganized Church of Jesus Christ of Latter Day Saints (RLDS Church), began publishing portions of the Book of Moses in its canonical Doctrine and Covenants (D&C) in 1864. Section 22 of the D&C contains Moses chapter 1, and",
  "fetched_at": "2026-02-09T06:20:27.217970"
}