{
  "url": "https://en.wikipedia.org/wiki/Moto_Hagio",
  "title": "Moto Hagio",
  "text": "Moto Hagio (萩尾 望都, Hagio Moto; born May 12, 1949) is a Japanese manga artist. Regarded for her contributions to shōjo manga (manga aimed at young and adolescent women), Hagio is considered the most significant artist in the demographic and among the most influential manga artists of all time, being referred to as the \"god of shōjo manga\" (少女漫画の神様, shōjo manga no kami-sama) by critics.\nHagio made her debut as a manga artist in 1969 at the publishing company Kodansha before moving to Shogakukan in 1971, where she was able to publish her more radical and unconventional works that had been rejected by other publishers. Her first serializations at Shogakukan – the vampire fantasy The Poe Clan, the shōnen-ai (male–male romance) drama The Heart of Thomas, and the science fiction thriller They Were Eleven – were among the first works of shōjo manga to achieve mainstream critical and commercial success. Hagio subsequently emerged as a central figure in the Year 24 Group, a grouping of female manga artists who significantly influenced shōjo manga in the 1970s by introducing new aesthetic styles and expanding the category to incorporate new genres. Since the 1980s, Hagio has drawn primarily adult-oriented manga in the manga magazine Petit Flower and its successor publication Flowers, notably Marginal, A Cruel God Reigns, and Nanohana.\nWhile Hagio primarily authors works in the science fiction, fantasy, and shōnen-ai genres, her manga explores a wide range of themes and subjects, including comedy, historical drama, and social and environmental issues. She has been recognized with numerous awards both in Japan and internationally, including the Order of the Rising Sun, a Medal of Honor, and commendation as a Person of Cultural Merit.\n\n\n== Biography ==\n\n\n=== Early life and career ===\nMoto Hagio was born on May 12, 1949, in Ōmuta, Fukuoka. The second of four siblings, Hagio's father worked as dockworker, while her mother was a homemaker. Because of her father's job, the Hagio family moved frequently between Omuta and Suita in Osaka Prefecture. Hagio began to draw at an early age in her spare time, and attended private art lessons with her older sister. In her third year of elementary school, she began reading manga that she acquired at kashi-hon (book rental stores) and her school library. Her parents discouraged her interest in illustration and manga, which Hagio states they viewed as \"something for children not old enough to read\" and \"an impediment to studying\"; this would be a major contributing factor to what would become a lifelong strained relationship with her parents.\nDuring her childhood, Hagio read and became influenced by the works of manga artists Osamu Tezuka, Shōtarō Ishinomori, Hideko Mizuno, and Masako Watanabe, as well as literary fiction by Japanese authors such as Kenji Miyazawa and western science fiction and fantasy authors such as Isaac Asimov, Arthur C. Clarke, and Robert A. Heinlein. She began to seriously consider a professional career in manga after reading Tezuka's manga series Shinsengumi in 1965, and in 1967 began submitting manga manuscripts to various publishers, including Kodansha, Shueisha, and Tezuka's own manga magazine COM.\nIn her senior year of high school Hagio met manga artist Makiko Hirata, who also lived in Ōmuta and was pursuing a professional career at Kodansha while still in high school. After graduating, Hirata moved to Tokyo and offered to introduce Hagio to her editor, which Hagio accepted. Hagio made her professional debut as a manga artist in Kodansha's Nakayoshi manga magazine, with the short stories Lulu to Mimi in August 1969 and Suteki na Mahō in September 1969. Hagio began working for Nakayoshi under a new editor, but struggled under the editorial constraints of the magazine: Nakayoshi published primarily sports manga for children, while Hagio preferred to write science fiction and fantasy stories focused on mature themes and subject material. Her next four manuscripts submitted to Nakay",
  "fetched_at": "2026-02-09T05:55:31.747140"
}