{
  "url": "https://en.wikipedia.org/wiki/Lawrence_Schiffman",
  "title": "Lawrence Schiffman",
  "text": "Lawrence Harvey Schiffman (born 1948) is a professor at New York University (as of 2014); he  was formerly Vice-Provost of Undergraduate Education at Yeshiva University and Professor of Jewish Studies (from early 2011 to 2014). He had previously been Chair of New York University's Skirball Department of Hebrew and Judaic Studies and served as the Ethel and Irvin A. Edelman Professor in Hebrew and Judaic Studies at New York University (NYU). He is currently the Judge Abraham Lieberman Professor of Hebrew and Judaic Studies at New York University and Director of the Global Institute for Advanced Research in Jewish Studies. He is a specialist in the Dead Sea Scrolls, Judaism in Late Antiquity, the history of Jewish law, and Talmudic literature.\n\n\n== Education ==\nSchiffman was a graduate of Great Neck North High School. He received his BA, MA, and PhD degrees from the Department of Near Eastern and Judaic Studies at Brandeis University. His senior thesis was devoted to the use of Psalms in the Qumran Hodayot. His PhD thesis eventually became his first book, The Halakhah at Qumran.\n\n\n== Memberships ==\n\nSchiffman is a member of the University's Center for Ancient Studies and Center for Near Eastern Studies.  He served as president of the Association for Jewish Studies from 2000 to 2003.  During the academic year 1989/90 he was a fellow of the Institute for Advanced Studies of the Hebrew University of Jerusalem as part of a research group dealing with the Dead Sea Scrolls.  He was a member of the academic committee for the Summer, 1997 celebration of the fiftieth anniversary of the discovery of the Dead Sea Scrolls and the 2008 60th anniversary conference, both held in Jerusalem.  He is a fellow of the American Academy for Jewish Research and a corresponding fellow of the Rennert Center for Jerusalem Studies at Bar-Ilan University.  He has been chairman of the Columbia University Seminar for the Study of the Hebrew Bible. He is a member of the board of the World Union for Jewish Studies and the Society for Biblical Literature where he served as chairman of the Qumran section.  He is a member of the Enoch seminar and of the advisory board of Henoch. He is also chairman of the International Jewish Committee on Interreligious Consultations (IJCIC) and led an IJCIC delegation for a meeting with Pope Francis at the Vatican in June 2013, according to the World Jewish Congress.\nHe served on the academic panel of the Rohr Jewish Learning Institute's Sinai Scholars Society Academic Symposium, and as a scholar-in-residence at the National Jewish Retreat.\n\n\n== Film appearances ==\nSchiffman was featured in the PBS Nova series documentary, Secrets of the Dead Sea Scrolls, as well as in four BBC documentaries on the scrolls, the McNeil–Lehrer program, and a Discovery special.  He appears regularly in the popular educational series Mysteries of the Bible, which appears on Arts and Entertainment (A&E), and more recently, in the four-part series Kingdom of David on PBS.\n\n\n== Visiting professorships ==\nSchiffman served as director of New York University's program at the archaeological excavations at Dor, Israel, from 1980 to 1982, in conjunction with the Hebrew University in Jerusalem and the Israel Exploration Society.  He has served as visiting professor at Yale University, Ben Gurion University of the Negev, Duke University, Shier Visiting Distinguished Professor in Judaic Studies at the University of Toronto, the Johns Hopkins University, the Russian State University for the Humanities in Moscow, the Luce Visiting Professor at the University of Hartford and the Hartford Seminary, the Pontifical Gregorian University in Rome, Queens College and Yeshiva University.\n\n\n== Contributions to the field of Dead Sea Scrolls ==\nIn 1985, Schiffman helped organize a Dead Sea Scrolls conference at New York University, where the field of Dead Sea Scrolls became organized as a separate field in Judaism in Late Antiquity.\nHe also played a role in the behind-the-sce",
  "fetched_at": "2026-02-09T02:49:36.958652"
}