{
  "url": "https://en.wikipedia.org/wiki/Enochian_magic",
  "title": "Enochian magic",
  "text": "Enochian magic is a system of Renaissance magic developed by John Dee and Edward Kelley and adopted by more modern practitioners. \nThe origins of this esoteric tradition are rooted in documented collaborations between Dee and Kelley, encompassing the revelation of the Enochian language and script, which Dee wrote were delivered to them directly by various angels during their mystical interactions.  Central to the practice is the invocation and command of various spiritual beings.\nDee's journals detail the two men's interactions with these entities, accompanied by the intricate Enochian script and tables of correspondences. They believed that these revelations granted them access to insights concealed within Liber Logaeth, often referred to as the Book of Enoch.\nEnochian magic, as practiced by Dee and Kelley, involved a range of rituals and ceremonies designed to evoke angelic and other spiritual entities. These practices, meticulously recorded in Dee's journals, aimed to harness the energies and wisdom of these entities for transformative and practical purposes. This Renaissance occult tradition involved the interaction between human practitioners and the ethereal realm, characterized by the use of the Enochian language and symbols.\nThe Hermetic Order of the Golden Dawn would later integrate elements of Enochian magic into its system. This adaptation reignited interest in Enochian practices, further embedding them within broader Western esoteric traditions. Debates have arisen regarding the accuracy and interpretation of these adaptations, one example of the evolution of Enochian magic across diverse historical and contemporary contexts.\n\n\n== Background ==\n\nIn the early 1580s, John Dee's pursuit of understanding the secrets of nature left him dissatisfied with his progress. Seeking a more profound wisdom encompassing both natural and artificial truths, Dee's journey evolved into a spiritual exploration. Dee wrote:\n\nI have from my youth up, desired and prayed unto God for pure and sound wisdom and understanding of truths natural and artificial, so that God's wisdom, goodness, and power bestowed in the frame of the world might be brought in some bountiful measure under the talent of my capacity... So for many years and in many places, far and near, I have sought and studied many books in sundry languages, and have conferred with sundry men, and have laboured with my own reasonable discourse, to find some inkling, gleam, or beam of those radical truths. But after all my endeavours I could find no other way to attain such wisdom but by the Extraordinary Gift,  and not by any vulgar school, doctrine, or human invention.\nIn response, Dee turned his attention toward the supernatural as a means to acquire the knowledge he sought. He used scrying, employing individuals known as scryers or crystal-gazers to act as intermediaries between himself and angelic beings. Dee's initial attempts with various scryers proved underwhelming, until he encountered Edward Kelley in 1582. Operating under the pseudonym Edward Talbot due to a forgery conviction, Kelley's remarkable abilities caught Dee's attention and impressed him greatly.\nDee enlisted Kelley's services, focusing his energies on supernatural pursuits. These spiritual interactions were steeped in Christian piety and followed periods of purification, prayer, and fasting. Dee held a steadfast belief in the potential benefits these efforts could bring to humanity. Kelley's role in channeling angelic communications resulted in a voluminous output, with the angels dictating several books, often in a previously unknown language termed \"Angelical\", now more commonly called Enochian. Kelley's contributions laid the groundwork for Enochian magic, a system that intertwined mysticism and practical ritual within the landscape of Renaissance occultism.\n\n\n=== Angelical ===\n\nCalled Angelical by Dee, the Enochian language is an occult constructed language — said by its originators to have been received f",
  "fetched_at": "2026-02-09T05:46:13.602530"
}