{
  "url": "https://en.wikipedia.org/wiki/Longship",
  "title": "Longship",
  "text": "Longships (Old Norse: langskip) were long clinker-built warships (Old Norse: herskip, Old Swedish: hærskip) propelled by oars, and later also by sail, used by the Norse and surrounding Germanic tribes from at least the 4th century AD and throughout the Viking Age, being part of the Nordic ship building tradition. As the name suggests, they were long slender ships, intended for speed, with the ability to carry a large crew of warriors. They are sometimes called \"dragonships\" (Old Norse: drekaskip) due to a tradition of the fore and aft ends being decorated with a raised dragonhead (Old Norse: drekahofud) and tail respectively, with the sail making up the \"wing\" of the dragon. The largest types were thus called \"dragons\" (dreki), while smaller types had names such as karve (karfi), snekke (snekkja), and skeid (skeið).\nArchaeological finds have been made of longships from the 9th, 10th and 11th centuries in Denmark, Norway and Germany, with motifs on Gotlandic picture stones dating to the 8th century or earlier. It is thought that the Norse specifically invented the design for Viking usage, which included raiding and warfare, exploration and commerce. The longship is a rather distinctly Norse (Scandinavian) construction, with bronze age petroglyphs in Sweden indicating a long tradition of building long animal-headed naval ships in Scandinavia. Equivalent clinker-built naval ships by the Wends (a South Baltic Slavic people) were much smaller and shorter in comparison.\nThe principles leading to the longship's design evolved over a long period of time. A big technological advancement came around 300 AD, when clinker-building was invented, as seen in the Danish Nydam boat and Swedish Björke boat, both from around 320 AD, with their features being subsequently adopted in the ships of other cultures, including those of the Anglo-Saxons, as seen in the 7th century Sutton Hoo ship. They continued to influence naval engineering for centuries, and the character and appearance of these ships have been reflected in Scandinavian boat building traditions to the present day. The particular skills and methods employed in making longships are still used worldwide, often with modern adaptations. They were all made out of wood, with cloth sails (woven wool), and had various details and carvings on the hull.\n\n\n== History ==\n\nThe evolution of shipbuilding in Scandinavia was facilitated by development of the iron industry. There was a great increase in iron production in the later Viking Age with the exploitation of bog ore as a source of iron ore to smelt into metal for iron tools, including farm implements and weaponry, as well as shipbuilding tools. With this technology, and the ready availability of nearly unlimited timber in the vast forests of Norway, the Norsemen acquired a high degree of skill in boat construction. Scandinavians developed the shipbuilding, navigation, and seamanship capabilities needed to exploit the undefended ports and coastlines of continental Europe. They became its foremost maritime people and the Viking Age began with Norse overseas expansion.\nThe archaeologists Julie Lund and Søren M. Sindbæk cite a dataset generated by a reconstruction of annual summer temperatures over the past 2,000 years that indicates a distinct warming trend in the 8th and 9th centuries, reviving earlier hypotheses that a milder climate was an impetus for the expansion of Norse maritime activity and colonization. Neil Price proposes that the maritime raiding practices which constitute what he calls the \"Viking phenomenon\"  may have begun earlier than ordinarily believed, and beyond the environs of the North Sea. He argues that recent finds such as the Salme ship burials from c. 750 suggest that raiding might have originated in the Baltic region, especially in the east.\nThe Norse had a well-developed naval architecture, and during the early medieval period, their ship designs were advanced for their time. The ships were owned by coastal farmers, an",
  "fetched_at": "2026-02-09T06:19:10.917540"
}