{
  "url": "https://en.wikipedia.org/wiki/Angel",
  "title": "Angel",
  "text": "An angel is a spiritual heavenly, or supernatural entity, usually humanoid with bird-like wings, often depicted as a messenger or intermediary between God (the transcendent) and humanity (the profane) in various traditions like the Abrahamic religions. Other roles include protectors and guides for humans, such as guardian angels and servants of God. In Western belief-systems the term is often used to distinguish benevolent from malevolent intermediary beings. \nEmphasizing the distance between God and mankind, revelation-based belief-systems require angels to bridge the gap between the earthly and the transcendent realm. Angels play a lesser role in monistic belief-systems, since the gap is non-existent. However, angelic beings might be conceived as aid to achieve a proper relationship with the divine.\nAbrahamic religions describe angelic hierarchies, which vary by religion and sect. Some angels are indicated with names (such as Gabriel or Michael) or are of a specific kind or rank  (such as a seraph or an archangel). Malevolent angels are often believed to have been expelled from heaven and are called fallen angels. In many such religions, the devil (or devils) are identified with such angels.\n\nAngels in art are often identified with bird wings, halos, and divine light. They are usually shaped like humans of extraordinary beauty, though this is not always the case –sometimes, they are portrayed as being frightening or inhuman.\n\n\n== Etymology, names ==\n\nThe word angel arrives in modern English from Old English engel (with a hard g) and the Old French angele. Both of these derive from Late Latin angelus, which in turn was borrowed from Late Greek ἄγγελος angelos (literally \"messenger\"). Τhe word's earliest form is Mycenaean a-ke-ro, attested in Linear B syllabic script. According to the Dutch linguist R. S. P. Beekes, ángelos itself may be \"an Oriental loan, like ἄγγαρος (ángaros, 'Persian mounted courier').\"\nThe rendering of ángelos is the Septuagint's default translation of the Biblical Hebrew term malʼākh, denoting simply \"messenger\" without connoting its nature. In the Latin Vulgate, this meaning becomes bifurcated: when malʼākh or ángelos is supposed to denote a human messenger, words like nuntius or legatus are applied. If the word refers to some supernatural being, the word angelus appears. Such differentiation has been taken over by later vernacular translations of the Bible, early Christian and Jewish exegetes and eventually modern scholars.\n\n\n== Background ==\nThe concept of angels is historically best to be understood from different ideas of the concept of God throughout history. In polytheistic and animistic worldviews, supernatural powers (i.e. deities, spirits, daemons, etc.) were assigned to different natural phenomena. Within a monotheistic framework, these powers were reconsidered to be servants of the supreme deity, turning autonomous supernatural beings into \"angels\".\nBy that, supernatural powers controlling or influencing humanity's perception of the world, including natural phenomena and humans, are ultimately under control of a supreme God. Prominent angels, such as Michael and Gabriel, reflect a connection to the Chief Semitic deity El. Even \"bad\" angels such as Satan, Samael, Iblis etc., can be understood as an operating force within the nature of humans, as responsible for selfish tendencies.\nThe idea of angels in early Hebrew scripture  as supernatural agents is absent. Instead, the Hebrew deity intervenes in human affairs, mostly by means of punishment. Only in later thought of post-exilic and prophetic writings, the Biblical deity is conceptualized as distant and more merciful, his interventions replaced by the idea of angels. However, such angels still carry out the gruesome attributes of God and can be both benevolent and malevolent. The notion of angels as embodiment of good emerges only under influence of Zoroastrianism, in which the Devil is conceived as the principle of evil, with a hosts of demo",
  "fetched_at": "2026-02-09T05:19:34.991256"
}