{
  "url": "https://en.wikipedia.org/wiki/Anselm_of_Canterbury",
  "title": "Anselm of Canterbury",
  "text": "Anselm of Canterbury OSB (; 1033/4–1109), also known as Anselm of Aosta (French: Anselme d'Aoste, Italian: Anselmo d'Aosta) after his birthplace and Anselm of Bec (French: Anselme du Bec) after his monastery, was an Italian Benedictine monk, abbot, philosopher, and theologian of the Catholic Church, who served as Archbishop of Canterbury from 1093 to 1109.\nAs Archbishop of Canterbury, he defended the church's interests in England amid the Investiture Controversy. For his resistance to the English kings William II and Henry I, he was exiled twice: once from 1097 to 1100 and then from 1105 to 1107. While in exile, he helped guide the Greek Catholic bishops of southern Italy to adopt Roman Rites at the Council of Bari. He worked for the primacy of Canterbury over the Archbishop of York and over the bishops of Wales, and at his death he appeared to have been successful; however, Pope Paschal II later reversed the papal decisions on the matter and restored York's earlier status.\nBeginning at Bec, Anselm composed dialogues and treatises with a rational and philosophical approach, which have sometimes caused him to be credited as the founder of Scholasticism. Despite his lack of recognition in this field in his own time, Anselm is now famous as the originator of the ontological argument for the existence of God and of the satisfaction theory of atonement.\nAfter his death, Anselm was canonized as a saint; his feast day is 21 April. He was proclaimed a Doctor of the Church by a papal bull of Pope Clement XI in 1720.\n\n\n== Biography ==\n\n\n=== Family ===\nAnselm was born in or around Aosta in Upper Burgundy sometime between April 1033 and April 1034. The area now forms part of the Republic of Italy, but Aosta had been part of the post-Carolingian Kingdom of Burgundy until the death of the childless Rudolph III in 1032. The Emperor Conrad II and Odo II, Count of Blois then went to war over the succession. Humbert the White-Handed, Count of Maurienne, so distinguished himself that he was granted a new county carved out of the secular holdings of the bishop of Aosta. Humbert's son Otto was subsequently permitted to inherit the extensive March of Susa through his wife Adelaide in preference to her uncle's families, who had supported the effort to establish an independent Kingdom of Italy under William V, Duke of Aquitaine. Otto and Adelaide's unified lands then controlled the most important passes in the Western Alps and formed the county of Savoy whose dynasty would later rule the kingdoms of Sardinia and Italy.\nRecords during this period are scanty, but both sides of Anselm's immediate family appear to have been dispossessed by these decisions in favour of their extended relations. His father Gundulph or Gundulf or Gondulphe was a Lombard noble, probably one of Adelaide's Arduinici uncles or cousins; his mother Ermenberge was almost certainly the granddaughter of Conrad the Peaceful, related both to the Anselmid bishops of Aosta and to the heirs of Henry II who had been passed over in favour of Conrad. The marriage was thus probably arranged for political reasons but proved ineffective in opposing Conrad after his successful annexation of Burgundy on 1 August 1034. (Bishop Burchard subsequently revolted against imperial control but was defeated and was ultimately translated to the diocese of Lyon.) Ermenberge appears to have been the wealthier partner in the marriage. Gundulph moved to his wife's town, where she held a palace, most likely near the cathedral, along with a villa in the valley. Anselm's father is sometimes described as having a harsh and violent temper but contemporary accounts merely portray him as having been overgenerous or careless with his wealth; Meanwhile, Anselm's mother Ermenberge, patient and devoutly religious,  made up for her husband's faults by her prudent management of the family estates. In later life, there are records of three relations who visited Bec: Folceraldus, Haimo, and Rainaldus. The first repeatedly at",
  "fetched_at": "2026-02-09T05:19:34.435856"
}