{
  "url": "https://en.wikipedia.org/wiki/Raised_fist",
  "title": "Raised fist",
  "text": "The raised fist, or the clenched fist, is a long-standing image of mixed meaning, often a symbol of solidarity, especially with a political movement. It is a common symbol representing a wide range of political ideologies, most notably socialism, communism, anarchism, and trade unionism, and can also be used as a salute expressing unity, strength, or resistance.\n\n\n== History ==\n\nThe origin of the raised fist as either a symbol or gesture is unclear. Its use in trade unionism, anarchism, and the labor movement had begun by the 1910s. William \"Big Bill\" Haywood, a founding member of the Industrial Workers of the World, used the metaphor of a fist as something greater than the sum of its parts during a speech at the 1913 Paterson silk strike. Journalist and socialist activist John Reed described hearing a similar description from a participant in the strike. A large raised fist rising from a crowd of striking workers was used to promote a mass strike in Budapest in 1912. In the United States, clenched fist was described by the magazine Mother Earth as \"symbolical of the social revolution\" in 1914.\nThe use of the fist as a salute by communists and antifascists is first evidenced in 1924, when it was adopted for the Communist Party of Germany's Roter Frontkämpferbund (\"Alliance of Red Front-Fighters\"). In reaction, the Nazi Party adopted the well-known Roman salute two years later. The gesture of the raised fist was apparently known in the United States as well, and is seen in a photograph from a May Day march in New York City in 1936. It is perhaps best known in this era from its use during the Spanish Civil War of 1936–1939, as a greeting by the Republican faction, and known as the \"Popular Front salute\" or the \"anti-fascist salute\".\n\nThe graphic symbol was popularised in 1948 by Taller de Gráfica Popular, a print shop in Mexico that used art to advance revolutionary social causes. Its use spread through the United States in the 1960s after artist and activist Frank Cieciorka produced a simplified version for the Student Nonviolent Coordinating Committee: this version was subsequently used by Students for a Democratic Society and the Black Power movement.\nThe raised right fist was frequently used in posters produced during the May 1968 revolt in France, such as La Lutte continue, depicting a factory chimney topped with a clenched fist.\nThe South African Students' Organization used the clenched and raised black fist as its logo, and the image became a symbol for the Black Consciousness Movement. Anti-apartheid activist Steve Biko's coffin also featured the image.\nRobin Morgan designed the feminist symbol of a raised fist within the Venus symbol for a protest of the 1969 Miss America pageant, where it was popularized.\nA raised fist incorporating the outline of the state of Wisconsin, as designed in 2011, is meant for union protests against the state rescinding collective bargaining.\n\n\n== Logo ==\nThe raised fist logo generally carries the same symbolism as a hand gesture. It was an important symbol of workers rights and labor movements, as well as specific labor actions, such as strikes, boycotts, and walk-outs.\nNotable examples include the fist and rose, a white fist holding a red rose, used by the Socialist International and some socialist or social democratic parties, such as the French Socialist Party and the Spanish Socialist Workers' Party. The fist can represent ethnic solidarity, such as in the Black Power fist of Black nationalism and the Black Panther Party, a Black Marxist group in the 1960s, or the White Power fist of White nationalism. A Black fist logo was also adopted by the northern soul music subculture. Loyalists in Northern Ireland occasionally use a red clenched fist on murals depicting the Red Hand of Ulster, which is also featured on the flag of Ulster. Irish republicans, on the other hand, have been seen displaying raised fists.\nThe image gallery shows how a raised fist is used in visual communication. Combine",
  "fetched_at": "2026-02-09T02:49:27.512287"
}