{
  "url": "https://en.wikipedia.org/wiki/They_Might_Be_Giants",
  "title": "They Might Be Giants",
  "text": "They Might Be Giants, often abbreviated as TMBG, is an American alternative rock band formed in 1982 by John Flansburgh and John Linnell. During TMBG's early years, Flansburgh and Linnell frequently performed as a musical duo, often accompanied by a drum machine. In the early 1990s, TMBG expanded to include a backing band. The duo's current backing band consists of Marty Beller, Dan Miller and Danny Weinkauf. They have been credited as vital in the creation and growth of the prolific DIY music scene in Brooklyn in the mid-1980s.\nOver their career, they have found success on the modern rock and college radio charts. They have also found success in children's music with several educational albums and in theme music for television programs and films.\nTMBG have released 23 studio albums. Flood has been certified platinum, while their children's music albums Here Come the ABCs, Here Come the 123s, and Here Comes Science have all been certified gold. The duo has been nominated for four Grammy Awards, winning two. Flansburgh and Linnell won for writing \"Boss of Me\", the theme to Malcolm in the Middle (Best Film or Television Theme) and They Might Be Giants won for Here Come the 123s (Best Children's Album). Flansburgh and Linnell were also nominated for a Tony Award for Best Original Score (Music and/or Lyrics) Written for the Theatre along with other composers of the show for SpongeBob SquarePants: The Broadway Musical. In total, the group has sold over 4 million records.\n\n\n== History ==\n\n\n=== Earlier years (1981–1989) ===\nJohn Flansburgh and John Linnell first met as teenagers growing up in Lincoln, Massachusetts. They began writing songs together while attending Lincoln-Sudbury Regional High School but did not form a band at that time. The two attended separate colleges after high school and Linnell joined The Mundanes, a new wave group from Rhode Island. The two reunited in 1981 after moving to Brooklyn (to the same apartment building on the same day) to continue their career.\nAt their first concert, They Might Be Giants were introduced as and performed under the name El Grupo De Rock and Roll (Spanish for \"the Rock and Roll Band\"), because the show was a Sandinista rally in Central Park and a majority of the audience members spoke Spanish. They had previously chosen a name that, according to John Flansburgh, was \"so bad that John [Linnell] and I have made a vow that we will never tell anyone, even our children.\" Soon discarding this name, the band assumed the name of the 1971 film They Might Be Giants (starring George C. Scott and Joanne Woodward), which is in turn taken from a Don Quixote passage about how Quixote mistook windmills for evil giants. According to Dave Wilson, in his book Rock Formations, the name They Might Be Giants had been used and subsequently discarded by a friend of the band who had a ventriloquism act. The name was then adopted by the band, who had been searching for a more suitable name.\nA common misconception is that the name of the band is a reference to themselves and an allusion to future success. In an interview, John Flansburgh said that the words \"they might be giants\" are just a very outward-looking forward thing which they liked. He clarified this in the documentary movie Gigantic (A Tale of Two Johns) by explaining that the name refers to the outside world of possibilities that they saw as a fledgling band. In an earlier radio interview, John Linnell described the phrase as \"something very paranoid sounding\".\nThe duo began performing their own music in and around New York City at the East Village Pyramid Club – Flansburgh on guitar, Linnell on accordion and saxophone and accompanied by a drum machine or prerecorded backing track on audio cassette. Their atypical instrumentation, along with their songs which featured unusual subject matter and clever wordplay, soon attracted a strong local following. Their performances also featured absurdly comical stage props such as oversized fezzes and large ",
  "fetched_at": "2026-02-09T05:38:58.236757"
}