{
  "url": "https://en.wikipedia.org/wiki/Number_of_the_beast",
  "title": "Number of the beast",
  "text": "The number of the beast (Koine Greek: Ἀριθμὸς τοῦ θηρίου, Arithmós toû thēríou) is associated with the Beast of Revelation in chapter 13, verse 18 of the Book of Revelation. In most manuscripts of the New Testament and in English translations of the Bible, the number of the beast is six hundred sixty-six (666) or χξϛ (in Greek numerals, χ represents 600, ξ represents 60 and ϛ represents 6). Papyrus 115 (which is the oldest preserved manuscript of the Revelation as of 2017), as well as other ancient sources like Codex Ephraemi Rescriptus, give the number of the beast as χιϛ or χιϲ, transliterable in Arabic numerals as 616 (χιϛ), not 666; critical editions of the Greek text, such as the Novum Testamentum Graece, note χιϛ/616 as a variant. There is a broad consensus in contemporary scholarship that the number of the beast refers to the Roman Emperor Nero.\n\n\n== In the Bible ==\n\n\n=== χξϛ ===\n\nThe number of the beast is described in Revelation 13:15–18. Several translations have been interpreted for the meaning of the phrase \"Here is Wisdom. Let him that hath understanding count the number of the beast...\" where the peculiar Greek word ψηφισάτω (psephisato) is used. Possible translations include \"to count\", \"to reckon\" and also \"to vote\" or \"to decide\".\nIn the Textus Receptus, derived from Byzantine text-type manuscripts, the number six hundred sixty-six is represented by the Greek numerals χξϛ, with the Greek ligature stigma (ϛ) representing the number 6:\n\n17καὶ ἵνα μή τις δύνηται ἀγοράσαι ἢ πωλῆσαι εἰ μὴ ὁ ἔχων τὸ χάραγμα, τὸ ὄνομα τοῦ θηρίου ἢ τὸν ἀριθμὸν τοῦ ὀνόματος αὐτοῦ. 18Ὧδε ἡ σοφία ἐστίν· ὁ ἔχων τὸν νοῦν ψηφισάτω τὸν ἀριθμὸν τοῦ θηρίου· ἀριθμὸς γὰρ ἀνθρώπου ἐστί· καὶ ὁ ἀριθμὸς αὐτοῦ χξϛʹ.\nENGLISH\"17And that no man might buy or sell, save he that had the mark, or the name of the beast, or the number of his name. 18Here is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is 666.\"\n\nIn several editions of the Greek Bible, this number is instead represented by three words spelled out, ἑξακόσιοι ἑξήκοντα ἕξ, hexakósioi hexḗkonta héx, meaning \"six hundred [and] sixty-six\":\n\n\n=== χιϛ ===\n\nAlthough Irenaeus (2nd century AD) affirmed the number to be 666 and reported several scribal errors of the number, theologians have doubts about the traditional reading because of the appearance of the figure 616 in the Codex Ephraemi Rescriptus (C; Paris—one of the four great uncial codices), as well as in the Latin version of Tyconius (DCXVI, ed. Souter in the Journal of Theology, SE, April 1913), and in an ancient Armenian version (ed. Conybeare, 1907). Irenaeus knew about the 616 reading, but did not adopt it (Haer. V, 30) noting instead that those who spoke with the Apostle John (traditionally considered the author of the Book of Revelation) \"face to face\" said that the number was 666. In the 380s, correcting the existing Latin-language version of the New Testament (commonly referred to as the Vetus Latina), Jerome retained \"666\".\nAround 2005, a fragment from Papyrus 115, taken from the Oxyrhynchus site, was discovered at the University of Oxford's Ashmolean Museum. It gave the beast's number as 616 (χις). This fragment is the oldest manuscript (about 1,700 years old) of Revelation 13 found as of 2017. Codex Ephraemi Rescriptus, known before the Papyrus 115 finding but dating to after it, has 616 written in full: ἑξακόσιοι δέκα ἕξ, hexakosioi deka hex (lit. \"six hundred and sixteen\").\nPapyrus 115 and Ephraemi Rescriptus have led some scholars to regard 616 as the original number of the beast. According to Paul Louis Couchoud, \"The number 666 has been substituted for 616 either by analogy with 888, the [Greek] number of Jesus (Gustav Adolf Deissmann), or because it is a triangular number, the sum of the first 36 numbers (1+2+3+4+5+6+...+36 = 666)\".\n\n\n== Interpretations ==\nThe beast's identity and the beast's number are usually interpreted by applying one of three methods:\n\nU",
  "fetched_at": "2026-02-09T05:21:01.944644"
}