{
  "url": "https://en.wikipedia.org/wiki/Death_in_the_Byzantine_Empire",
  "title": "Death in the Byzantine Empire",
  "text": "In the Byzantine Empire, death was generally not mentioned directly, preferring to use various euphemisms such as separation, leaving-by, paying off debts-paying. Byzantine thanatological conceptions go back to ancient philosophy, which presented death as the separation of the soul from the body. According to Christian eschatology, it was assumed that this separation was temporary and that the soul would be reunited with the body at the end of time. The Byzantines believed that death occurred at the command of God, who sent an angel to carry out his will. There were differing opinions as to whether the hour of death was predetermined, but it was believed that only the saints could know it in advance. The afterlife began with the naked and helpless soul coming out of the body through the mouth to be accompanied by an angel to begin a forty-day wandering, passing through publicans, during which the demons weigh its sins. At the end of the journey, the soul sees Hell and Heaven as a possible waiting place for the Last Judgment. The doctrine of the souls transmigration was completely denied in Byzantium. As in the philosophy of Neoplatonism, Eastern Christianity views death as a release for new life, and the Church Fathers Basil the Great and John Chrysostom disapproved of excessive mourning for the dead.\nByzantine death, burial rituals and ideas about the afterlife are largely based on pre-Christian ideas and customs. The pagan belief in a journey of the soul before death, for which some material aids and an attendant —the psychopomp— are necessary, underwent an outward transformation among early Christian theologians. The role of the psychopomp began to be played by angels, and the viaticum given to the dead by the sacrament of anointing with oil. Many Byzantines underwent pre-mortem tonsure in the hope of increasing their chances of salvation. The custom of preparing a special memorial meal (kutia) also stems from the pagan tradition of a meal by relatives at the grave of the deceased. It was rejected as a prejudice in the West, but preserved in the Byzantine Church. Kolivo was to be distributed on certain days after death (the 3rd, 7th or 9th, 30th or 40th), along with the recitation of appropriate prayers, because it was believed that during these days the soul passed through significant stages on its way to God. The deceased were also commemorated on the anniversary of their death and on the Sunday before the week of the Last Judgment. The Byzantines believed that the soul's fate could be influenced by prayers and donations to churches and monasteries.\n\n\n== Life after death in Byzantium ==\n\nThe Byzantines certainly believed that death was not the end. At the same time, they believed that the existence of the soul outside the body was a matter of mystical experience rather than theological study. Most early Christian writers agreed that death consisted in the separation of the conscious soul from the material body, and believers hoped to await the end of the world in a comfortable place —Bosom of Abraham— and then to rise in the flesh and see the triumph of Christ. The position of the Byzantine Church on eschatological issues was in line with Orthodox dogma and left little room for interpretation. The Nicene-Chalcedonian Creed contained the dogma of the expectation of the resurrection from the dead and the future life. Christian theologians from Hippolytus of Rome (2nd-3rd centuries) believed that the resurrection would be physical, not spiritual. In the eighth century, one of the Church Fathers, John of Damascus, in his Sacred Parallels, in the chapter On the Time of Death, asserted that souls wait in the afterlife for the time determined by God, when all will be resurrected, but not by incarnation of souls, but bodily. Because of local peculiarities, the question of the bodily resurrection was given considerable attention in Egypt. Despite the condemnation of the custom of mummification by such prominent theologians as Shen",
  "fetched_at": "2026-02-09T02:44:56.775556"
}