{
  "url": "https://en.wikipedia.org/wiki/Enoch",
  "title": "Enoch",
  "text": "Enoch (  Hebrew: חֲנוֹךְ‎, Modern: Ḥanōḵ, Tiberian: Ḥănōḵ; Greek: Ἑνώχ Henṓkh) is a biblical figure and patriarch prior to Noah's flood. He is the son of Jared and father of Methuselah.\nThe text of the Book of Genesis says Enoch lived 365 years before he was taken by God. The text reads that Enoch \"walked with God: and he was no more; for God took him\" (Gen 5:21–24), which is interpreted as Enoch entering heaven alive in some Jewish and Christian traditions, and interpreted differently in others.\nEnoch is the subject of many Jewish and Christian traditions. He was considered the author of the Book of Enoch and also called the scribe of judgement. In the New Testament, the Gospel of Luke, the Epistle to the Hebrews, and the Epistle of Jude all reference Enoch, the last of which also quotes from the Book of Enoch. In the Catholic Church, Eastern Orthodoxy, and Oriental Orthodoxy, he is venerated as a Saint.\n\n\n== Etymology ==\nSeveral etymologies have been proposed for the name Enoch (חֲנוֹךְ Ḥănōḵ). Philo of Alexandria proposed it meant \"your grace\" (from Hebrew ḥēn), while Jerome derived it from the verb (ḥ-n-ḵ), meaning to train, initiate, dedicate, inaugurate, giving a meaning \"dedicated\". Modern scholars have proposed meanings including \"follower\", \"inaugurated\", and \"wise\" or \"clever\".\n\n\n== Book of Genesis ==\nEnoch appears in the Book of Genesis of the Pentateuch as the seventh of the ten pre-Deluge Patriarchs. Genesis states that each of the pre-Flood Patriarchs lived for several centuries. Genesis 5 provides a genealogy of these ten figures (from Adam to Noah), providing the age at which each fathered the next, and the age of each figure at death. Enoch is considered by many to be the exception, who is said to \"not see death\" (Hebrews 11:5). Two places in Genesis 5 denote Enoch as a person who \"walked with God\" (Genesis 5:22 and Genesis 5:24), Noah is the only other pre-Deluge Patriarch Genesis gave this designation to (Genesis 6:9). Furthermore, Genesis 5:22–24 states that Enoch lived for 365 years, which is shorter than other pre-Flood Patriarchs, who are all recorded as dying at over 700 years of age. The brief account of Enoch in Genesis 5 ends with the cryptic note that \"he was not; for God took him.\" This happens 57 years after Adam's death and 69 years before Noah's birth.\n\n\n== Books of Enoch (Apocryphal) ==\n\nThree extensive Apocrypha are attributed to Enoch:\n\nThe Book of Enoch (aka 1 Enoch), composed in Hebrew or Aramaic and preserved in Ge'ez, first brought to Europe by James Bruce from Ethiopia and translated into English by August Dillmann and Reverent Schoode – recognized by the Orthodox Tewahedo churches and usually dated between the third century BC and the first century AD.\n2 Enoch (aka Book of the Secrets of Enoch), preserved in Old Church Slavonic, and first translated in English by William Morfill – usually dated to the first century AD.\n3 Enoch, a Rabbinic text in Hebrew usually dated to the fifth century AD.\nThese recount how Enoch was taken up to Heaven and was appointed guardian of all the celestial treasures, chief of the archangels, and the immediate attendant on the Throne of God. He was subsequently taught all secrets and mysteries and, with all the angels at his back, fulfills of his own accord whatever comes out of the mouth of God, executing His decrees. Some esoteric literature, such as 3 Enoch, identifies Enoch as Metatron, the angel which communicates God's word. In consequence, Enoch was seen, by this literature and the Rabbinic kabbalah of Jewish mysticism, as the one who communicated God's revelation to Moses, and, in particular, as the dictator of the Book of Jubilees.\n\n\n=== In Book of Giants ===\nThe Book of Giants is a Jewish pseudepigraphal work from the third century BC and resembles the Book of Enoch. Fragments from at least six and as many as eleven copies were found among the Dead Sea Scrolls collections.\n\n\n=== Septuagint ===\nThe third-century BC translators who produced the Septua",
  "fetched_at": "2026-02-09T02:50:03.158805"
}