{
  "url": "https://en.wikipedia.org/wiki/List_of_hybrid_creatures_in_folklore",
  "title": "List of hybrid creatures in folklore",
  "text": "The following is a list of hybrid entities from the folklore record grouped morphologically. Hybrids not found in classical mythology but developed in the context of modern popular culture are listed in § Modern fiction.\n\n\n== Mythology ==\n\n\n=== Head of one animal, body of another ===\n\n\n==== Mammalian bipeds ====\n\nAnubis – The jackal-headed Egyptian God.\nBastet – The cat-headed Egyptian Goddess.\nCynocephalus – A dog-headed creature.\nDaksha – His head was replaced by a goat's head after a beheading.\nGanesha – An elephant-headed God.\nHayagriva – A horse-headed avatar.\nHorse-Face – A horse-headed guardian or type of guardian of the Underworld in Chinese mythology.\nIpotane – A race of half-horse half-humans, usually depicted as the reverse of centaurs.\nKeibu Keioiba (alias Kabui Keioiba) – A Meitei folkloric mythical creature having the head of a tiger and the remaining body of a human.\nKhnum – The ram-headed Egyptian God.\nMaahes, Pakhet, Sekhmet, and Tefnut – Each of these Egyptian Gods has the head of a lion.\nMinotaur – A creature that has the body of a human with the head, tail, and occasional hindquarters of a bull.\nNandi – Some Puranas describe Nandi or Nandikeshvara as bull-faced, with a human body that resembles that of Shiva in proportion and aspect.\nNarasimha – A Hindu deity with a lion-like face.\nOx-Head – An ox-headed guardian or type of guardian of the Underworld in Chinese mythology.\nPenghou – A Chinese tree spirit with the face of a human and the body of a dog.\nPratyangira – A Hindu Goddess having the head of a lion.\nSet – The dog-headed Egyptian God.\nTikbalang - A tall Filipino horse-headed man.\nTumburu - A horse faced Hindu deity.\nVaraha – A boar-headed avatar.\nZhu Bajie – A pig-headed major character of the novel Journey to the West.\n\n\n==== Other bipeds ====\n\nAlkonost – A creature from Russian folklore with the head of a woman with the body of a bird, said to make beautiful sounds that make anyone who hears them forget all that they know and not want anything more ever again.\nBird goddess – Vinca figures of a woman with a bird head.\nCuca - A creature from Brazilian folklore and female counterpart of the Coco that is depicted as a witch with the head of an alligator. It will catch and eat children that disobey their parents.\nGamayun – A Russian creature portrayed with the head of a woman and the body of a bird.\nHeqet – The frog-headed Egyptian God.\nHorus, Monthu, Ra, and Seker – Each of these Egyptian Gods has the head of a falcon or hawk.\nInmyeonjo – A human face with bird body creature in ancient Korean mythology.\nKarura – A divine creature of Japanese Hindu-Buddhist mythology with the head of a bird and the torso of a human.\nKuk – Kuk's male form has a frog head while his female form has a snake head.\nMeretseger – The cobra-headed Egyptian Goddess.\nSirin – Half-bird, half-human creature with the head and chest of a woman from Russian folklore; its bird half is generally that of an owl's body.\nSobek – The crocodile-headed Egyptian God.\nThoth – The ibis-headed Egyptian God.\n\n\n==== Quadrupeds ====\n\nAkhekh - A creature from Egyptian mythology with the body of an oryx and the wings and snout of a bird.\nAllocamelus – A Heraldic creature that has the head of a donkey and the body of a camel.\nBai Ze – A creature from Chinese mythology with the head of a human and the body of a cow with six horns and nine eyes.\nCatoblepas - One version of the creature in Gustave Flaubert's The Temptation of Saint Anthony depicts it with the head of a wild boar and the body of a black African buffalo.\nCriosphinx – A Sphinx that has the head of a ram.\nGajasimha – A creature with the head of an elephant and the body of a lion.\nGye-lyong – A creature from Korean mythology with the head of a chicken and the body of a dragon.\nHieracosphinx – A type of Sphinx that had a hawk head.\nJinmenken - A Japanese creature with the face of a human and the body of a dog.\nLampago - A creature with the head of a man and the body of a lion or a tiger.\nKudan - ",
  "fetched_at": "2026-02-09T05:57:43.400980"
}