{
  "url": "https://en.wikipedia.org/wiki/Tom_Stacey",
  "title": "Tom Stacey",
  "text": "Tom Stacey FRSL (11 January 1930 – 24 December 2022) was a British novelist, publisher, screenwriter, journalist and penologist. He was a prominent member of White's.\n\n\n== Early life ==\nStacey attended Wellesley House School (1938–1943), originally at Broadstairs, Kent, but from September 1939 was evacuated to the Scottish Highlands.\nAt Eton College (1943–48) Stacey became a fourth-generation successive Stacey pupil at Eton, where he was a solo treble, the founder of Wotton's Society in the field of philosophy, editor (with Douglas Hurd) of the weekly Eton College Chronicle, winner of the Essay Prize, and House Captain.\nWith the Scots Guards (1948–50), in which he received his commission as Second Lieutenant, on active service in what is now known as peninsular Malaysia, he spent his leave with the Temiar aborigines in the jungle, and wrote his first book (The Hostile Sun).\nAt Worcester College, Oxford, England (1950–51), he left without taking a degree but founded and co-organised the controversial students' tour operation, Undergrad Tours, during the 1951 Festival of Britain year.\n\n\n== Journalistic career ==\nStacey was staff writer at the Lilliput Magazine (1951–52), as a colleague of Patrick Campbell and Maurice Richardson. He then became feature writer and foreign correspondent for Picture Post (1952–54). During 1954 he became the Daily Express (London) 'Express Explorer' in which he crossed Africa overland from the Atlantic to East Africa, accompanied by Ugandan Cambridge university graduate Erisa Kironde, and lived with the Bakonzo people of the Ruwenzori Mountains.\nBriefly a roving correspondent for the Montreal Star (1955–56), he rejoined the Daily Express in 1956–60 as foreign correspondent and diplomatic correspondent, with a spell as daily America columnist in 1957. He joined The Sunday Times as roving correspondent and chief foreign correspondent (1960–65), with a worldwide brief, covering the dismantling of the British Empire globally, and major conflict zones of the period, and interviewing many heads of state (including Nikita Khrushchev, Morarji Desai, Ayub Khan, Harold Macmillan, and Éamon de Valera).\nStacey then moved to the London Evening Standard (1965–67), where he was a columnist and roving correspondent, while standing for Parliament. Subsequent freelance assignments were undertaken for The Times, The Sunday Telegraph, The Daily Telegraph, The Observer, Daily Mail, and The Spectator. In all, Stacey reported from over 120 countries, many of them several times.\n\n\n== Publishing career ==\nFrom 1967 to 1970, he was editor and creator of Correspondents World Wide, a current affairs service for schools and universities, mobilising the skills of several distinguished journalistic colleagues.\nFrom 1969 to 1973, he was creator and joint managing director of general publishers Tom Stacey Ltd and subsidiaries (Tom Stacey Reprints, Tom Stacey Education Ltd), which published, inter alia, the Prospect for Man ecological series, and created the 20-volume Peoples of the Earth series, conceived by Stacey and released by Tom Stacey Ltd, Grolier (US) and Mondadori in 14 languages.\nIn 1974, he founded Stacey International, the book publisher, originally majoring extensively on the Middle East and Islamic world, later expanding into general book publishing and initiating  the literary fiction imprint Capuchin Classics, the Independent Minds series campaigning on heterodox climate science and the legalisation of all drugs; and the \"return of real history\" with the reissue of Carter & Mear's History of Britain for schools, in 9 volumes.\n\n\n== Personal life, politics and penology ==\nIn January 1952, he married Caroline Clay who was to become a widely exhibited sculptor, mostly in clay for bronze. They have five children (Emma, healer, born 1952; Tilly, potter, born 1954; Isabella, born 1957 (married to Christopher Simon Sykes, the photographer and biographer), who as an international stage and opera designer/director works as Isa",
  "fetched_at": "2026-02-09T06:04:42.184291"
}