{
  "url": "https://en.wikipedia.org/wiki/Henoch–Schönlein_purpura",
  "title": "Henoch–Schönlein purpura",
  "text": "IgA vasculitis, previously known as Henoch–Schönlein purpura (HSP), is an autoimmune disease that most commonly affects children. In the skin, the disease causes palpable purpura (small, raised areas of bleeding underneath the skin), often with joint pain (arthralgia) and abdominal pain. With kidney involvement, there may be a loss of small amounts of blood and protein in the urine (hematuria and proteinuria), but this usually goes unnoticed; in a small proportion of cases, the kidney involvement proceeds to chronic kidney disease (CKD). HSP is often preceded by an infection, such as a throat infection.\nHSP is a systemic vasculitis (inflammation of blood vessels) and is characterized by deposition of immune complexes containing the antibody immunoglobulin A (IgA); the exact cause for this phenomenon is unknown. In children, it usually resolves within several weeks and requires no treatment apart from symptom control but may relapse in 1 out of 3 cases and cause irreversible kidney damage in about 1 in 100 cases. In adults, the prognosis is different from in children. The average duration of cutaneous lesions is 27.9 months. For many, it tends to be relapsing–remitting over a long period of time, rather than self-limiting and there tend to be more complications.\n\n\n== Signs and symptoms ==\n\nPurpura, arthritis, and abdominal pain are known as the \"classic triad\" of Henoch–Schönlein purpura. Purpura occur in all cases, joint pains and arthritis in 80%, and abdominal pain in 62%. Some include gastrointestinal hemorrhage as a fourth criterion; this occurs in 33% of cases, sometimes, but not necessarily always, due to intussusception. The purpura typically appear on the legs and buttocks, but may also be seen on the arms, face and trunk. The abdominal pain is colicky in character, and may be accompanied by nausea, vomiting, constipation or diarrhea. There may be blood or mucus in the stools. The joints involved tend to be the ankles, knees, and elbows, but arthritis in the hands and feet is possible; the arthritis is nonerosive and hence causes no permanent deformity. Forty percent have evidence of kidney involvement, mainly in the form of hematuria (blood in the urine), but only a quarter will have this in sufficient quantities to be noticeable without laboratory tests. Problems in other organs, such as the central nervous system (brain and spinal cord) and lungs may occur, but is much less common than in the skin, bowel and kidneys.\nOf the 40% of patients who develop kidney involvement, almost all have evidence (visible or on urinalysis) of blood in the urine. More than half also have proteinuria (protein in the urine), which in one eighth is severe enough to cause nephrotic syndrome (generalised swelling due to low protein content of the blood). While abnormalities on urinalysis may continue for a long time, only 1% of all HSP patients develop chronic kidney disease. Hypertension (high blood pressure) may occur. Protein loss and high blood pressure, as well as the features on biopsy of the kidney if performed, may predict progression to advanced kidney disease. Adults are more likely than children to develop advanced kidney disease.\n\n\n== Pathophysiology ==\nHenoch–Schönlein purpura is a small-vessel vasculitis in which complexes of immunoglobulin A (IgA) and complement component 3 (C3) are deposited on arterioles, capillaries, and venules (hence it is a type III hypersensitivity reaction). The activation of the alternative complement pathway results in the deposition of IgA aggregates or IgA complexes in target organs (with deposition of C3). This leads to the production of inflammatory mediators, including vascular prostaglandins like prostacyclin, which may play a key role in the development of IgAV and its organ-specific clinical manifestations. As with IgA nephropathy, serum levels of IgA are high in HSP and there are identical findings on renal biopsy; however, IgA nephropathy has a predilection for young adults while HSP is m",
  "fetched_at": "2026-02-09T02:44:53.751086"
}