{
  "url": "https://en.wikipedia.org/wiki/Neo-Nazism",
  "title": "Neo-Nazism",
  "text": "Neo-Nazism comprises all social, political, and militant ideologies and movements that have professed or idealized Nazism, whether in whole or in part, since the end of World War II in 1945. Neo-Nazi individuals and organizations employ their ideology to promote what they perceive as the racial or ethnic supremacy (often White supremacy) of their own group; to incite or engage in hatred or discrimination against demographic minorities (often antisemitism and Islamophobia); and, in some cases, to establish a fascist state (e.g., \"Fourth Reich\"). Also common in neo-Nazi circles is engagement in historical negationism and propagation of conspiracy theories—not limited to absolving or glorifying the Nazi Party or those who inspired or are thought to have inspired Adolf Hitler and other prominent Nazi figures—such as Holocaust denial and Jewish war; White genocide and Great Replacement; and \"cultural\" Marxism. \nWhile mainly concentrated in the Western world, neo-Nazism is a global phenomenon and has organized representation in several international networks. However, it is not exclusive to people of European origin—many similar supremacist movements among local racial or ethnic groups in non-Western regions have been observed adhering to tenets of or inspired by neo-Nazi ideology. Much of this manifests in adopting original Nazi ideological doctrine and practices, including racism, ultra-nationalism, ableism, homophobia, and conspiratorial anti-communism, among others.\nNeo-Nazis regularly display Nazi symbols and express admiration for the actions of Hitler's Germany before and during World War II. In a number of Western and non-Western countries (and especially in Germany), neo-Nazism is prohibited by laws specifically targeting Nazi ideology, in addition to general laws against hatred and discrimination. Likewise, among these countries, Nazi-related symbols are also banned as part of a long-running effort of de-Nazification that began with the Allies of World War II.\n\n\n== Definition ==\nThe term neo-Nazism describes any post-World War II militant, social or political movements seeking to revive the ideology of Nazism in whole or in part.\nThe term 'neo-Nazism' can also refer to the ideology of these movements, which may borrow elements from Nazi doctrine, including ultranationalism, anti-communism, racism, ableism, xenophobia, homophobia, antisemitism, up to initiating the Fourth Reich. Holocaust denial is a common feature, as is the incorporation of Nazi symbols and admiration of Adolf Hitler.\nNeo-Nazism is considered a particular form of far-right politics and right-wing extremism.\n\n\n=== Esotericism ===\n\nNeo-Nazi writers have posited a spiritual, esoteric doctrine of race, which moves beyond the primarily Darwinian-inspired materialist scientific racism popular mainly in the Anglosphere during the 20th century. Figures influential in the development of neo-Nazi racism, such as Miguel Serrano and Julius Evola (writers who are described by critics of Nazism such as the Southern Poverty Law Center as influential within what it presents as parts of \"the bizarre fringes of National Socialism, past and present\"), claim that the Hyperborean ancestors of the Aryans were in the distant past, far higher beings than their current state, having suffered from \"involution\" due to mixing with the \"Telluric\" peoples; supposed creations of the Demiurge. Within this theory, if the \"Aryans\" are to return to the Golden Age of the distant past, they need to awaken the memory of the blood. An extraterrestrial origin of the Hyperboreans is often claimed. These theories draw influence from Gnosticism and Tantrism, building on the work of the Ahnenerbe. Within this racist theory, Jews are held up as the antithesis of nobility, purity and beauty.\n\n\n=== Ecology and environmentalism ===\nNeo-Nazism generally aligns itself with a blood and soil variation of environmentalism, which has themes in common with deep ecology, the organic movement and animal protect",
  "fetched_at": "2026-02-09T06:02:40.406185"
}