{
  "url": "https://en.wikipedia.org/wiki/Kaleb_of_Axum",
  "title": "Kaleb of Axum",
  "text": "Kaleb (Ge'ez: ካሌብ, Latin: Caleb), also known as Elesbaan (Ge'ez: እለ አጽብሐ, Koine Greek: Ἐλεσβαᾶς), Ella Asbeha, or Hellestheaios, was King of Aksum, which was situated in what is now Ethiopia and Eritrea.\n\n\n== Name ==\nProcopius calls him \"Hellestheaeus,\" a variant of the Greek version of his regnal name, Ge'ez: እለ አጽብሐ, romanized: ʾƎllä ʾAṣbəḥa  (Histories, 1.20). Variants of his name are Hellesthaeus, Hellestheaios, Ellestheaeus, Eleshaah, Ellesboas, Elesbaan, and Elesboam.\nAt Aksum, in inscription RIE 191, his name is rendered in unvocalized Gə‘əz as klb ’l ’ṣbḥ wld tzn \"Kaleb ʾElla ʾAṣbeḥa, son of Tazena\". In vocalized Gə‘əz, it is ካሌብ እለ አጽብሐ (Kaleb ʾƎllä ʾÄṣbəḥä).\nKaleb, a name derived from the Biblical character Caleb, was his given name. On both his coins and inscriptions he left at Axum, as well as Ethiopian hagiographical sources and king lists, he refers to himself as the son of Tazena.\n\n\n== Life ==\nProcopius, John of Ephesus, and other contemporary historians recount Kaleb's invasion of Yemen around 520, against the Himyarite king Yūsuf As'ar Yath'ar, known as Dhu Nuwas, a Jewish convert who was persecuting the Christian community of Najran. After much fighting, Kaleb's soldiers eventually routed Yusuf's forces. They killed the king, allowing Kaleb to appoint Sumyafa Ashwa, a native Christian (named Esimiphaios by Procopius), as his viceroy of Himyar.\nAs a result of his protection of the Christians, Kaleb is known as Saint Elesbaan after the sixteenth-century Cardinal Caesar Baronius added him to his edition of the Roman Martyrology.\nAksumite control of Arabia Felix continued until c. 525 when Sumyafa Ashwa was deposed by Abraha, who made himself king. Procopius states that Kaleb made several unsuccessful attempts to recover his overseas territory; however, his successor later negotiated a peace with Abraha, where Abraha acknowledged the Axumite king's authority and paid tribute. Stuart Munro-Hay opines that by this expedition Axum overextended itself, and this final intervention across the Red Sea, \"was Aksum's swan-song as a great power in the region.\"\nIt is also apparent that his reign was marked by a major integration of the Agaw tribes of what are today the districts of Wag and Lasta into his own kingdom. Cosmas Indicopleustes provides an important documentary confirmation for this. He makes a reference to the \"governor of Agau\", who was entrusted by Kaleb with the protection of the long-distance caravan routes from the south. According to Taddesse Tamrat, Kaleb's governor of Agau probably has his seat of government in the area of Lasta, which later serve as the center of the Zagwe dynasty.\nA historical record survives of a meeting between the Byzantine ambassador and historian Nonnosus and Kaleb in the year 530.\nEthiopian tradition states that Kaleb eventually abdicated his throne, gave his crown to the Church of the Holy Sepulchre at Jerusalem, and retired to a monastery. Later historians who recount the events of King Kaleb's reign include ibn Hisham, ibn Ishaq, and al-Tabari. Taddesse Tamrat records a tradition he heard from an aged priest in Lalibela:\n\nKaleb was a man of Lasta and his palace was at Bugna where it is known that Gebre Mesqel Lalibela had later established his centre. The relevance of this tradition for us is the mere association of the name of Kaleb with the evangelization of this interior province of Aksum.\n\nBesides several inscriptions bearing his name, Axum also contains a pair of ruined structures, one said to be his tomb and its partner said to be the tomb of his son, Gabra Masqal. (Tradition gives him a second son, Israel, who, it has been suggested, is identical with king Israel of Axum.) This structure was first examined as an archaeological subject by Henry Salt in the early 19th century; almost a century later, it was partially cleared and mapped out by the Deutsche Aksum-Expedition in 1906. The most recent excavation of this tomb was in 1973 by the British Institute of Eastern Afri",
  "fetched_at": "2026-02-09T05:47:03.206565"
}