{
  "url": "https://en.wikipedia.org/wiki/Skull_and_Bones",
  "title": "Skull and Bones",
  "text": "Skull and Bones (also known as The Order, Order 322 or The Brotherhood of Death) is an undergraduate senior secret student society at Yale University in New Haven, Connecticut. Skull and Bones is considered one of the \"Big Three\" and \"Ancient Eight\" at Yale University. The oldest senior-class society at the university, Skull and Bones has become a cultural institution known for its powerful alumni and conspiracy theories.\n\n\n== History ==\n\n\n=== 19th century ===\nSkull and Bones was founded in December 1832 after a dispute among Yale debating societies Linonia, Brothers in Unity, and the Calliopean Society over that season's Phi Beta Kappa awards. William Huntington Russell and Alphonso Taft co-founded \"The Order of the Skull and Bones\". The first senior members included Russell, Taft, and thirteen other members.\nThe first extended description of Skull and Bones, published in 1871 by Lyman Bagg in his book Four Years at Yale, noted that \"the mystery now attending its existence forms the one great enigma which college gossip never tires of discussing.\"\nIn a 1974 book, Brooks Mather Kelley attributed the interest in Yale senior societies to the fact that underclassmen members of then freshman, sophomore, and junior class societies returned to campus the following years and could share information about society rituals, while graduating seniors were, with their knowledge of such, at least a step removed from campus life.\nSince its founding, Skull and Bones annually selects fifteen junior class members to join the society. Skull and Bones selects new members among students every spring as part of Yale University's \"Tap Day\", and has done so since 1879. It taps those it views as campus leaders and other notable figures for its membership. \n\n\n=== 20th century ===\nIn the 1960s, secret societies adapted in response to criticism for elitism and discrimination. Skull and Bones admitted its first black member in 1965, and the president of Yale's gay student organization in 1975.\nYale became coeducational in 1969, prompting some other secret societies such as St. Anthony Hall to transition to co-ed membership, yet Skull and Bones remained fully male until 1992. The Bones class of 1971's attempt to tap women for membership was opposed by Bones alumni, who dubbed them the \"bad club\" and quashed their attempt. \"The issue\", as it came to be called by Bonesmen, was debated for decades.\nThe class of 1991 tapped seven female members for membership in the next year's class, causing conflict with the alumni association. The trust changed the locks on the Tomb and the Bonesmen instead met in the Manuscript Society building. A mail-in vote by members decided 368–320 to permit women in the society, but a group of alumni led by William F. Buckley obtained a temporary restraining order to block the move, arguing that a formal change in bylaws was needed. Other alumni, such as John Kerry and R. Inslee Clark, Jr., spoke out in favor of admitting women. The dispute was highlighted on an editorial page of The New York Times. A second alumni vote, in October 1991, agreed to accept the Class of 1992, and the lawsuit was dropped.\n\n\n=== 21st century ===\nIn recent years, Skull and Bones, like other elite Yale institutions, \"utterly transformed\", according to The Atlantic. The society tapped its first entirely non-white class in 2020. Few descendants of alumni get in, and progressive activism is an asset. The class of 2021 admitted no conservatives.\nSkull and Bones is of the \"Big Three,\" which includes Scroll and Key and Wolf's Head, and the \"Ancient Eight\" which includes Book and Snake, Elihu, Berzelius, Mace and Chain, and St. Elmo’s.\n\n\n== Symbols and traditions ==\nThe society's badge is gold and consists of a skull that is supported by crossed bones, with the number 322 on the lower jaw. Its members worshipped Eulogia, a fictional goddess of eloquence. Nicknames for Skull and Bones are The Order, Order 322, and The Brotherhood of Death. The society is known info",
  "fetched_at": "2026-02-09T05:19:33.315375"
}