{
  "url": "https://en.wikipedia.org/wiki/Deuterocanonical_books",
  "title": "Deuterocanonical books",
  "text": "The deuterocanonical books, meaning 'of, pertaining to, or constituting a second canon',  collectively known as the Deuterocanon (DC), are certain books and passages considered to be canonical books of the Old Testament by the Catholic Church, the Eastern Orthodox Church, the Oriental Orthodox Church, and the Church of the East. In contrast, modern Rabbinic Judaism and Protestantism regard the DC as Apocrypha.\nSeven books are accepted as deuterocanonical by all the ancient churches: Tobit, Judith, Baruch with the Letter of Jeremiah, Sirach or Ecclesiasticus, Wisdom, First and Second Maccabees and also the Greek additions to Esther and Daniel. In addition to these, the Eastern Orthodox Church and the Oriental Orthodox Church include other books in their canons.\nThe deuterocanonical books are included in the Septuagint, the earliest extant Greek translation of the Hebrew Bible. They date from 300 BC to 100 AD, before the separation of the Christian church from Judaism, and they are regularly found in old manuscripts and cited frequently by the Church Fathers, such as Clement of Rome, Clement of Alexandria, Origen, Irenaeus, and Tertullian.\nAccording to the Gelasian Decree, the Council of Rome (382 AD) defined a list of books of scripture as canonical. It included most of the deuterocanonical books.  Patristic and synodal lists from the 200s, 300s and 400s usually include selections of the deuterocanonical books.\n\n\n== List of deuterocanonicals ==\n\nCanonical for the Catholic Church, the Eastern Orthodox Church, the Oriental Orthodox Church, and the Church of the East:\n\nTobit\nJudith\nBaruch including the Letter of Jeremiah (Baruch chapter 6)\nSirach (or Ecclesiasticus)\n1 Maccabees\n2 Maccabees\nWisdom\nGreek additions to Esther\nGreek additions to Daniel\nCanonical only for the Eastern Orthodox Church and the Oriental Orthodox Church:\n\nPrayer of Manasseh\n1 Esdras\n2 Esdras\n3 Maccabees\n4 Maccabees as an appendix\nPsalm 151\n\n\n=== Dates of composition ===\n\n\n== Historical background ==\n\nDeuterocanonical is a term coined in 1566 by the theologian Sixtus of Siena, who had converted to Catholicism from Judaism, to describe scriptural texts considered canonical by the Catholic Church, but which recognition was considered \"secondary\". For Sixtus, this term included portions of both Old and New Testaments. Sixtus considers the final chapter of the Gospel of Mark to be deuterocanonical. He also applies the term to the Book of Esther from the canon of the Hebrew Bible.\nThe term was then taken up by other writers to apply specifically to those books of the Old Testament which had been recognised as canonical by the Councils of Rome (382 AD), Hippo (393 AD), Carthage (397 AD and 419 AD), Florence (1442 AD) and Trent (1546 AD), but which were not in the Hebrew canon.\nForms of the term “deuterocanonical” were adopted after the 16th century by the Eastern Orthodox Church to denote canonical books of the Septuagint not in the Hebrew Bible, a wider selection than that adopted by the Council of Trent, and also by the Ethiopian Orthodox Tewahedo Church to apply to works believed to be of Jewish origin translated in the Old Testament of the Ethiopic Bible, a wider selection still.\nThe acceptance of some of these books among early Christians was widespread, though not universal, and surviving Bibles from the early Church always include, with varying degrees of recognition, books now called deuterocanonical. Some say that their canonicity seems not to have been doubted in the Church until it was challenged by Jews after 100 AD, sometimes postulating a hypothetical Council of Jamnia. Regional councils in the West published official canons that included these books as early as the 4th and 5th centuries.\nThe Catholic Encyclopedia states:\n\nThe official attitude of the Latin Church, always favourable to them, kept the majestic tenor of its way. Two documents of capital importance in the history of the canon constitute the first formal utterance of papal authority on th",
  "fetched_at": "2026-02-09T02:44:54.208726"
}