{
  "url": "https://en.wikipedia.org/wiki/Characters_of_the_Tekken_series",
  "title": "Characters of the Tekken series",
  "text": "Bandai Namco Entertainment's Tekken media franchise is known for its diverse cast of characters hailing from various nationalities, all coming together to compete in the King of Iron Fist tournament. In addition to the human characters, Tekken also features non-human characters for comic relief, such as the bear Kuma, his love interest Panda, the boxing kangaroo Roger, and the dinosaur Alex. Certain characters like Jin Kazama, Kazuya Mishima, Lee Chaolan, and Jun Kazama have their own alternative versions. Each character has their own goals for participating in the tournament.\n\n\n== Character appearances ==\nOnly four characters have been playable in all eight main Tekken games to date. Three were featured at launch: Nina Williams, Paul Phoenix and Yoshimitsu. The other character was Heihachi Mishima, who became playable but outside the main roster as paid downloadable content in Tekken 8. Of the four, only Nina and Paul are playable in all the side games as well. King and Kuma have also been playable in all the main games, but as two different characters. Four characters, Anna Williams, Kazuya Mishima, Lee Chaolan and Marshall Law, would come close, having been playable in seven main games. The JACK series have also been playable in seven main games in different iterations.\n\n\n=== Table ===\nComparison table\n Yes  = Playable by default.\n Yes  = Playable via update or unlockable.\n Costume  /  Costume  = Playable, whether by default, unlockable, or via update, but as a palette swap or in-battle transformation of another character instead of a standalone character.\n DLC  = Paid downloadable content (except TTT2).\n Guest  = Third-party character.\n NPC  = Non-playable character.\n Cameo  = Cameo appearance.\n ?  = To be confirmed.\n No  = Not included.\n+ = Including the update games.\n\nNotes:\n^ Not including arcade history mode of Tekken 5 and gallery mode of Tekken 7 and Tekken 8.\n^1 NPC in Tekken 5 and Tekken 5: DR (PSP, arcade, and online only)/Unlockable in Tekken 5:DR (PS3 and offline only)\n^2 Only in Tekken 5: DR.\n^3 Only in Tekken 6: BR (arcade and console).\n^4 Playable in a campaign level.\n^5 Only in Tekken 7: FR (arcade and console)/Round 2.\n^6 Only playable in story mode for a short amount of time in the console version.\n^7 Only in Devil Within mode.\n^8 Not playable or available in Round 2.\n^9 As King I/Kuma I.\n^10 As King II/Kuma II.\n^11 Only playable in story mode in The Dark Awakens.\n^12 Unlockable if not selected in Adventure Mode.\n^13 Only playable in Fight Lab mode for the prologue.\n\n\n== Introduced in Tekken ==\n\n\n=== Anna Williams ===\n\n\n=== Armor King I/II ===\nNationality: Unknown (both)\nFighting style: Pro-Wrestling (US style, Armor King I) / Pro-Wrestling (JP style, Armor King II)\nArmor King (アーマー・キング, Āmā Kingu) is a professional wrestler and was a rival of King when the latter was still an inexperienced wrestler. He suffered eye damage in a fight with King, but when he later found King distraught and drunk in an alleyway, Armor King convinced him to get back into fighting and enter the second King of Iron Fist tournament. After King is killed by Ogre, Armor King trains a new fighter who sports a jaguar mask similar to that of King's. Armor King is not selectable in Tekken 4, as he is beaten to death in a bar fight instigated by Australian brawler Craig Marduk, who then steals his mask and mockingly wears it in the tournament, provoking Armor King's protege King into entering the competition to seek revenge. Marduk is then attacked in Tekken 5 by what is believed to be Armor King, but his assailant is revealed in Tekken 6 as the original Armor King's younger brother. After recovering from a brutal beating where he and Marduk knocked out each other and brought to hospital by King, the younger Armor King accepts Marduk's challenge for a retirement match arranged by King in Tekken 7.\nOthers appearances (Armor King II):\n\nTekken 3D: Prime Edition\n\n\n=== Ganryu ===\nNationality:  Japanese\nFighting style: Sumo\nVoiced by:Banjō Gi",
  "fetched_at": "2026-02-09T05:21:01.986799"
}