{
  "url": "https://en.wikipedia.org/wiki/Nephilim",
  "title": "Nephilim",
  "text": "The Nephilim (; Hebrew: נְפִילִים, romanized: Nəfīlīm) are mysterious beings or humans mentioned in the Bible, traditionally understood as being of great size and strength, or alternatively beings of great power and authority. The origins of the Nephilim are unclear. Some writers, including the author of the Book of Enoch, view them as the offspring of rebellious angels and humans. Others view them as descendants of Seth and Cain.\nThe first biblical reference to them is in Genesis 6:4, but verses 1-4 are ambiguous and the identity of the Nephilim is disputed. According to Numbers 13:33, ten of the Twelve Spies report the existence of Nephilim in Canaan prior to its conquest by the Israelites. A similar or identical Biblical Hebrew term, read as \"Nephilim\" by some scholars and as the word \"fallen\" by others, appears in Ezekiel 32:27 and is also mentioned in the deuterocanonical books Judith 16:6, Sirach 16:7, Baruch 3:26–28, and Wisdom 14:6.\nThe term Nephilim is often translated as \"giants\", though its exact meaning remains debated. The Brown–Driver–Briggs lexicon defines it as \"giants\" but warns that all proposed etymologies are uncertain. Many scholars connect the word to the Hebrew root n-p-l (\"to fall\"), interpreting Nephilim as either \"fallen ones\" or \"those who cause others to fall\". Ancient translations differ: the Septuagint, Vulgate, and several Targumim rendered it as \"giants,\" while others interpreted it as \"violent ones\" or \"those who attack\".\nInterpretations vary widely across traditions. Second Temple texts like 1 Enoch and Jubilees depict the Nephilim as offspring of fallen angels (Watchers) and human women, portraying them as evil giants whose corruption led to the flood described in the book of Genesis. Early Christian and Jewish sources split between angelic, human, and hybrid explanations: some viewed them as descendants of Seth intermarrying with Cain's line, while others upheld the fallen angel theory, later supported by the Dead Sea Scrolls. Islamic tradition links them to the giant tribe of ʿĀd, while other theories associate them with Sumerian Apkallu myths or elite Canaanite warriors. Over time, the Nephilim have been reimagined in popular culture, appearing in novels, films, video games, and conspiracy theories, where they are often depicted as powerful hybrids, ancient gods, or remnants of a lost superhuman race.\n\n\n== Etymology ==\nThe Brown-Driver-Briggs Lexicon (1908) gives the meaning of Nephilim as \"giants\", and warns that proposed etymologies of the word are \"all very precarious\". Many suggested interpretations are based on the assumption that the word is a derivative of Hebrew verbal root n-p-l (נ־פ־ל) \"fall\". Girdlestone (1871, p. 91) argued  the word comes from the hif'il causative stem, possibly indicating that the name 'Nephilim' is to be understood as 'those that cause others to fall down'. Ronald Hendel states that it is a passive form: 'Ones who have fallen', grammatically analogous to paqid 'one who is appointed' (i.e., a deputy or overseer), asir 'one who is bound' (i.e., a prisoner). It is also argued that the \"fallen\" refer to those who \"fell in battle\", similar to the gibborim.\nThe majority of ancient biblical translations – including the Septuagint, Theodotion, Latin Vulgate, Samaritan Targum, Targum Onkelos, and Targum Neofiti – interpret the word to mean \"giants\". Symmachus translates it as \"the violent ones\" and Aquila's translation has been interpreted to mean either \"the fallen ones\" or \"the ones falling [upon their enemies].\"\n\n\n== Origins of belief ==\nArchaeologist G.E. Wright states that belief in the Nephilim, especially as giants, originated from the Hebrews’ contemplation of Transjordian megalithic structures and cyclopean masonry walls of Canaanite cities, with some being 18 feet thick. Nonetheless, he notes that ancient Canaanites were relatively short, before and after 3000 BC, with no significant findings of abnormally sized aborigines. Biblical professor Brian R. Doak ",
  "fetched_at": "2026-02-09T05:20:50.272142"
}