{
  "url": "https://en.wikipedia.org/wiki/Book_of_Mysteries_(Manichaeism)",
  "title": "Book of Mysteries (Manichaeism)",
  "text": "The Book of Mysteries, also known as The Book of Secrets (Greek Transliteration: Ta tōn mustērion; Coptic transliteration: Pjōme nmmusterion; Arabic transliteration: Sifr al-asrar), is one of the Seven Scriptures of Manichaeism. This scripture is transliterated in Chinese as \"阿罗瓒部\" (Āluózànbù) in Yilue, transliterated from the Middle Persian \"rãzãn\", meaning \"Secret\" (Secrets).\nIt may take the form of a \"treatise de anima\" based around the nature of the soul, or otherwise as an exegetical work\nIn the Manichaean canon, the Pragmateia, the Book of Mysteries, and the Book of Giants are grouped together. It makes extensive use of Christian apocryphal traditions and was written in opposition to a similar book written by Bardaisan, as a rebuttal to his take on the mysteries.\n\n\n== Contents ==\nNo preserved fragments of this scripture have been found, and there is limited knowledge of its contents. Ibn al-Nadim lists the titles of the eighteen chapters of this scripture in his \"Description of the Group of Books.\n\n\"Talks about Daysānīyūn\" (or \"An Account of the Daysanites\"): generally considered to refer to the Gnosticism of Pakistan.\n\"Hystaspes' Testimony on the Beloved\": Hystaspes was a Zoroastrian king who was converted to Zoroastrianism, and Mani might use this kind of apocalyptic literature to explain himself and his theology.\n\"Jacob's words about the soul\": Mani may quote the words about the angel Jacob in \"Joseph's Prayer\" in this chapter to support his myth.\n\"The Widow's Son\"\n\"The words of Jesus about his soul preached by Judas\": Mani may quote the record in the \"Gospel of Thomas\".\n\"The Beginning of Witness After the Victory of the Righteous\": \"The Righteous\" may refer to Enoch, and this chapter may be related to the Book of Enoch.\n\"Seven Spirits\": Discusses the incarnation of the dark power associated with the seven stars.\n\"Four Spirits\": Discusses the incarnation of the dark power associated with the four seasons.\n\"Taking\" or \"Mockery\": This may describe the ridicule of Mani by the cultists and the bewildered.\n\"Adam's Testimony about Jesus\": Quoting from \"Adam Revelation\" to prove the prophetic inheritance from Adam to Jesus.\n\"Resistance from the Fall of Religion\"\n\"Doctrine of the Daysanites [= Bardesanites] Regarding the Soul and the Body\"\n\"Refutation of the Bardesanites Concerning the Living Soul\"\n\"Three Ways\" or \"Three Trenches\": Discusses the formation of the universe and the \"three plagues\" that imprison the dark demons.\n\"Construction and Maintenance of the Universe\": tells the story of the world created by Net Wind.\n\"Three Days\": Discusses three bright days and two dark nights without light.\n\"The Prophets\": Satirizes the miracles performed by false prophets, and satirizes astrologers.\n\"The Last Judgment\": Discusses the scene of the Last Judgment Day.\n\n\n== See also ==\nMani\nSeven Sutras of Mani\nManichaeism\n\n\n== References ==",
  "fetched_at": "2026-02-09T06:16:11.060566"
}