{
  "url": "https://en.wikipedia.org/wiki/Problem_of_two_emperors",
  "title": "Problem of two emperors",
  "text": "The problem of two emperors or two-emperor problem (deriving from the German term Zweikaiserproblem) is the historiographical term for the historical contradiction between the idea of the universal empire, that there was only ever one true emperor at any one given time, and the truth that there were often multiple individuals who claimed the position simultaneously. The term is primarily used in regards to medieval European history and often refers to in particular the long-lasting dispute between the Byzantine emperors in Constantinople and the Holy Roman emperors in modern-day Germany and Austria as to which monarch represented the legitimate Roman emperor.\nSince the collapse of the Western Roman Empire during late antiquity, the Byzantine Empire had been recognized as the legitimate Roman Empire by itself, the pope, and the various Christian kingdoms throughout Europe. This changed in 797 when Emperor Constantine VI was deposed and replaced as ruler by his mother, Empress Irene, whose rule was not accepted in Western Europe. Pope Leo III proclaimed the king of the Franks, Charlemagne, as the emperor of the Romans in 800 under the concept of translatio imperii (transfer of imperial power). Although the two empires eventually recognized each other's rulers as emperors, they never explicitly recognized the other as \"Roman\". Over the centuries after Charlemagne's coronation, the dispute in regards to the imperial title was one of the most contested issues in Holy Roman–Byzantine politics. On occasion, the imperial title was claimed by neighbors of the Byzantine Empire, such as Bulgaria and Serbia, which often led to military confrontations. As the Byzantine emperors had large control over the Patriarchate of Constantinople (Caesaropapism), their rivals often declared their own patriarchates independent from it.\nAfter the Byzantine Empire was momentarily overthrown by the Catholic crusaders of the Fourth Crusade in 1204 and supplanted by the Latin Empire, the dispute continued even though both emperors now followed the same religious head for the first time since the dispute began. Though the Latin emperors recognized the Holy Roman emperors as the legitimate Roman emperors, they also claimed the title for themselves, which was not recognized by the Holy Roman Empire in return. Pope Innocent III eventually accepted the idea of divisio imperii (division of empire), in which imperial hegemony would be divided into West (the Holy Roman Empire) and East (the Latin Empire). Although the Latin Empire was destroyed by the resurgent Byzantine Empire under the Palaiologos dynasty in 1261, the Palaiologoi never reached the power of the pre-1204 Byzantine Empire and its emperors ignored the problem of two emperors in favor of closer diplomatic ties with the west. The problem of two emperors only fully resurfaced after the fall of Constantinople in 1453, after which the Ottoman sultan Mehmed II claimed the imperial dignity as Kayser-i Rûm (Caesar of the Roman Empire) and aspired to claim universal hegemony. The Ottoman sultans were recognized as emperors by the Holy Roman Empire in the 1533 Treaty of Constantinople, but the Holy Roman emperors were not recognized as emperors in turn. The Ottomans called the Holy Roman emperors by the title kıral (king) for one and a half centuries, until the Sultan Ahmed I formally recognized Rudolf II as an emperor in the Peace of Zsitvatorok in 1606, an acceptance of divisio imperii, bringing an end to the dispute between Constantinople and Western Europe. \nIn addition to the Ottomans, the Tsardom of Russia and the later Russian Empire also claimed the Roman legacy of the Byzantine Empire, with its rulers titling themselves as tsar (deriving from \"caesar\") and later imperator. Their claim to the imperial title and equal status was not recognized by the Holy Roman Empire until 1745 and by the Ottoman Empire until 1774. While the Holy Roman Empire dissolved in 1806, the Russian rulers continued to claim the",
  "fetched_at": "2026-02-09T05:36:06.467899"
}