{
  "url": "https://en.wikipedia.org/wiki/Timeline_of_incidents_involving_QAnon",
  "title": "Timeline of incidents involving QAnon",
  "text": "Since the movement's emergence in 2017, adherents of the QAnon far-right conspiracy theory have been involved in a number of controversial events, some of them violent, resulting in the filing of criminal charges and one conviction for terrorism.\n\n\n== 2018 ==\n\n\n=== Tucson cement plant incident ===\nIn May 2018, Michael Lewis Arthur Meyer livestreamed a Facebook video from the site of a Tucson cement plant, asserting, \"This is a child sex trafficking camp that no one wants to talk about, that no one wants to do nothing about.\" The video was viewed 650,000 times over the ensuing week. Tucson police inspected the plant without finding evidence of criminal activity. Meyer then occupied a tower on the property for nine days, until reaching agreement with police to leave. He later returned to the tower in July, whereupon he was arrested for trespassing. Meyer referenced QAnon and the #WWG1WGA hashtag on his Facebook page.\n\n\n=== Hoover Dam incident ===\n\nOn June 15, 2018, Matthew Phillip Wright of Henderson, Nevada, was arrested on terrorism and other charges for driving an armored truck, containing an AR-15 and handgun, to the Hoover Dam and blocking traffic for 90 minutes. He said he was on a mission involving QAnon: to demand that the Justice Department \"release the OIG report\" on the conduct of FBI agents during the investigation into Hillary Clinton's use of a private email server. Since a copy of the Office of the Inspector General report had been released the day before, the man had been motivated by a Q \"drop\" which claimed the released version of the report had been heavily modified and that Trump possessed a more damning version but had declined to release it. In video recorded inside his armored truck, Wright expressed disappointment that Trump had not honored a \"duty\" to \"lock certain people up\", asking him to \"uphold your oath\".\nAfter blocking traffic, Wright drove towards the Arizona side of the bridge, where his tires were flattened by police spike strips. He then surrendered to police after becoming stuck on a dirt road. Nobody was injured during the incident. At trial, Wright was found guilty, and on December 17, 2020, he was sentenced to seven years on a terrorism charge and nine months for unlawful flight, to be served consecutively.\n\n\n=== Targeting of Michael Avenatti ===\nOn July 29, 2018, Q posted a link to Stormy Daniels's attorney Michael Avenatti's website and photos of his Newport Beach, California, office building, along with the message, \"Buckle up!\" The anonymous poster then shared the picture of a still unidentified man, appearing to be holding a cellphone in one hand and a long, thin object in the other, standing in the street near Avenatti's office, adding that a message \"had been sent\". This sparked an investigation by the Newport Beach Police Department. On July 30, Avenatti asked his Twitter followers to contact the Newport Beach Police Department if they \"have any details or observed\" the man in the picture.\n\n\n=== Harassment of Jim Acosta ===\nAt a Trump rally in Tampa, Florida, on July 31, 2018, Trump supporters exhibited hostile behavior toward CNN chief White House correspondent Jim Acosta. Exponents of QAnon-related theories were at the rally.\nThe next day, David Martosko of the Daily Mail asked White House press secretary Sarah Huckabee Sanders whether the White House encouraged the support of \"QAnon fringe groups\". Sanders denounced \"any group that would incite violence against another individual\", without specifically responding to the QAnon mention. Sanders added that Trump \"certainly doesn't support groups that would support that type of behavior\".\n\n\n== 2019 ==\n\n\n=== Murder of James Wolfe ===\nOn January 8, 2019, a 26-year-old Seattle man stabbed his brother James Wolfe in the head with a 4-foot-long sword before calling 911 and confessing to the murder, saying he believed his brother was a lizard. During interrogation the man told detectives he saw lizards in the room and claimed that the dete",
  "fetched_at": "2026-02-09T06:10:44.233930"
}