{
  "url": "https://en.wikipedia.org/wiki/Saint_Christopher",
  "title": "Saint Christopher",
  "text": "Saint Christopher (Greek: Ἅγιος Χριστόφορος, romanized: Hágios Christóphoros, lit. 'Christ-bearer'; Latin: Sanctus Christophorus) is a legendary figure venerated by several Christian denominations as a martyr and saint. According to these traditions, he was killed in the reign of the 3rd-century Roman emperor Decius (r. 249–251), or alternatively under the emperor Maximinus Daia (r. 308–313). A church was dedicated to the saint in Chalcedon (near present-day Istanbul) as early as 452.  His veneration spread not only in the East but also to the West, where he is counted among the Fourteen Holy Helpers.\nOf the numerous legendary motifs, the one relating to his name — that of the Christ-bearer carrying the divine child across the river — is the best known today. The most famous legend connected to the saint recounts that after converting to Christianity, he devoted his life to carrying travelers across a river. One day he carried an unknown young boy across a river after which the boy revealed himself as Christ. Because of his help to travelers, he became the patron saint of travelers. In the iconography of the Western Church, the saint is often depicted as a giant with a staff carrying the infant Jesus across a river on his shoulders. Small images of him are often worn around the neck, on a bracelet, carried in a pocket, or placed in vehicles. The Eastern Church tradition depicts the saint as a cynocephalus ('dog-headed creature') in a literal interpretation of its legendary tradition.\n\n\n== Legend ==\nThere is no evidence for the historicity of the saint. Legends about the life and death of Saint Christopher first appeared in Greece in the 6th century and had spread to France by the 9th century. The 11th-century bishop and poet Walter of Speyer wrote a version of the legend. The most popular legendary accounts originate from the 13th-century Golden Legend.\n\nAccording to the legendary account of his life, Christopher was initially called Reprobus. He was a Canaanite, 5 cubits (7.5 feet (2.3 m)) tall and with a fearsome face. While serving the king of Canaan, he took it into his head to go and serve \"the greatest king there was\". He went to the king who was reputed to be the greatest, but one day he saw the king cross himself at the mention of the devil. On thus learning that the king feared the devil, he departed to look for the devil. He came across a band of marauders, one of whom declared himself to be the devil, so Christopher decided to serve him. But when he saw his new master avoid a wayside cross and found out that the devil feared Christ, he left him and enquired from people where to find Christ. He met a hermit who instructed him in the Christian faith. Christopher asked him how he could serve Christ. When the hermit suggested fasting and prayer, Christopher replied that he was unable to perform that service. The hermit then suggested that because of his size and strength Christopher could serve Christ by assisting people to cross a dangerous river, where they were perishing in the attempt. The hermit promised that this service would be pleasing to Christ.\n\nAfter Christopher had performed this service for some time, a little child asked him to take him across the river. During the crossing, the river became swollen and the child seemed as heavy as lead, so much that Christopher could scarcely carry him and found himself in great difficulty. When he finally reached the other side, he said to the child: \"You have put me in the greatest danger. I do not think the whole world could have been as heavy on my shoulders as you were.\" The child replied: \"You had on your shoulders not only the whole world but Him who made it. I am Christ your king, whom you are serving by this work.\" The child then vanished.\nChristopher later visited Lycia and there comforted the Christians who were being martyred. Brought before the local king, he refused to sacrifice to the pagan gods. The king tried to win him by riches and by sending two beaut",
  "fetched_at": "2026-02-09T05:56:05.508734"
}