{
  "url": "https://en.wikipedia.org/wiki/Chinese_character_description_languages",
  "title": "Chinese character description languages",
  "text": "Several systems have been proposed for describing the internal structure of Chinese characters, including their strokes, components, and the stroke order, and the location of each in the character's ideal square. This information is useful for identifying variants of characters that are unified into one code point by Unicode and ISO/IEC 10646, as well as to provide an alternative form of representation for rare characters that do not yet have a standardized encoding in Unicode. Many aim to work for regular script, as well as to provide the character's internal structure which can be used for easier look-up of a character by indexing the character's internal make-up and cross-referencing among similar characters.\n\n\n== CDL ==\nCharacter Description Language (CDL) is an XML-based declarative language co-created by Tom Bishop and Richard Cook for the Wenlin Institute. It defines characters by the arrangement of components, which are not required to reflect the semantic or etymological history of the character. In order for a component to fit into the allotted portion of the whole character's square, a set of fewer than 50 strokes allows one to construct approximately 1,000 components, which may in turn describe tens of thousands of characters.\n\n\n== Ideographic Description Sequences ==\n\nChapter 18 of The Unicode Standard (version 15.0) defines the \"Ideographic Description Sequences\" (IDS) syntax used to describe characters in featural terms, by arrangements of components with code points.  Sixteen special characters in the range U+2FF0..U+2FFF act as prefix operators to combine other characters or sequences to form larger characters.\n\nTwo additional ideographic description characters are scattered in other Unicode blocks. U+303E 〾 IDEOGRAPHIC VARIATION INDICATOR is not officially an ideographic description character, but is sometimes used in ideographic description sequences.\n\nThese sequences are useful in describing to the reader a character that is not directly printable, either because it is absent in a given font, or is absent from the Unicode standard altogether. For example, the sawndip character  encoded in CJK Unified Ideographs Extension F as U+2DA21 𭨡 can be described as ⿰書史. Another use is for dictionary lookup purposes, as a rough input method for queries.\nThese sequences can be rendered either by keeping the individual characters separately or by parsing the Ideographic Description Sequence and drawing the ideograph so described. They do not, by themselves, provide unambiguous rendering for all characters. For instance, the sequence ⿱十一 represents both ⼟ 'EARTH' with the middle bar being narrower, and ⼠ 'SCHOLAR' with the middle bar being wider.\nUnicode's specification for these sequences is based on the characters and syntax of the earlier GBK encoding. Additional symbols are later encoded to fill in the missing combinations.\nThe IDSgrep free software package by Matthew Skala extends Unicode's IDS syntax to include additional features for dictionary lookup; it is capable of converting KanjiVG's database to its own extended IDS format, or of searching EIDS files generated by the related Tsukurimashou font family.\n\n\n== See also ==\nChinese character structures\nChinese character internal structures\nList of Shuowen Jiezi radicals\nList of Kangxi radicals\nList of Unicode radicals\nCangjie input method\nRadical\nStroke\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Works cited ===",
  "fetched_at": "2026-02-09T05:31:02.274107"
}