{
  "url": "https://en.wikipedia.org/wiki/Devil",
  "title": "Devil",
  "text": "A devil is the mythical personification of evil as it is conceived in various cultures and religious traditions. It is seen as the objectification of a hostile and destructive force. Jeffrey Burton Russell states that the different conceptions of the devil can be summed up as 1) a principle of evil independent from God, 2) an aspect of God, 3) a created being turning evil (a fallen angel) or 4) a symbol of human evil.\nEach tradition, culture, and religion with a devil in its mythos offers a different lens on manifestations of evil. The history of these perspectives intertwines with theology, mythology, psychiatry, art, and literature, developing independently within each of the traditions. It occurs historically in many contexts and cultures, and is given many different names—Satan (Judaism), Lucifer (Christianity), Beelzebub (Judeo-Christian), Mephistopheles (German), Iblis or Azazil (Islam)—and attributes: it is portrayed as blue, black, or red; it is portrayed as having horns on its head, and without horns, and so on.\n\n\n== Etymology ==\nThe Modern English word devil derives from the Middle English devel, from the Old English dēofol, that in turn represents an early Germanic borrowing of the Latin diabolus. \nThis in turn was borrowed from the Greek διάβολος diábolos, \"slanderer\".\nThe word devil in today's Farsi is pronounced as dev or div. In the Shahnameh they are mentioned as guardians of the Caspian Sea.\n\n\n== Definitions ==\nIn his book The Devil: Perceptions of Evil from Antiquity to Primitive Christianity, Jeffrey Burton Russell discusses various meanings and difficulties that are encountered when using the term devil.  He does not claim to define the word in a general sense, but he describes the limited use that he intends for the word in his book—limited in order to \"minimize this difficulty\" and \"for the sake of clarity\". In this book Russell uses the word devil as \"the personification of evil found in a variety of cultures\", as opposed to the word Satan, which he reserves specifically for the figure in the Abrahamic religions.\nYvonne Bonnetain describes the Devil as a mythic explanation model, in form of a personified supernatural power, for death, disease, and everything hostile to humanity.\nIn the Introduction to his book Satan: A Biography, Henry Ansgar Kelly discusses various considerations and meanings that he has encountered in using terms such as devil and Satan, etc. While not offering a general definition, he describes that in his book \"whenever diabolos is used as the proper name of Satan\", he signals it by using \"small caps\".\nThe Oxford English Dictionary has a variety of definitions for the meaning of \"devil\", supported by a range of citations: \"Devil\" may refer to Satan, the supreme spirit of evil, or one of Satan's emissaries or demons that populate Hell, or to one of the spirits that possess a demoniac person; \"devil\" may refer to one of the \"malignant deities\" feared and worshiped by \"heathen people\", a demon, a malignant being of superhuman powers; figuratively \"devil\" may be applied to a wicked person, or playfully to a rogue or rascal, or in empathy often accompanied by the word \"poor\" to a person—\"poor devil\".\n\n\n== History ==\n\n\n=== Pre-Historic period to Archaic period ===\nMost early belief-systems had no unifying concept of evil. In the oldest available records, evil is part of nature. In Mesopotamia, evil is sometimes said to derive from primordial chaos, but there are no inherently evil demons or devils. Various spirits and deities could do both good and evil depending on whim. The oldest known Egyptian beliefs had no evil deities; the gods were morally ambivalent and required to submit to the divine order of the cosmos, evil being an action violating said harmony. In old Hindu beliefs, deities, reflecting the supreme reality, are both benevolent and fierce. Even in the Old Testament, the evil, and hence devilish characteristics, are an expression of Yahweh's wrath. Among ancient Middle Eastern ",
  "fetched_at": "2026-02-09T05:35:14.154578"
}