{
  "url": "https://en.wikipedia.org/wiki/List_of_God_of_War_characters",
  "title": "List of God of War characters",
  "text": "The characters of the God of War video game franchise belong to a fictional universe based on Greek mythology and Norse mythology. As such, the series features a range of traditional figures, including those from Greek mythology, such as the Olympian Gods, Titans, and Greek heroes, and those from Norse mythology, including the Æsir and Vanir gods and other beings. A number of original characters have also been created to supplement storylines.\nThe overall story arc focuses on the series' primary playable single-player character, the protagonist Kratos, a Spartan warrior haunted by visions of himself accidentally killing his wife and child. The character finally avenges his family by killing his former master and manipulator, Ares, the God of War. Although Kratos became the new God of War, he was still plagued by nightmares and eventually betrayed by Zeus, the King of the Olympian Gods—revealed by the goddess Athena to be Kratos' father. The constant machinations of the gods and Titans and their misuse of Kratos eventually drove him to destroy Mount Olympus. Many years following the destruction of Olympus, Kratos ended up in ancient Scandinavia in the realm of Midgard fathering a son named Atreus (known to prophecy as Loki) with the Jötunn warrior Faye. Their journey to keep a promise to the boy's late mother ended with Kratos and Atreus becoming enemies to the Norse gods, and ultimately set about the events of Ragnarök, a catastrophic event that the Allfather Odin was desperate to prevent, but ultimately ends with Odin's death and the destruction of Asgard. After facing the trials of Valhalla, Kratos finally comes to terms with his past and becomes the new Norse God of War, championing the ideals of hope.\nGod of War (2005), created by Sony's Santa Monica Studio, was the inaugural game in the series, the main part of which continued with God of War II (2007), God of War III (2010), and series prequel Ascension (2013); and side games Betrayal (2007), Chains of Olympus (2008), and Ghost of Sparta (2010). These seven games comprised the Greek era of the series. The Norse era began with the sequel to God of War III, which is also titled God of War (2018) and concluded with Ragnarök (2022), which received an epilogue in the form of an expansion pack titled Valhalla (2023). The God of War mythos expanded into literature, with a novelization of the original God of War published in 2010, and a six-issue comic series (2010–11) that introduced new characters and plot developments, telling a parallel story of Kratos's present and past, taking place immediately after the 2005 installment while also exploring a journey from when he was a Spartan soldier prior to his pledge to Ares. A novelization of God of War II was published in 2013. A prequel graphic novel titled Rise of the Warrior (2012–13) was released in the lead up to Ascension and is the backstory of the player's multiplayer character. To go along with the 2018 installment, a text-based game, A Call from the Wilds, a short prequel story about Atreus's first adventure into the wilderness, was released in February 2018, followed by a novelization in August, and then a two-volume comic series (2018–2019; 2021), with the first volume showing Kratos just before the 2018 installment, trying to settle down in the Norse world with his new wife Faye and their son Atreus, while the second volume follows Kratos's journey from ancient Greece to Norway after God of War III.\nGod of War has become a highly lucrative franchise on account of the commercial and critical success of the series. Products include action figures, artwork, clothing, Slurpee cups, sweepstakes, and special edition video game consoles. The character of Kratos received positive comments from reviewers, with his original Greek variation described as a \"sympathetic antihero\" by GameSpy. Game Guru claimed \"Practically anyone, even if they hadn't played any of the God of War games, would know about Kratos\". Several reviewers have",
  "fetched_at": "2026-02-09T05:19:33.994705"
}