{
  "url": "https://en.wikipedia.org/wiki/Devil_in_Christianity",
  "title": "Devil in Christianity",
  "text": "In Christianity, the Devil, also known as Satan, is a malevolent entity that deceives and tempts humans. Frequently viewed as the personification of evil, he is traditionally held to have rebelled against God in an attempt to become equal to God himself. He is said to be a fallen angel, who was expelled from Heaven at the beginning of time, before God created the material world, and is in constant opposition to God. The Devil is identified with several other figures in the Bible including Lucifer, Satan, the serpent in the Garden of Eden, the tempter of the Gospels, Leviathan, Beelzebub, and the dragon in the Book of Revelation.\nEarly scholars discussed the role of the Devil. Scholars influenced by neoplatonic cosmology, like Origen and Pseudo-Dionysius, portrayed the Devil as representing deficiency and emptiness, the entity most remote from the divine. According to Augustine of Hippo, the realm of the Devil is not nothingness, but an inferior realm standing in opposition to God. The standard medieval depiction of the Devil goes back to Gregory the Great. He integrated the Devil, as the first creation of God, into the Christian angelic hierarchy as the highest of the angels (either a cherub or a seraph) who fell far, into the depths of hell, and became the leader of demons.\nSince the early Reformation period, the Devil has been imagined as an increasingly powerful entity, with not only a lack of goodness but also a conscious will against God, his word, and his creation. Simultaneously, some reformists have interpreted the Devil as a mere metaphor for humans' inclination to sin, thereby downgrading his importance. While the Devil has played no significant role for most scholars in the modern era, he has become important again in contemporary Christianity.\nAt various times in history, certain Gnostic sects such as the Cathars and the Bogomils, as well as theologians like Marcion and Valentinus, have believed that the Devil was involved in creation. Today these views are not part of mainstream Christianity.\n\n\n== Old Testament ==\n\n\n=== Satan in the Old Testament ===\n\nThe Hebrew term śāṭān (Hebrew: שָּׂטָן) was originally a common noun meaning \"accuser\" or \"adversary\" that was applicable to both human and heavenly adversaries. The term is derived from a verb meaning primarily \"to obstruct, oppose\". Throughout the Hebrew Bible, it refers most frequently to ordinary human adversaries. Such verses include 1 Samuel 29:4; 2 Samuel 19:22; 1 Kings 5:4; 1 Kings 11:14, 23, 25; and Psalms 109:6. However, Numbers 22:22 and 32 use the same term to refer to the angel of the Lord. This concept of a heavenly being as an adversary to humans evolved into the personified evil of \"a being with agency\" called the Satan 18 times in Job 1–2 and Zechariah 3.\nBoth Hebrew and Greek have definite articles that are used to differentiate between common and proper nouns, but they are used in opposite ways: in Hebrew, the article designates a common noun, whereas in Greek, the article signals an individual's name (a proper noun). For example, in the Hebrew book of Job, one of the angels is referred to as a satan, \"an adversary\", but in the Greek Septuagint, which was used by the early Christians, whenever \"the Satan\" (Ha-Satan) appears with a definite article, it specifically refers to the individual known as the heavenly accuser whose personal name is Satan. In some cases it is unclear which is intended.\nHenry A. Kelly says that \"almost all modern translators and interpreters\" of 1 Chronicles 21:1 (in which satan occurs without the definite article) agree the verse contains \"the proper name of a specific being appointed to the office of adversary\". Thomas Farrar writes that \"In all three cases, satan was translated in the Septuagint as diabolos, and in the case of Job and Zechariah, with ho diabolos (the accuser; the slanderer). In all three of these passages there is general agreement among Old Testament scholars that the referent of the word satan is an ang",
  "fetched_at": "2026-02-09T05:31:05.154363"
}