{
  "url": "https://en.wikipedia.org/wiki//pol/",
  "title": "/pol/",
  "text": "/pol/, short for Politically Incorrect, is an anonymous political discussion imageboard on 4chan, created in 2011. As of 2022, it was the most active board on the site. It has had a substantial impact on Internet culture. It has acted as a platform for far-right extremism; the board is well known for its widespread racist, white supremacist, antisemitic, Islamophobic, misogynist, and anti-LGBTQ content. /pol/ has been linked to various acts of real-world extremist violence. It has been described as one of the \"⁠[centers] of 4chan mobilization\", a title also ascribed to /b/.\n\n\n== Overview ==\n\nCommon /pol/ content involves discussion of history, far-right ideologies, hatred of transgender people and homosexuals, hatred of black people, hatred and sexual exploitation of women and girls and current events. A 2020 report categorized about 36% of news sources frequently posted to the board by American users as \"junk news\", a category that includes sources considered to be propaganda, sensationalist, or conspiracy theory content. Outside of traditional news sources, users also commonly rely on alternative media such as YouTube commentary as a source of news.\nFlags are displayed on each post. A national flag corresponding to the user's geographic location based on their IP address may be displayed. Alternatively, users may select a \"meme flag\" (also referred to as a \"troll flag\"), corresponding to various political identifiers. However, these are not common per amount of posts—the \"Nazi\" meme flag was the most commonly used meme flag in a 2020 analysis, while posts with an American geographic location were about 57 times more common (and appeared the most of any flag).\nEach post also has a unique ID attached, which is likewise associated with the user's IP address. However, these unique IDs will only tend to remain attached to a user per a single thread, as they are not persistent between multiple threads. Threads have a limited lifespan, effectively prioritizing newer content.\nMuch of the content on /pol/ relies heavily on Internet memes to further spread ideas. Many have questioned the sincerity of users on /pol/ as possible trolls. According to Mic, \"On a place like /pol/, there's no clear delineation between sincerity, irony and cynicism.\" First Monday commented that \"The creation of character-based archetypes is common on /pol/ and makes this online space semi-performative and semi-authentic.\"\nWhile 4chan's /pol/ board is the most popular board under the \"/pol/\" name, versions on other websites have existed. These include Kohlchan, 8chan (later 8kun), 16chan, Shitchan, and Endchan, with some less popular \"/pol/\" themed boards accessible through the Tor network on sites such as 9chan and Neinchan. However, 4chan's /pol/ board has become increasingly \"synonymous with 4chan as a whole\", according to New Media & Society.\n\n\n== History ==\nPrior to the creation of /pol/, there were two boards intended for discussing news that had been added and removed from the site. The first of these was /n/, which was added on 8 April 2006. It replaced /n/'s previous topic of animals and nature, which was moved to the /an/ board. /n/'s topic was changed to transportation on 19 February 2008, without moving the news topic to another board, effectively removing it.\nAnother news board, /new/, was later added on 25 January 2010. It was deleted a year later on 17 January 2011. According to 4chan's creator and ex-administrator Christopher Poole, this was because it had \"devolved into /stormfront/\". This was comparing /new/ to Stormfront, which is the oldest and largest Holocaust-denialist white supremacist site. The /new/ board was the direct predecessor to /pol/.\nAccording to Christine Lagorio-Chafkin, /pol/ was created by Poole \"to siphon off and contain the overtly xenophobic and racist comments and memes from other wings of 4chan.\" This has led to /pol/ acquiring the nickname of a \"containment board\", because its purpose is to keep far-right and genera",
  "fetched_at": "2026-02-09T05:48:11.351436"
}