{
  "url": "https://en.wikipedia.org/wiki/Christopher_Thornton",
  "title": "Christopher Thornton",
  "text": "Christopher Thornton (born March 29, 1967) is an American actor. He is known for his role as Kenny \"Shammy\" Shamberg in Magnum P.I., and has had numerous other film and television roles from 1990 to the present.\n\n\n== Early life and education ==\nThornton was born in New Orleans, Louisiana. His father was an amateur opera singer who appeared in local theater. Christopher appeared in several plays while majoring in theater at the University of New Orleans, but quit college after two years to relocate to Los Angeles and train at the Stella Adler Conservatory.\n\n\n== Career ==\nThornton made his first feature film appearance in the 1990 horror sequel Watchers II, playing a young man who gets his eyes gouged out by the mutant antagonist. Only two years later, at age 25, Thornton suffered a tragic accident while rock climbing which fractured two vertebrae and left him paralyzed from the waist down. He returned to mostly theater roles for the remainder of the 1990s. In 2000, he was cast to play Hamlet at the Lillian Theater in Los Angeles. Believed to be the first actor to ever play the iconic Shakespeare character in a wheelchair, Thornton's performance won rave reviews.\nThornton has gone on to appear in numerous film and television roles. He has recurred in TV series such as Any Day Now, Rules of Engagement and Vice Principals, and had guest roles in Curb Your Enthusiasm, Alias, Brothers & Sisters, My Name Is Earl, Grey's Anatomy and Will & Grace.  From 2018 to 2024, he played recurring character Kenny \"Shammy\" Shamberg, a Marine veteran paralyzed during a tour of duty in Iraq, on the CBS reboot of Magnum P.I.\nThornton was both writer and lead actor for the 2010 film Sympathy for Delicious, playing disc jockey \"Delicious\" Dean O'Dwyer.\n\n\n== Filmography ==\n\n\n=== Film ===\n\n\n=== Television ===\n\n\n== External links ==\nChristopher Thornton at IMDb\n\n\n== References ==",
  "fetched_at": "2026-02-09T05:21:01.739553"
}