{
  "url": "https://en.wikipedia.org/wiki/Boundary_layer_thickness",
  "title": "Boundary layer thickness",
  "text": "This page describes some of the parameters used to characterize the thickness and shape of boundary layers formed by fluid flowing along a solid surface.  The defining characteristic of boundary layer flow is that at the solid walls, the fluid's velocity is reduced to zero.  The boundary layer refers to the thin transition layer between the wall and the bulk fluid flow.  The boundary layer concept was originally developed by Ludwig Prandtl  and is broadly classified into two types, bounded and unbounded.  The differentiating property between bounded and unbounded boundary layers is whether the boundary layer is being substantially influenced by more than one wall.  Each of the main types has a laminar, transitional, and turbulent sub-type.  The two types of boundary layers use similar methods to describe the thickness and shape of the transition region with a couple of exceptions detailed in the Unbounded Boundary Layer Section. The characterizations detailed below consider steady flow but is easily extended to unsteady flow.\n\n\n== The bounded boundary layer description ==\nBounded boundary layers is a name used to designate fluid flow along an interior wall such that the other interior walls induce a pressure effect on the fluid flow along the wall under consideration.  The defining characteristic of this type of boundary layer is that the velocity profile normal to the wall often smoothly asymptotes to a constant velocity value denoted as ue(x).  The bounded boundary layer concept is depicted for steady flow entering the lower half of a thin flat plate 2-D channel of height H in Figure 1 (the flow and the plate extends in the positive/negative direction perpendicular to the x-y-plane).  Examples of this type of boundary layer flow occur for fluid flow through most pipes, channels, and wind tunnels. The 2-D channel depicted in Figure 1 is stationary with fluid flowing along the interior wall with time-averaged velocity u(x,y) where x is the flow direction and y is the normal to the wall.  The H/2 dashed line is added to acknowledge that this is an interior pipe or channel flow situation and that there is a top wall located above the pictured lower wall.  Figure 1 depicts flow behavior for H values that are larger than the maximum boundary layer thickness but less than thickness at which the flow starts to behave as an exterior flow.  If the wall-to-wall distance, H, is less than the viscous boundary layer thickness then the velocity profile, defined as u(x,y) at x for all y, takes on a parabolic profile in the y-direction and the boundary layer thickness is just H/2.\nAt the solid walls of the plate the fluid has zero velocity (no-slip boundary condition), but as you move away from the wall, the velocity of the flow increases without peaking, and then approaches a constant mean velocity ue(x).  This asymptotic velocity may or may not change along the wall depending on the wall geometry.  The point where the velocity profile essentially reaches the asymptotic velocity is the boundary layer thickness.  The boundary layer thickness is depicted as the curved dashed line originating at the channel entrance in Figure 1.  It is impossible to define an exact location at which the velocity profile reaches the asymptotic velocity.  As a result, a number of boundary layer thickness parameters, generally denoted as \n  \n    \n      \n        δ\n        (\n        x\n        )\n      \n    \n    {\\displaystyle \\delta (x)}\n  \n, are used to describe characteristic thickness scales in the boundary layer region.  Also of interest is the velocity profile shape which is useful in differentiating laminar from turbulent boundary layer flows.  The profile shape refers to the y-behavior of the velocity profile as it transitions to ue(x).\n\n\n=== The 99% boundary layer thickness ===\nThe boundary layer thickness, \n  \n    \n      \n        δ\n      \n    \n    {\\displaystyle \\delta }\n  \n,  is the distance normal to the wall to a point where the flow velocity has essenti",
  "fetched_at": "2026-02-09T02:44:54.023985"
}