{
  "url": "https://en.wikipedia.org/wiki/Scarab_(artifact)",
  "title": "Scarab (artifact)",
  "text": "Scarabs are amulets and impression seals shaped according to the eponymous beetles, which were widely popular throughout ancient Egypt. They survive in large numbers today, and through their inscriptions and typology, these artifacts prove to be an important source of information for archaeologists and historians of ancient Egypt, representing a significant body of its art.\nThough primarily worn as amulets and sometimes rings, scarabs were also inscribed for use as personal or administrative seals or were incorporated into other kinds of jewelry. Some scarabs were created for political or diplomatic purposes to commemorate or advertise royal achievements. Additionally, scarabs held religious significance and played a role in Egyptian funerary practices.\n\n\n== Dating and evolution ==\nLikely due to their connections to the Egyptian god Khepri, amulets in the form of scarab beetles became enormously popular in Ancient Egypt by the early Middle Kingdom (approx. 2000 BC) and remained popular for the rest of the pharaonic period and beyond.\nStarting in the middle Bronze Age, other ancient peoples of the Mediterranean and the Middle East imported scarabs from Egypt and also produced scarabs in Egyptian or local styles, especially in the Levant.\nBy the end of the First Intermediate Period (about 2055 BC) scarabs had become extremely common. They largely replaced cylinder seals and circular \"button seals\" with simple geometric designs. Throughout the period in which they were made, scarabs were often engraved with the names of pharaohs and other royal figures. In the Middle Kingdom, scarabs were also engraved with the names and titles of officials, to be used as official seals. During the New Kingdom and Third Intermediate Period, scarabs with short prayers or mottos became popular, though these scarabs are somewhat difficult to translate. There are also scarabs that depict hunting scenes.\n\n\n== Description and materials ==\n\nScarabs were typically carved or molded in the form of a scarab beetle (usually identified as Scarabaeus sacer) with varying degrees of naturalism but usually at least indicating the head, wing case and legs but with a flat base. The base was usually inscribed with designs or hieroglyphs to form an impression seal. They were usually drilled from end to end to allow them to be strung on a thread or incorporated into a swivel ring. The common length for standard scarabs is between 6 mm and 40 mm and most are between 10 mm and 20 mm. Larger scarabs were made from time to time for particular purposes, such as the commemorative scarabs of Amenhotep III.\nScarabs were generally either carved from stone, or molded from Egyptian faience, a type of Ancient Egyptian sintered-quartz ceramic. Once carved, they would typically be glazed blue or green and then fired. The most common stone used for scarabs was a form of steatite, a soft stone that becomes hard when fired (forming enstatite), or porcelain. In contrast, hardstone scarabs most commonly were composed of green jasper, amethyst and carnelian.\n\nFrom the late Old Kingdom onwards, scarab rings developed from simple scarabs tied to fingers with threads into rings with scarab bezels in the Middle Kingdom, and further into rings with cast scarabs in the New Kingdom, typically strung on gold wire rather than string. Bezels emerged during the Old Kingdom period, often as amulets which were meant to represent Ra, the Egyptian solar god. Scarabs used for jewelry and rings were often composed of glazed steatite, which was a popular medium in ancient Egypt, though the glaze on many of these rings has been eroded over time due to weathering.\nWhile the majority of scarabs would originally have been green or blue, much of the colored glazes have become discolored or erased by the elements over time, leaving most steatite scarabs appearing white or brown.\n\n\n== Religious and historical significance ==\nIn ancient Egypt, the Scarab Beetle was a highly significant symbolic representation of ",
  "fetched_at": "2026-02-09T02:44:53.796945"
}