{
  "url": "https://en.wikipedia.org/wiki/Kellogg's",
  "title": "Kellogg's",
  "text": "The Kellogg Company, doing business as Kellogg's, was an American multinational food manufacturing company headquartered in Battle Creek, Michigan, United States. Kellogg's produced cereal and convenience foods, including crackers and toaster pastries, and marketed their products by several well-known brands including Corn Flakes, Rice Krispies, Frosted Flakes, Pringles, Eggo, and Cheez-It. As of 2018, Kellogg's mission statement was \"Nourishing families so they can flourish and thrive.\"\nKellogg's products were manufactured and marketed in over 180 countries. Kellogg's largest factory was at Trafford Park in Trafford, Greater Manchester, United Kingdom, which was also the location of its UK headquarters. Other corporate office locations outside of Battle Creek included Chicago, Dublin (European Headquarters), Shanghai, and Querétaro City. Kellogg's held a Royal Warrant from Queen Elizabeth II until her death in 2022.\nIn October 2023, the company changed its name to Kellanova, and spun off some assets into WK Kellogg Co. The companies have been acquired by Mars Inc. and Ferrero SpA respectively as of 2025.\n\n\n== History ==\n\nIn 1876, John Harvey Kellogg became the superintendent of the Battle Creek Sanitarium (originally the Western Health Reform Institute founded by Ellen White) and his brother, W. K. Kellogg, worked as the bookkeeper. This is where corn flakes were created and led to the eventual formation of the Kellogg Company.\nFor years, W. K. Kellogg assisted his brother in research to improve the vegetarian diet of the Battle Creek Sanitarium's patients, especially in the search for wheat-based granola. The Kelloggs are best known for the invention of the famous breakfast cereal corn flakes. The development of the flaked cereal in 1894 has been variously described by those involved: Ella Eaton Kellogg, John Harvey Kellogg, his younger brother Will Keith Kellogg, and other family members. There is considerable disagreement over who was involved in the discovery, and the role that they played. It is generally agreed that upon being called out one night, John Kellogg left a batch of wheat-berry dough behind. Rather than throwing it out the following day, he sent it through the rollers and was surprised to obtain delicate flakes, which could then be baked.\nW. K. Kellogg persuaded his brother to serve the food in a flake form. Soon the flaked wheat was being packaged to meet hundreds of guest mail-order requests after they left the Sanitarium. However, Dr. John Harvey forbade his brother Will from distributing cereal beyond his consumers. As a result, the brothers fell out, and W. K. launched the Battle Creek Toasted Corn Flake Company on February 19, 1906. On July 4, 1907, a fire destroyed the main factory building. W.K. Kellogg had the new plant in full operation six months after the fire.\nConvincing his brother to relinquish rights to the product, Will's company produced and marketed the hugely successful Kellogg's Toasted Corn Flakes and was renamed the Kellogg Toasted Corn Flake Company in 1909, taking on the current name of the Kellogg Company in 1922.\nBy 1909, Will's company produced 120,000 cases of Corn Flakes daily. John, who resented his brother's success, filed suit against Will's company in 1906 for the right to use the family name. The resulting legal battle, which included a trial that lasted an entire month, ended in December 1920 when the Michigan Supreme Court ruled in Will's favor.\nIn 1931, the Kellogg Company announced that most of its factories would shift towards 30-hour work weeks from the usual 40.  W.K. Kellogg stated that he did this so that an additional shift of workers would be employed to support people through the depression era. This practice remained until World War II and continued briefly after the war, although some departments and factories remained locked into 30-hour work weeks until 1980.\nFrom 1969 to 1970, the slogan “Kellogg's puts more into your day” was used on Sunday morning TV shows",
  "fetched_at": "2026-02-09T05:56:54.445173"
}