{
  "url": "https://en.wikipedia.org/wiki/Stoicism",
  "title": "Stoicism",
  "text": "Stoicism is an ancient Greek and then Roman philosophy of the Hellenistic and Roman Imperial periods. The Stoics believed that the universe operated according to reason, or logos, providing a unified account of the world, constructed from ideals of rational discourse, monistic physics, and naturalistic ethics. These three ideals constitute virtue, which is necessary for the Stoic goal of 'living a well-reasoned life'.\nStoic logic focuses on highly intentional reasoning through propositions, arguments, and the differentiation between truth and falsehood. Philosophical discourse is paramount in Stoicism, including the view that the mind is in rational dialogue with itself. Stoic ethics centers on virtue as the highest good, cultivating emotional self-control, a calm problem-solving state of mind, and rational judgment to attain lifelong flourishing (eudaimonia). At the same time, passions, anxieties, and insecurities are viewed as misguided reactions that ought to be controlled through self-disciplined practice. Of all the schools of ancient Western philosophy, Stoicism made the greatest claim to being utterly systematic. \nStoicism was founded in the ancient Agora of Athens by Zeno of Citium around 300 BCE, and flourished throughout the Greco-Roman world until the 3rd century CE. Stoicism emerged from the Cynic tradition and was popularized through public teaching at the Stoa Poikile, a painted colonnade. Among its adherents was Roman Emperor Marcus Aurelius. \nAlong with Aristotelian term logic, the system of propositional logic developed by the Stoics was one of the two great systems of logic in the classical world. It was largely built and shaped by Chrysippus, the third head of the Stoic school in the 3rd century BCE. Chrysippus's logic differed from term logic because it was based on the analysis of propositions rather than terms. Stoicism experienced a decline after Christianity became the state religion in the 4th century CE, although Gnosticism lingered and incorporated pure elements of Stoicism and Platonism.\nSince then, it has seen revivals, notably in the Renaissance (Neostoicism) and in the contemporary era. Its influence extended to Roman thinkers like Seneca and Epictetus and later influenced Christianity and the Renaissance Neostoicism movement. Stoicism shaped subsequent developments in logic and inspired modern cognitive therapies.\n\n\n== History ==\n\nThe name Stoicism derives from the Stoa Poikile (Ancient Greek: ἡ ποικίλη στοά), or \"painted porch\", a colonnade decorated with mythic and historical battle scenes on the north side of the Agora in Athens where Zeno of Citium and his followers gathered to discuss their ideas, near the end of the fourth century BCE. Unlike the Epicureans, Zeno chose to teach his philosophy in a public space. Stoicism was originally known as Zenonism. However, this name was soon dropped, probably because the Stoics did not consider their founders to be perfectly wise and to avoid the risk of the philosophy becoming a cult of personality.\nZeno's ideas developed from those of the Cynics (brought to him by Crates of Thebes), whose founding father, Antisthenes, had been a disciple of Socrates. Zeno's most influential successor was Chrysippus, who followed Cleanthes as leader of the school, and was responsible for molding what is now called Stoicism. Stoicism became the foremost popular philosophy among the educated elite in the Hellenistic world and the Roman Empire to the point where, in the words of Gilbert Murray, \"nearly all the successors of Alexander [...] professed themselves Stoics\". Later Roman Stoics focused on promoting a life in harmony within the universe, within which we are active participants.\nScholars usually divide the history of Stoicism into three phases: the Early Stoa, from Zeno's founding to Antipater; the Middle Stoa, including Panaetius and Posidonius; and the Late Stoa, including Musonius Rufus, Seneca, Epictetus, and Marcus Aurelius. No complete works survived from",
  "fetched_at": "2026-02-09T02:45:05.994727"
}