{
  "url": "https://en.wikipedia.org/wiki/Glossary_of_ancient_Egypt_artifacts",
  "title": "Glossary of ancient Egypt artifacts",
  "text": "This is a glossary of ancient Egypt artifacts.\n\n\n== Glossary of ancient Egyptian artifacts and materials ==\nAmulet – an amulet is an object that is typically worn on one's person, that some people believe has the magical or miraculous power to protect its holder.\nAnkh – a symbol of life held by Ra\nBenben stone (also known as a pyramidion) – the top stone of the Egyptian pyramid\nCanopic jar – vessel containing internal body organs removed during mummification\nCanopic chest – the common chest contained the four Canopic jars\nCartonnage – papyrus or linen soaked in plaster, shaped around a body and used for mummy masks and coffins\nCenotaph – an empty tomb or a monument erected in honor of a person or group of people whose remains are elsewhere\nCrook – a symbol of pharaonic power. Symbol of the god Osiris\nFaience – glasswork articles, amulets, etc.\nFalse door – an artistic representation of a door, a common architectural element in the tombs\nFlail – a symbol of pharaonic power. Symbol of the god Osiris\nFlint knife – prestige funerary good, from the Naqada period until the end of the Early Dynastic Period\nFunerary cone – small cones made from clay that were placed over the entrance of the chapel of a tomb, used almost exclusively in the Theban necropolis  (Mesopotamia had clay nails)\nHeadrest – found in tombs, etc. Typically personal, or a memorial headrest\nImiut fetish – a religious object used in funerary rites; a stuffed, headless animal skin, often of a feline or bull, tied by the tail to a pole, terminating in a lotus bud and inserted into a stand\nMicrolith – ancient Egyptian stone flakes\nMenat – an amulet worn around the neck. Also a musical instrument, a metal rattle (see also: sistrum)\nMenhed – a scribe's pallet\nMummy – body after mummification\nNaos – religious shrine; portable shrine for carrying a god\nOstracon – pottery sherd, limestone Sherd, used as writing material\nCosmetic palette – slab of stone, sometimes decorated, used for preparing cosmetics. See: Narmer Palette; and: Category:Archaeological palettes.\nPapyrus – a material made from papyrus reeds, used as writing and painting material\nPectoral (Ancient Egypt) – many forms. (Up to 13 additional Gardiner-unlisted determinative hieroglyphs for the \"pectoral\"; See Gardiner's sign list.)\nRosetta Stone – A stone with three languages on it, which unlocked the Egyptian language\nSaqqara Bird – wooden bird model\nSarcophagus – a funeral receptacle for a corpse, most commonly carved in stone\nScarab – amulet or seal in the form of an  abstract dung beetle\nSenet – a board game\nShabti – figurines placed in the tomb as substitutes for the tomb owner in the next world\nSphinx\nPyramid – a monumental structure with a square or triangular base and sloping sides that meet in a point at the top, especially one built of stone as a royal tomb in ancient Egypt\nStatuary – pharaonic and non-pharaonic. (Range of sizes.)\nAmulets – numerous, (and predynastic).\nStele\nBoundary Stele – placed at boundaries.\nMemorial Stele – pharaonic or non-pharaonic.\nMonumental Stele – offered to gods, special individuals.\nVotive Stele – private, dedication.\nVictory Stele – pharaonic.\nTalatat –  limestone wall blocks, at times painted.\nUshabti – shabtis from the 21st Dynasty and later.\n\n\n== See also ==\nGrave goods\nVotive deposit\n\n\n== References ==\nReeves, Nicholas.  Ancient Egypt, The Great Discoveries, a Year-by-Year Chronicle,\nNicholas Reeves, (Thames and Hudson Ltd. London), c.2000. Glossary: p. 242",
  "fetched_at": "2026-02-09T05:45:12.753127"
}