{
  "url": "https://en.wikipedia.org/wiki/Epic_of_Gilgamesh",
  "title": "Epic of Gilgamesh",
  "text": "The Epic of Gilgamesh () is an epic from ancient Mesopotamia. The literary history of Gilgamesh begins with five Sumerian poems about Gilgamesh (the variant \"Bilgames\" was once thought to be the earlier Sumerian form), king of Uruk, some of which may date back to the Third Dynasty of Ur (c. 2100 BCE). These independent stories were later used as source material for a combined epic in Akkadian. The first surviving version of this combined epic, known as the \"Old Babylonian\" version, dates back to the 18th century BCE and is titled after its incipit, Shūtur eli sharrī (\"Surpassing All Other Kings\"). Only a few tablets of it have survived. The later Standard Babylonian version compiled by Sîn-lēqi-unninni dates to somewhere between the 13th to the 10th centuries BCE and bears the incipit Sha naqba īmuru (\"He Who Saw the Deep(s)\", lit. \"He Who Sees the Unknown\"). Approximately two-thirds of this longer, twelve-tablet version have been recovered. Some of the best copies were discovered in the library ruins of the 7th-century BCE Assyrian King Ashurbanipal.\nThe first part of the story discusses Gilgamesh, king of Uruk, and Enkidu, a wild man created by the gods to stop Gilgamesh from oppressing his people. After Enkidu becomes civilized through sexual initiation with Shamhat, he travels to Uruk, where he challenges Gilgamesh to a test of strength. Gilgamesh wins the contest; nonetheless, the two become friends. Together, they make a six-day journey to the legendary Cedar Forest, where they ultimately slay its Guardian, Humbaba, and cut down the sacred Cedar. The goddess Ishtar sends the Bull of Heaven to punish Gilgamesh for spurning her advances. Gilgamesh and Enkidu kill it, insulting Ishtar in the process. The gods decide to sentence Enkidu to death by giving him a fatal illness.\nIn the second part of the epic, distress over Enkidu's death causes Gilgamesh to undertake a long and perilous journey to discover the secret of eternal life. Finally, he meets Utnapishtim and his wife, the only humans to survive the Flood triggered by the gods (cf. Athra-Hasis). Gilgamesh learns from him that \"Life, which you look for, you will never find. For when the gods created man, they let death be his share, and life withheld in their own hands\". \nThe epic is regarded as a foundational work in religion and the tradition of heroic sagas, with Gilgamesh forming the prototype for later heroes like Heracles (Hercules) and the epic itself serving as an influence for Homeric epics. It has been translated into many languages and is featured in several works of popular fiction.\n\n\n== Discovery ==\n\nAbout 15,000 fragments of Assyrian cuneiform tablets were discovered in the Library of Ashurbanipal in Nineveh by Austen Henry Layard, his assistant Hormuzd Rassam, and W. K. Loftus in the early 1850s. Late in the following decade, the British Museum hired George Smith to study them. In 1872, Smith read translated fragments before the Society of Biblical Archaeology, and in 1875 and 1876 he published fuller translations, the latter of which was published as The Chaldaean Account of Genesis. The central character of Gilgamesh was initially reintroduced to the world as \"Izdubar\", before the cuneiform logographs in his name could be pronounced accurately. In 1891, Paul Haupt collected the cuneiform text, and nine years later, orientalist Peter Jensen provided a comprehensive edition; R. Campbell Thompson updated both of their work in 1930. Over the next two decades, Samuel Noah Kramer reassembled the Sumerian poems.\nIn 1998, American Assyriologist Theodore Kwasman discovered a piece believed to have contained the first lines of the epic in the storeroom of the British Museum. The fragment, found in 1878 and dated to between 600 BCE and 100 BCE, had remained unexamined by experts for more than a century since its recovery. The fragment read \"He who saw all, who was the foundation of the land, who knew (everything), was wise in all matters: Gilgamesh.\" The discovery ",
  "fetched_at": "2026-02-09T02:45:09.082424"
}