{
  "url": "https://en.wikipedia.org/wiki/QAnon",
  "title": "QAnon",
  "text": "QAnon is a far-right American political conspiracy theory and political movement that originated in 2017. QAnon centers on fabricated claims made by an anonymous individual or individuals known as \"Q\". Those claims have been relayed and developed by online communities and influencers. Their core belief is that a cabal of Satanic, cannibalistic child molesters in league with the deep state is operating a global child sex trafficking ring and that Donald Trump is secretly leading the fight against them. QAnon has direct roots in Pizzagate, another conspiracy theory that appeared on the Internet one year earlier, but also incorporates elements of many different conspiracy theories and unifies them into a larger interconnected theory. QAnon has been described as a cult.\nDuring the first presidency of Donald Trump, QAnon followers believed the administration would conduct arrests and executions of thousands of members of the cabal on a day known as \"the Storm\" or \"the Event\". QAnon conspiracy believers have named Democratic politicians, Hollywood actors, high-ranking government officials, business tycoons, and medical experts as members of the cabal of pedophiles. QAnon is described as antisemitic or rooted in antisemitic tropes, due to its fixation on Jewish financier George Soros and conspiracy theories about the Rothschild family, a frequent target of antisemites.\nThough QAnon has its origins in older conspiracy theories, it was set in motion in October 2017 when Q first posted on the website 4chan. Q claimed to be a high-level government official with Q clearance, with access to classified information about the Trump administration and its opponents. Q soon moved to 8chan, making it QAnon's online home. Q's often cryptic posts, which became known as \"drops\", were collected by aggregator apps and websites and relayed by influencers. QAnon became a viral phenomenon beyond the internet and turned into a political movement. QAnon followers began to appear at Trump campaign rallies in August 2018, and Trump amplified QAnon accounts on Twitter. QAnon's conspiracy theories have also been relayed by Russian and Chinese state-backed media, social media troll accounts, and the far-right Falun Gong–associated Epoch Media Group.\nFollowing its emergence in American politics, QAnon spawned movements around the world. The exact number of QAnon adherents is unclear. After increased scrutiny of the movement, social media platforms such as Twitter and Facebook began taking action to stop the spread of the conspiracy theory. QAnon followers have perpetrated acts of violence. Members of the movement took part in the 2020 United States presidential election, during which they supported Trump's campaign and waged information warfare to influence voters. After Joe Biden won, they were involved in efforts to overturn the results of the election. Associates of Trump, such as Michael Flynn, Lin Wood and Sidney Powell, have promoted QAnon-derived conspiracy theories. When these tactics failed, Trump supporters – many of them QAnon followers – attacked the U.S. Capitol on January 6, 2021. The Capitol attack led to a further, more sustained social media crackdown on the movement and its claims. Though the QAnon movement in its original form lost traction after the 2020 election, some of the concepts it promoted went on to permeate mainstream American political discourse.\n\n\n== Background ==\n\n\n=== Pizzagate ===\n\nAccording to QAnon researcher Mike Rothschild, \"while Q has a number of precursor conspiracy theories and scams ... no conspiracy theory feeds more immediately into Q than Pizzagate\". The Pizzagate theory began in 2016 with the leak of Clinton campaigner John Podesta's emails, which promoters of the theory believed contained a secret code detailing child sexual abuse. Pizzagate followers said that high-profile Democrats were sexually abusing children at a Washington, D.C. pizzeria, which led to an armed attack on the establishment by a gunman who bel",
  "fetched_at": "2026-02-09T05:48:12.347025"
}