{
  "url": "https://en.wikipedia.org/wiki/Nielsen_&_Winther_Type_AA",
  "title": "Nielsen & Winther Type AA",
  "text": "The Nielsen & Winther Type Aa was a single-seat biplane fighter aircraft, designed in Sweden by Enoch Thulin and manufactured in Denmark in 1916–1917 by Nielsen & Winther in Copenhagen.\n\n\n== Development ==\nThe first fighter aircraft to be built in Denmark, the Nielsen and Winther Type Aa was designed during World War I by the Swedish aircraft manufacturer Enoch Thulin in 1916, and designated as his Type M. \nAlthough Thulin had previously sold aircraft made by his AETA firm (A.B Enoch Thulins Aeroplanfabrik, (later AB Thulinverken) based in Landskrona) to the Swedish military (e.g. Thulin C, Thulin G) they were not interested in this machine, and the design was sold or licensed to Nielsen & Winther (N&W) as their first aircraft model. The existing firm of Nielsen and Winther was a long-established machine factory making machine tools. The director of the newly-formed Aircraft Department of Nielsen and Winther was 1st Lt. Johan B. Ussing, holder of Danish pilot's licence no. 1. The firm's chief engineer was Henrik Funch-Thomson, who had previously worked at the German aircraft maker of Hansa-Brandenburg. \nDuring 1917 six Type Aa aircraft were built and delivered to the Danish Army Air Corps, and stationed at the Army Aviation School at Klovermarken: they appear to have been used for training the more experienced pilots. They were retired from flying in 1919 after three of the six had crashed, perhaps owing to engine unreliability. \nDuring its short existence, the aircraft department of N&W manufactured a total of 16 machines (the majority based on the Thulin-designed Type Aa), and twenty Scania-Vabis PD engines of 110 hp, copies of the German Mercedes D.II.  A glut of cheap ex-military aircraft in the civilian market after the war meant that making new machines swiftly became unprofitable (this affected all combatants in the war) and Nielsen and Winther were bought out in 1920 by dk:Vølund A/S.\n\n\n== Description ==\nThe single seat Type Aa was a sesquiplane of wooden construction, powered by a '90 hp' Thulin type A rotary engine,\nand armed with an 8mm Madsen machine gun mounted on the top wing firing over the propeller. Ground tests by the manufacturers with synchronising equipment took place in 1918 and were apparently successful, reportedly using a Type Aa with the gun mounted on the side of the fuselage: but there is no evidence that air firing tests took place.\nIn the History of Danish Flight (pub. 1936) major-general C. Førslev (first commander of the Danish Army Air Corps) described the N&W fighters: \"They flew well and had good speed and lift, but their Thulin engines were hardly reliable, and the airmen had—whether rightly or wrongly is difficult to decide now—no basic confidence that the frame itself was solid enough to withstand violent manoevers\".\n\n\n== Operational history ==\nAt the time of the Type Aa's introduction, the aircraft business in the Danish Army was quite loosely organized, and there was in fact only one unit, the Army Flying School, run by the Danish Army Air Corps which was based at Klovermarken in Copenhagen. The fighters were not assigned to an active squadron, but were used by the Flying School; and it was only the more experienced pilots who were allowed to fly them. \nThe maiden flight of the Type Aa (manufacturer's serial N&W 1) took place on 21 January 1917, piloted by sergeant H. A. Ehlers. On testing, the aircraft reached a maximum speed of 144.7 kilometres per hour (89.9 mph) and rose to a height of 1,609 metres (5,279 ft) in 10 minutes. On 21 March 1917, Ehlers set a Scandinavian altitude record of 4,000 m with a N&W Aa. It took 29 minutes for the ascent. The achievement brought him a gold watch with the inscription from the factory.\nN&W fighter No. 2 was flown in March 1917 by First Lieutenant (dk:Premierløjtnant) M. Hofoed-Jensen, and the rest followed over the following months. Hofoed-Jensen broke Ehlers's altitude record on 28 December 1917 in N&W 6, achieving 5,000 metres (16,000 ft), for wh",
  "fetched_at": "2026-02-09T06:22:17.322128"
}