{
  "url": "https://en.wikipedia.org/wiki/First_Vision",
  "title": "First Vision",
  "text": "The First Vision (also called the Grove Experience by members of the Community of Christ) refers to a theophany which Latter Day Saints believe Joseph Smith experienced in the early 1820s, in a wooded area in Manchester, New York, called the Sacred Grove. Smith described it as a vision in which he received instruction from God the Father and Jesus Christ.\nAccording to the account Smith told in 1838, he went to the woods to pray about which church to join but fell into the grip of an evil power that nearly overcame him. At the last moment, he was rescued by two shining \"Personages\" (implied to be God the Father and Jesus) who hovered above him. One of the beings told Smith not to join any of the existing churches because they all taught incorrect doctrines.\nSmith wrote several accounts of the vision between 1832 and 1842, two of which were published in his lifetime. Consistency of the accounts is a subject of debate, whether variations are indicators of significant shifts in Smith's theology or are simply changing emphasis of minor details. The First Vision is revered in Latter-day Saint theology as the first step in the Latter Day Saint restoration. Although it was relatively unknown to early adherents to the Latter Day Saint movement, Joseph Smith's 1838 account became widely circulated within a few years. The event grew in emphasis in the Church of Jesus Christ of Latter-day Saints (LDS Church) in the late 19th century. For Latter-day Saints, the First Vision corroborates distinctive doctrines such as the bodily nature of God the Father and the uniqueness of the Restored Gospel of Jesus Christ as the only true path to exaltation.\n\n\n== Story of the vision ==\nSmith wrote or dictated several versions of his vision story, and told the story to others who later published what they remember hearing. Taken together, these accounts set forth the following details:\n\nSmith said that when he was about twelve (c. 1817–18), he became interested in religion and distressed about his sins. He studied the Bible and attended church, but the accounts differ as to whether he determined on his own that there was no existing religion built upon the true teachings of Jesus or whether the idea that all churches were false had not \"entered his heart\" until he experienced the vision. During this period of religious concern, he determined to turn to God in prayer. An early account says the purpose of this prayer was to ask God for mercy for his sins while later accounts emphasize his desire to know which church he should join. Smith said he went one spring morning to a secluded grove near his home to pray. He said he went to a stump in a clearing where he had left his axe the day before and began to offer his first audible prayer.\nHe said his prayer was interrupted by a \"being from the unseen world.\" Smith said the being caused his tongue to swell in his mouth so that he could not speak. One account said he heard a noise behind him like someone walking towards him and then, when he tried to pray again, the noise grew louder, causing him to spring to his feet and look around, but he saw no one. In some of the accounts, he described being covered with a thick darkness and thinking that he would be destroyed. At his darkest moment, he knelt a third time to pray and, as he summoned all his power to pray, he felt ready to sink into oblivion. At that moment, he said his tongue was loosed and he saw a vision.\nSmith said he saw a pillar of light brighter than the noonday sun that slowly descended on him, growing in brightness as it descended and lighting the entire area for some distance. As the light reached the tree tops, Smith feared the trees might catch fire. But when it reached the ground and enveloped him, it produced a \"peculiar sensation.\" \"[H]is mind was caught away from the natural objects with which he was surrounded; and he was enwrapped in a heavenly vision.\"\nWhile experiencing the vision, he said he saw one or more \"personages\", described diffe",
  "fetched_at": "2026-02-09T05:57:45.723384"
}