{
  "url": "https://en.wikipedia.org/wiki/Baltimore_City_Landmarks",
  "title": "Baltimore City Landmarks",
  "text": "Baltimore City Landmark is a historic property designation made by the city of Baltimore, Maryland. Nominations are reviewed by the city's Commission for Historical & Architectural Preservation (CHAP) and planning board, and are passed by Baltimore City Council. The landmarks program was created in 1971.\nCHAP also maintains a list of Historical and Architectural Preservation Districts, separate from its landmarks program. The district program includes 37 unique districts, many of which are also listed on the National Register of Historic Places.\nAs of 2012, the program had designated 163 exterior Baltimore City Landmarks and one interior landmark (for the interior of the Senator Theatre, whose exterior is also landmarked).\nAlso as of 2012, more than 56,000 properties were located in 24 city historic districts, receiving the same protection as individual Baltimore City Landmarks.\n\n\n== Criteria ==\nIn assessing landmarks, the city Commission for Historical & Architectural Preservation (CHAP) developed criteria based on the National Register Criteria for Evaluation. The city commission looks at:\n\nSignificance to Baltimore history or historical events\nAssociation with people significant to Baltimore's history\nProviding or being likely to provide important information to Baltimore prehistory or history\nThe architecture, culture, engineering, or archaeology involved in the site\nHaving distinct characteristics of a type, period, or method of construction\nIntegrity of location, design, materials, craftsmanship, feeling, or association\nHaving high artistic value or being part of a distinguishable entity\nRepresenting the work of a skilled or notable artist, architect, or other worker\n\n\n== Landmarks ==\n\n  \nFor consistency, the list below uses the name used in the Baltimore City Landmark List.\n\n\n== Landmarked interiors ==\n\n\n== See also ==\n\nLists of locally designated landmarks in the United States\nNational Register of Historic Places listings in Baltimore\n\n\n== References ==\n\n\n== External links ==\n\nOfficial website\nLandmark list with descriptions\nMap of city landmarks",
  "fetched_at": "2026-02-09T06:20:31.005810"
}