{
  "url": "https://en.wikipedia.org/wiki/Robert_Blake_(actor)",
  "title": "Robert Blake (actor)",
  "text": "Robert Blake (born Michael James Gubitosi; September 18, 1933 – March 9, 2023), billed early in his career as Mickey Gubitosi and Bobby Blake, was an American actor. He was best known for starring in the 1967 film In Cold Blood, and playing the title role in the late 1970s television series Baretta, Hell Town and playing the Mystery Man in the 1997 film Lost Highway.\nBlake began his career in the 1930s performing as a child alongside his family as a singer and dancer but became famous as a child actor, with his lead role in the final years of the Metro-Goldwyn-Mayer-era of the Our Gang (Little Rascals) short film series from 1939 to 1944. He also appeared as a child actor in 22 entries of the Red Ryder film franchise. In the Red Ryder series and many of his adult roles, the Italian-American actor was often cast as an American Indian or mestizo character. After a stint in the U.S. Army, Blake returned to acting in television and movie roles. Blake continued acting until 1997's Lost Highway. Blake was one of the first child actors to evolve into mature roles as an adult. Author Michael Newton called Blake's career \"one of the longest in Hollywood history\".\nBlake was arrested in 2002 for the 2001 murder of his second wife, Bonny Lee Bakley. Blake was acquitted of the murder in criminal court in 2005, but he was found liable in civil court for her wrongful death.\n\n\n== Early life ==\nBlake was born Michael James Gubitosi in Nutley, New Jersey, on September 18, 1933. His parents were Giacomo (James) Gubitosi and his wife, Elizabeth Cafone. In 1930, James worked as a die setter for a can manufacturer. Eventually, Blake's parents began a song-and-dance act. In 1936, their three children began performing, billed as \"The Three Little Hillbillies\". They moved to Los Angeles, California, in 1938, where the children began working as movie extras. \nBlake’s parents were from Campania, Italy: his father was from the town of Montella in the province of Avellino and his mother from the town of Polla.\nBlake had an unhappy childhood in which he was abused by his alcoholic father. When he entered public school at age 10, he was bullied and had fights with other students, which led to his expulsion. Blake later said he was physically and sexually abused by both his parents and was often locked in a closet and forced to eat off the floor as punishment. At age 14, he ran away from home, leading to several more difficult years. His father died by suicide in 1956. He refused to attend his father's funeral.\n\n\n== Child actor ==\n\nThen known as Mickey Gubitosi, Blake began his acting career as Toto in the MGM movie Bridal Suite (1939), starring Annabella and Robert Young. He then began appearing in MGM's Our Gang short subjects (a.k.a. The Little Rascals) under his real name, replacing Eugene \"Porky\" Lee. He appeared in 40 of the shorts between 1939 and 1944, eventually becoming the series' final lead character. Blake's parents also made appearances in the series as extras. In Our Gang, Blake's character, Mickey, was often called upon to cry, for which he was criticized as unconvincing. He was also criticized for being obnoxious and whiny.\nIn 1942, he acquired the stage name Bobby Blake and scored his first starring role in a feature film, playing the title role in the MGM feature Mokey. Donna Reed starred as Mokey's mother, and Billie \"Buckwheat\" Thomas, who co-starred in Our Gang alongside Blake, played Mokey's friend Brother Cumby. After Blake took his stage name, his Our Gang character was renamed \"Mickey Blake\". Blake also appeared as \"Tooky\" Stedman in the 1942 film Andy Hardy's Double Life.\nIn 1944, MGM discontinued Our Gang, releasing the final short in the series, Dancing Romeo. In 1995, the Young Artist Foundation honored Blake with its Former Child Star \"Lifetime Achievement\" Award for his role in Our Gang.\nIn 1944, Blake began playing a Native American boy, \"Little Beaver\", in the Red Ryder Western series at the studios of Republic Pictures (now",
  "fetched_at": "2026-02-09T05:20:27.016529"
}