{
  "url": "https://en.wikipedia.org/wiki/Proxy_auto-config",
  "title": "Proxy auto-config",
  "text": "A proxy auto-config (PAC) file defines how web browsers and other user agents can automatically choose the appropriate proxy server (access method) for fetching a given URL.\nA PAC file contains a JavaScript function FindProxyForURL(url, host). This function returns a string with one or more access method specifications. These specifications cause the user agent to use a particular proxy server or to connect directly.\nMultiple specifications provide a fallback when a proxy fails to respond. The browser fetches this PAC file before requesting other URLs. The URL of the PAC file is either configured manually or determined automatically by the Web Proxy Auto-Discovery Protocol.\n\n\n== Context ==\nModern web browsers implement several levels of automation; users can choose the level that is appropriate to their needs. The following methods are commonly implemented:\n\nAutomatic proxy selection: Specify a host-name and a port number to be used for all URLs. Most browsers allow you to specify a list of domains (such as localhost) that will bypass this proxy.\nProxy auto-configuration (PAC): Specify the URL for a PAC file with a JavaScript function that determines the appropriate proxy for each URL. This method is more suitable for laptop users who need several different proxy configurations, or complex corporate setups with many different proxies.\nWeb Proxy Auto-Discovery Protocol (WPAD): Let the browser guess the location of the PAC file through DHCP and DNS lookups.\n\n\n== History ==\nThe Proxy auto-config file format was originally designed by Netscape in 1996 for the Netscape Navigator 2.0 and is a text file that defines at least one JavaScript function.\n\n\n== The PAC file ==\nBy convention, the PAC file is normally named proxy.pac. The WPAD standard uses wpad.dat.  The .pac file is expected to contain at least one function:\n\nFindProxyForURL(url, host), with two arguments and return value in specific format:\n* url is the URL of the object\n* host is the host-name derived from that URL. Syntactically it is the same string as between :// and the first : or / after that.\n*  return \"...\" is a string of signatures in the following format (see examples below):\n\nTo use it, a PAC file is published to a HTTP server, and client user agents are instructed to use it, either by entering the URL in the proxy connection settings of the browser or through the use of the WPAD protocol. The URL may also reference a local file as for example: file:///etc/proxy.pac.\nEven though most clients will process the script regardless of the MIME type returned in the HTTP reply, for the sake of completeness and to maximize compatibility, the HTTP server should be configured to declare the MIME type of this file to be either application/x-ns-proxy-autoconfig or application/x-javascript-config.\nThere is little evidence to favor the use of one MIME type over the other. It would be, however, reasonable to assume that application/x-ns-proxy-autoconfig will be supported in more clients than application/x-javascript-config as it was defined in the original Netscape specification, the latter type coming into use more recently.\n\n\n=== Example ===\nA very simple example of a PAC file is:\n\nThis function instructs the browser to retrieve all pages through the proxy on port 8080 of the server proxy.example.com. Should this proxy fail to respond, the browser contacts the Web-site directly, without using a proxy. The latter may fail if firewalls, or other intermediary network devices, reject requests from sources other than the proxy—a common configuration in corporate networks.\nA more complicated example demonstrates some available JavaScript functions to be used in the FindProxyForURL function:\n\nBy default, the PROXY keyword means that a proxy corresponding to the protocol of the original request, be it http, https, or ftp, is used. Other supported keyword and proxy types include:\n\nSOCKS\nUse a SOCKS proxy.\nHTTP, HTTPS\nIntroduced in more recent versions of Firefox. Specifies an HTTP(S) ",
  "fetched_at": "2026-02-09T02:44:54.231335"
}