{
  "url": "https://en.wikipedia.org/wiki/Canopy_(botany)",
  "title": "Canopy (botany)",
  "text": "In biology, the canopy is the aboveground portion of a plant cropping or crop, formed by the collection of individual plant crowns. In forest ecology, the canopy is the upper layer or habitat zone, formed by mature tree crowns and including other biological organisms (epiphytes, lianas, arboreal animals, etc.). The communities that inhabit the canopy layer are thought to be involved in maintaining forest diversity, resilience, and functioning. Shade trees normally have a dense canopy that blocks light from lower growing plants.\nEarly observations of canopies were made from the ground using binoculars or by examining fallen material. Researchers would sometimes erroneously rely on extrapolation by using more reachable samples taken from the understory. In some cases, they would use unconventional methods such as chairs suspended on vines or hot-air dirigibles, among others. Modern technology, including adapted mountaineering gear, has made canopy observation significantly easier and more accurate, allowed for longer and more collaborative work, and broadened the scope of canopy study.\n\n\n== Structure ==\n\nCanopy structure is the organization or spatial arrangement (three-dimensional geometry) of a plant canopy. Leaf area index, leaf area per unit ground area, is a key measure used to understand and compare plant canopies. The canopy is taller than the understory layer. The canopy holds 90% of the animals in the rainforest. Canopies can cover vast distances and appear to be unbroken when observed from an airplane. However, despite overlapping tree branches, rainforest canopy trees rarely touch each other. Rather, they are usually separated by a few feet.\nDominant and co-dominant canopy trees form the uneven canopy layer. Canopy trees are able to photosynthesize relatively rapidly with abundant light, so it supports the majority of primary productivity in forests. The canopy layer provides protection from strong winds and storms while also intercepting sunlight and precipitation, leading to a relatively sparsely vegetated understory layer.\nForest canopies are home to unique flora and fauna not found in other layers of forests. The highest terrestrial biodiversity resides in the canopies of tropical rainforests. Many rainforest animals have evolved to live solely in the canopy and never touch the ground. The canopy of a rainforest is typically about 10 metres (33 feet) thick, and intercepts around 95% of sunlight. The canopy is below the emergent layer, a sparse layer of very tall trees, typically one or two per hectare. With an abundance of water and a near ideal temperature in rainforests, light and nutrients are two factors that limit tree growth from the understory to the canopy.\nIn the permaculture and forest gardening community, the canopy is the highest of seven layers.\n\n\n== Ecology ==\nForest canopies have unique structural and ecological complexities and are important for the forest ecosystem. They are involved in critical functions such as rainfall interception, light absorption, nutrient and energy cycling, gas exchange, and providing habitat for diverse wildlife. The canopy also plays a role in modifying the internal environment of the forest by acting as a buffer for incoming light, wind, and temperature fluctuations.\nThe forest canopy layer supports a diverse range of flora and fauna. It has been dubbed \"the last biotic frontier\" as it provides a habitat that has allowed for the evolution of countless species of plants, microorganisms, invertebrates (e.g., insects), and vertebrates (e.g., birds and mammals) that are unique to the upper layer of forests. Forest canopies are arguably considered some of the most species-rich environments on the planet. It is believed that the communities found within the canopy layer play an essential role in the functioning of the forest, as well as maintaining diversity and ecological resilience.\n\n\n=== Climate regulation ===\nForest canopies are significantly involved in maintaining the s",
  "fetched_at": "2026-02-09T05:20:23.784033"
}