{
  "url": "https://en.wikipedia.org/wiki/Cultural_views_on_the_midriff_and_navel",
  "title": "Cultural views on the midriff and navel",
  "text": "Cultural views on the midriff and navel vary significantly. In some cultures the navel is seen as sexually and culturally significant, and its exposure has been subject to a variety of cultural norms and taboos, based on concepts of modesty. The views, customs and fashions relating to the midriff and navel change from time to time, and such exposure has become more widely acceptable, as reflected in the designs of clothing.\n\n\n== Western culture ==\nThe public exposure of the male and female midriff and bare navel has been taboo at times in Western cultures, being considered immodest or indecent. It was banned in some jurisdictions. Eventually, only female navel exposure was banned and not male because, it was argued, the simulation or upward displacement from vagina to navel was commonplace and obvious in women.\nCommunity perceptions have changed and exposure of female midriff and navel is more accepted today and in some societies or contexts it is both fashionable and common, though not without its critics.\nAlthough American teenage girls are more likely to wear shirts that reveal their midriffs, this kind of clothing is often banned in high schools and stores. It is also inappropriate to wear clothing that reveals the midriff in professional settings like places of work. The exposure of the male navel has not been as controversial nor as common, and is usually in the context of barechestedness. Exposure of the navel by females is commonly associated with the popularity of the bikini, the crop top, and low-rise clothing.\n\n\n=== Film ===\nIn the United States, the Motion Picture Production Code, or Hays Code, enforced after 1934, banned the exposure of the female navel in Hollywood films. The National Legion of Decency, a Roman Catholic body guarding over American media content, also pressured Hollywood to keep clothing that exposed certain parts of the female body, such as bikinis and low-cut dresses, from being featured in Hollywood movies.\n\nDuring the 1950s, Joan Collins was prohibited by the censors from exposing her navel in Land of the Pharaohs (1955). To get around the censors' guidelines, she wore a jewel, a ruby, in her navel. Kim Novak wore a ruby jewel in her navel for the film Jeanne Eagels (1957); saying in an interview, \"they had to glue it in every time. I got a terrible infection from it.\" Marilyn Monroe, for a scene from Some Like It Hot (1959), wore a dress that revealed skin everywhere but had a small piece of fabric to hide her navel. (The film was condemned by the National Legion of Decency, but for other reasons.)\nBy the 1960s, community standards had changed. Marilyn Monroe was allowed to expose her navel in Something's Got to Give (1962) and later commented, \"I guess the censors are willing to recognize that everybody has a navel.\" Ursula Andress, appearing as Honey Ryder in the 1962 James Bond film, Dr. No, wore her iconic white bikini, which exposed her midriff and navel. However, when Annette Funicello was cast in her first beach movie Beach Party (1963), Walt Disney, who held her contract, insisted that she only wear modest bathing suits and keep her navel covered, to  preserve her wholesome persona, though she was the only one of the ample number of young women in the film not bikini-clad. In the 1967 film Follow That Camel, actress Anita Harris wore a jewel on her navel for a belly-dancing sequence.\nThe Hays Code was abandoned soon after, with it the prohibition of female navel exposure and other restrictions. The influence of the National Legion of Decency had also waned by the 1960s. With the withdrawal of the Code and the change to a classification regime, the ban on the exposure of parts of the human body that had previously been regarded as immodest or indecent was withdrawn; and with it, there was an increasing level of body exposure over time. The exposure of the navel ceased to be controversial in the context of a general increase in nudity. \nIn the 2000s, Devon Aoki's bad girl character Suki",
  "fetched_at": "2026-02-09T05:57:43.166213"
}