{
  "url": "https://en.wikipedia.org/wiki/Fallen_angel",
  "title": "Fallen angel",
  "text": "Fallen angels are angels who were expelled from Heaven. The literal term \"fallen angel\" does not appear in any Abrahamic religious texts, but is used to describe angels cast out of heaven. Such angels are often described as corrupting humanity by teaching forbidden knowledge or by tempting them into sin. Common motifs for their expulsion are lust, pride, envy, or an attempt to usurp divinity.\nThe earliest appearance of the concept of fallen angels may be found in Canaanite beliefs about the bənē hāʾĔlōhīm ('sons of God'), expelled from the divine court. Hêlêl ben Šāḥar is thrown down from heaven for claiming equality with ʻElyōn. Such stories were later collected in the Hebrew Bible (Christian Old Testament) and appear in pseudepigraphic Jewish apocalyptic literature. The concept of fallen angels derives from the assumption that the \"sons of God\" (בני האלוהים‎) mentioned in Genesis 6:1–4 or the Book of Enoch are angels. In the period immediately preceding the composition of the New Testament, some groups of Second Temple Judaism identified these \"sons of God\" as fallen angels.\nDuring the late Second Temple period the Nephilim were considered to be the monstrous offspring of fallen angels and human women. In such accounts, God sends the Great Deluge to purge the world of these creatures; their bodies are destroyed, yet their souls survive, thereafter roaming the earth as demons. Rabbinic Judaism and early Christian authorities after the third century rejected the Enochian writings and the notion of an illicit union between angels and women.\nChristian theology teaches that the sins of fallen angels occur before the beginning of human history. Accordingly, fallen angels became identified with those led by Lucifer in rebellion against God, also equated with demons. The angelic origin of demons was important for Christianity insofar as Christian monotheism holds that evil is a corruption of goodness rather than an independent ontological principle. Conceptualizing fallen angels as purely spiritual beings, both good and evil angels were envisioned as rational beings without bodily limitations. Thus, Western Christian philosophy also implemented the fall of angels as a thought experiment about how evil will could occur from within the mind without external influences and explores questions regarding morality.\nThe Quran refers to motifs reminiscent of fallen angels in earlier Abrahamic writings. However, the interpretation of these beings is disputed. Some Muslim exegetes regard Satan (Iblīs) to be an angel, while others do not. According to the viewpoint of Ibn Abbas (619–687), Iblis was an angel created from fire (nār as-samūm), while according to Hasan of Basra (642–728), he was the progenitor of the jinn. Harut and Marut are a pair of angels mentioned in the Quran who are often said to have fallen to earth due to their negative remarks on humanity.\nFallen angels further appear throughout both Christian and Islamic popular culture, as in Dante Alighieri's Divine Comedy (1308–1320) and John Milton's Paradise Lost.\n\n\n== Canaanite origin ==\nThe Elohist sources speak of bənē hāʾĔlōhīm (\"sons of God\"), manifestations of the Divine (ʾēl) and part of the heavenly court in the Canaanite pantheon. According to Genesis 6:1–4 the bənē hāʾĔlōhīm descended to earth and mated with human women and beget the Nephilim, followed by God sending down a flood to clean the world from humans.\nA passage from the Book of Psalms, although at least five hundred years apart from the passage in Genesis, speaks about a similar heavenly court. According to the text, God delivers judgement upon the gods by turning them into mortals. Although the text does not imply that the gods fell from heaven, it parallels their descent from immortality to mortality. Unlike Genesis, the text is silent about the sins of the gods.\nAs evident from the Hebrew Bible, in later Hebrew tradition, angels became identified with stars. As such, the Book of Isaiah, narrating the fall of a",
  "fetched_at": "2026-02-09T05:46:13.301939"
}