{
  "url": "https://en.wikipedia.org/wiki/Quest_for_the_historical_Jesus",
  "title": "Quest for the historical Jesus",
  "text": "The quest for the historical Jesus consists of academic efforts to determine what words and actions, if any, may be attributed to Jesus, and to use the findings to provide portraits of the historical Jesus. Conventionally, since the 18th century three scholarly quests for the historical Jesus are distinguished, each with distinct characteristics and based on different research criteria, which were often developed during each specific phase. These quests are distinguished from earlier approaches because they rely on the historical method to study biblical narratives. While textual analysis of biblical sources had taken place for centuries, these quests introduced new methods and specific techniques to establish the historical validity of their conclusions.\nThe enthusiasm shown during the first quest diminished after Albert Schweitzer's critique of 1906 in which he pointed out various shortcomings in the approaches used at the time. The second quest began in 1953 and introduced a number of new techniques but reached a plateau in the 1970s. In the 1980s, a number of scholars gradually began to introduce new research ideas, initiating a third quest characterized by the latest research approaches. Since the late 2000s, concerns have been growing about the usefulness of the criteria of authenticity and proclamations of a more expansive and genuinely interdisciplinary Next Quest.\nWhile there is widespread scholarly agreement on the existence of Jesus and a basic consensus on the general outline of his life, the portraits of Jesus constructed in the quests have often differed from each other and from the image portrayed in the gospel accounts. There are overlapping attributes among the portraits and, while pairs of scholars may agree on some attributes, those same scholars may differ on other attributes. There is no single portrait of the historical Jesus that satisfies most scholars.\n\n\n== Quests ==\nConventionally, since the 18th century three scholarly quests for the historical Jesus have been distinguished, each with distinct characteristics and based on different research criteria, which were often developed during each specific phase. According to Tucker Ferda, it is by now \"conventional wisdom that the traditional threefold division of the quest for Jesus [...] is flawed\". The threefold terminology uses the literature selectively, poses an incorrect periodization of research which fails to note the socio-cultural context of the socalled first quest, which began with a critical questioning of Christian origins predating Reimarus, in contrast to what Albert Schweitzer had claimed.\n\n\n=== First quest ===\n\n\n==== Lives of Jesus ====\n\nAs the Enlightenment ended, various scholars in Europe began to go beyond textual analysis and the development of gospel harmonies and began to produce biographies of Jesus typically referred to as Lives of Jesus. These biographies attempted to apply some historical techniques to a harmonized version of the gospel accounts and produced new overviews of the life of Jesus. These attempts at constructing a biography of Jesus came to be known as the first \"quest for the historical Jesus\", a term effectively coined by Albert Schweitzer's book, which was originally titled The Quest of the Historical Jesus: A Critical Study of Its Progress from Reimarus to Wrede.\nBy the late 19th century, hundreds of Lives of Jesus had been written. Some of these were purely sensational: They were not produced because any new data had appeared, but because some people read and interpreted the gospels in new ways. These stories of the Lives of Jesus were often romanticized, highly psychological or included new elements which did not appear in any of the gospels or other historical documents. For example, Ernest Renan used the incident where Jesus rides a donkey during his triumphal entry into Jerusalem to build a story in which Jesus the carpenter was a gentle prophet who had a donkey in Galilee and rode it while traveling between",
  "fetched_at": "2026-02-09T06:02:42.777087"
}