{
  "url": "https://en.wikipedia.org/wiki/Germany's_Next_Topmodel_season_19",
  "title": "Germany's Next Topmodel season 19",
  "text": "The nineteenth season of Germany's Next Topmodel aired on German television network ProSieben from 15 February to 13 June 2024, under the catch phrase GNTM for all.\nThis marks the first season with male contestants and the first season to have two winners, one from each gender. This season marks the return of open-castings, last seen in season 15, and also notably the absence of best-ager models for the first time since season 16.\nThe winners for this season are 19-year-old Jermaine Kokoú Kothé from Kassel and 24-year-old Lea Oude Engberink from Düsseldorf; who notably had made it to the semi-finals of season 12, but was not cast. Their prizes include:\n\nA joint cover and spread in the German edition of Harper's Bazaar.\nA cash prize worth €100,000 each.\nThe international destinations for this season were set in Santa Cruz, Los Angeles and Palermo.\n\n\n== Contestants ==\nAges stated are as of the beginning of the contest\n\n\n== Episode summaries ==\n\n\n== Summaries ==\n\n\n=== Results table ===\n\n  The contestant won best performance\n  The contestant was immune from elimination\n  The contestant withdrew from the competition\n  The contestant was absent from panel but was declared safe\n  The contestant was disqualified\n  The contestant was eliminated outside of panel\n  The contestant was eliminated\n  The contestant was in danger of elimination\n  The contestant won the competition\n\n\n=== Photo shoot guide ===\nEpisode 4 photo shoots and video shoot: Promo shoot in groups; Sunglasses at Night by Heidi Klum prod. by Tiësto; Beach castaways in groups at Tenerife\nEpisode 5 photo shoot: Posing at the end of the runway in Marina Hoermanseder designs\nEpisode 7 photo shoot: Sedcard\nEpisode 8 photo shoot: Posing at Rose Bowl Stadium styled by Christian Cowan\nEpisode 9 photo shoot: Tiny Tokyo in pairs\nEpisode 10 photo shoot: Veiled in the Way of Wind\nEpisode 11 photo shoot: Underwater wedding in pairs\nEpisode 12 photo shoot: GNTM Fashion Week styled by Ashton Michael and Kevin Germanier\nEpisode 13 photo shoot and video shoot: Diner drama with Thomas Kretschmann\nEpisode 14 photo shoot: Lip sync battle\nEpisode 15 photo shoot: Nude in the rain and wind\nEpisode 16 photo shoot: Harper's Bazaar covers\nEpisode 17 photo shoot: Aerial fencing in pairs\nEpisode 18 photo shoot: Hanging from a helicopter\nEpisode 19 photo shoot: Goalkeepers\n\n\n== References ==\n\n\n== External links ==\nOfficial website",
  "fetched_at": "2026-02-09T05:56:13.764251"
}