{
  "url": "https://en.wikipedia.org/wiki/4QMMT",
  "title": "4QMMT",
  "text": "4QMMT, also known as MMT, or the Halakhic Letter, is a reconstructed text from manuscripts that were part of the Dead Sea Scrolls discovered at Qumran in the Judean desert. The manuscript fragments used to reconstruct 4QMMT were found in Cave 4 at Qumran in 1953-1959, and kept at the Palestinian Archaeological Museum, now known as the Rockefeller Museum in Jerusalem.\nThe sigla \"4QMMT\" designates a reconstructed text from manuscripts found in Cave 4 at Qumran. The document was provisionally designated \"4QMishnique\" (Mishnah) by Józef Milik. The designation at final publication was \"4QMMT\" (Miqsat Ma’ase ha-Torah, Hebrew for \"Some Precepts of the Torah\" or \"Some Rulings Pertaining to the Torah\"). This title can also be translated as \"Works of the Law\". Some New Testament scholars identified the connections of this document with the ideas reflected in Pauline theology.\nThe two primary scholars who identified, reconstructed, and published 4QMMT are John Strugnell and Elisha Qimron, the official editors of these manuscripts.\n\n\n== Manuscripts of 4QMMT ==\n\n\n=== Reconstructed composite text ===\n4QMMT is a reconstructed composite text from fragments of six separate manuscripts discovered in Cave 4 of Qumran. The six fragmented manuscripts are designated 4Q394, 4Q395, 4Q396, 4Q397, 4Q398, and 4Q399. Five of the manuscripts were written and preserved on parchment (4Q394, 4Q395, 4Q396, 4Q397, and 4Q399); and one was written on papyri (4Q398). All six manuscripts are also fragmented (e.g., 4Q397, the most fragmented of these scrolls consists of 68 small fragments).\nThese manuscripts are also separately designated as 4QMMTa-f with 4QMMTa designating manuscript 4Q394, and continuing in series concluding with 4QMMTf designating manuscript 4Q399.\n\n\n=== Dating the original composition ===\nStrugnell and Qimron date the original composition of 4QMMT at c.150 BCE. This early date is proposed based on an evaluation of its content. The congenial tone of the letter from the author to the recipients suggests a composition of the text to a time either before or contemporaneous with the earliest organizational stages of the Qumran community. From other texts discovered at Qumran and associated with the Qumran community, scholars believe the Yahad (the Qumran community) had a more hostile attitude to the religious leaders at the Jerusalem Temple and that they were prohibited from corresponding with the Jerusalem leaders.\nLawrence Schiffman dates 4QMMT to c.152 BCE when the Hasmonean dynasty took over the high priesthood and began to follow temple practices identified as pharisaic by later sources. This text is a challenge to the leaders of the Jerusalem Temple regarding their understanding of these purity regulations identified as those of the Pharisees.\nHanan Eshel dates the composition of 4QMMT to c.152 BCE, the beginning of the rise to power of Jonathan Apphus.\n\n\n=== Dating ===\nPalaeographic analysis dates the six copies of 4QMMT to between 75 BCE and 50 CE (Kampen and Bernstein). However, linguistic analysis, which shows traces of early Second Temple period language and usage, suggests that the six copies provenance an older original, perhaps as early as 150 BCE.\nAlthough the original composition of the text is about 150 BCE, estimates of the dates of the copying of these particular six manuscripts range from 75 BCE to 50 CE.\nPalaeographic analysis of the manuscripts of 4QMMT was performed by Strugnell and Qimron, with Ada Yardeni, who analyzed manuscripts 4Q397 and 4Q398. They dated the manuscripts palaeographically to the early or mid-Herodian period. Frank Moore Cross had given one of the 4QMMT manuscripts a late Hasmonean date. These dates place the texts between the early 1st century BCE and the late 1st century CE.\n\n\n== Publication ==\nIn 1959, John Strugnell was assigned the task of publishing the manuscripts that make up the text of 4QMMT. In 1979, Hebrew scholar Elisha Qimron joined him to assist in the publication of 4QMMT.\nThe text was offi",
  "fetched_at": "2026-02-09T02:52:57.967897"
}