{
  "url": "https://en.wikipedia.org/wiki/Complete_Divine",
  "title": "Complete Divine",
  "text": "Complete Divine is a supplemental  rulebook for the 3.5 edition of the Dungeons & Dragons fantasy role-playing game published by Wizards of the Coast. It replaces and expands upon earlier rulebooks entitled Masters of the Wild and Defenders of the Faith, as well as being a catchall for anything that does not fit into Complete Adventurer, Complete Arcane, Complete Warrior, or Complete Psionic.\n\n\n== Contents ==\nIt presents additional base classes, prestige classes, and feats. It also contains additional rules and character ideas based on belief and the afterlife, as well as a chapter on magic items based on the original D&D pantheon gods and goddesses.\n\n\n=== New base classes ===\n\n\n==== Shugenja ====\nUpdated from Oriental Adventures, the shugenja utilizes primal energies, and tapping into the earth to cast spells. It is a charisma based sorcerer-style divine casting class, with a spell list biased towards elemental spells.\n\n\n==== Favored Soul ====\nUpdated from the Miniatures Handbook, the Favored Soul is a spontaneously casting divine class, with a couple of additional divine abilities closely tied to his or her deity.\n\n\n==== Spirit Shaman ====\nThe class has a fairly narrow divine spell selection. The spirit shaman cast spells as sorcerers do, but they change their spell selection each day by sending their Spirit Guide into the spirit world. The shaman also has a special abilities that affect spirits (incorporeal undead, fey, elementals and creatures defined as spirits in other texts). The Spirit Guide is a purely mental/spiritual creature, incapable of affecting the world, though it does grant the spirit shaman the feat, \"Alertness\", as well as justifying certain class features. Ultimately, at 20th level, the spirit shaman becomes a spirit (fey) himself, much as a 20th level monk becomes an outsider.\n\n\n=== New prestige classes ===\nThese include church inquisitor, consecrated harrier, contemplative, divine oracle, holy liberator, hospitaler, pious templar, sacred exorcist, sacred fist and warpriest (Defenders of the Faith), blighter and geomancer (Masters of the Wild), temple raider of Olidammara (Song and Silence), void disciple (Oriental Adventures), ur-priests (Book of Vile Darkness), stormlord (Faiths and Pantheons), radiant servant of Pelor and shining blade of Heironeous.\nIn addition, there are several previously undescribed prestige classes.\n\n\n==== Black flame zealot ====\nA class that combines a hashisheen cult with the Arabic view of Zoroastrian fire worship, but one which isn't automatically evil.\n\n\n==== Divine crusader ====\nA class for holy warriors dedicated to a single specific deity\n\n\n==== Entropomancer ====\nA class that worships oblivion and has the ability to summon fragments of a sphere of annihilation.\n\n\n==== Evangelist ====\nThe only five-level class in the book, designed for converting enemies rather than killing them.\n\n\n==== Rainbow servant ====\nA class of divine or arcane spellcasters trained by couatls to have similar abilities to the creatures.\n\n\n==== Seeker of the misty isle ====\nA class open only to elves and closely tied to their in-game mythologies.\n\n\n== Publication history ==\nComplete Divine was written by David Noonan, and was published in May 2004. Cover art was by Henry Higginbotham, with interior art by Kyle Anderson, Tom Baxa, Steven Belledin, Cris Dornaus, Wayne England, Jeremy Jarvis, Dennis Crabapple McClain, Raven Mimura, William O'Connor, Jim Pavelec, Wayne Reynolds, Scott Roller, Richard Sardinha, Ron Spencer, Arnie Swekel, and Franz Vohwinkel.\nDavid Noonan explains the designers' approach to preparing material for the book: \"In each section, we first decided what we wanted to pick up from previous D&D sources such as Defenders of the Faith and Faiths and Pantheons. That meant a lot of meetings and a lot of feedback from the fans. Then, especially for the spells, we looked for niches we hadn't filled yet. For example, there's a lot of design space left for high-level druid and cleric spells, ",
  "fetched_at": "2026-02-09T06:07:04.081346"
}