{
  "url": "https://en.wikipedia.org/wiki/Existence_of_God",
  "title": "Existence of God",
  "text": "The existence of God is a subject of debate in the philosophy of religion and theology. A wide variety of arguments for and against the existence of God (with the same or similar arguments also generally being used when talking about the existence of multiple deities) can be categorized as logical, empirical, metaphysical, subjective, or scientific. In philosophical terms, the question of the existence of God involves the disciplines of epistemology (the nature and scope of knowledge) and ontology (study of the nature of being or existence) and the theory of value (since some definitions of God include perfection).\nThe Western tradition of philosophical discussion of the existence of God began with Plato and Aristotle, who made arguments for the existence of a being responsible for fashioning the universe, referred to as the demiurge or the unmoved mover, that today would be categorized as cosmological arguments. Other arguments for the existence of God have been proposed by St. Anselm, who formulated the first ontological argument; Thomas Aquinas, who presented his own version of the cosmological argument (the first way); René Descartes, who said that the existence of a benevolent God is logically necessary for the evidence of the senses to be meaningful. John Calvin argued for a sensus divinitatis, which gives each human a knowledge of God's existence. Islamic philosophers who developed arguments for the existence of God comprise Averroes, who made arguments influenced by Aristotle's concept of the unmoved mover; Al-Ghazali and Al-Kindi, who presented the Kalam cosmological argument; Avicenna, who presented the Proof of the Truthful; and Al-Farabi, who made Neoplatonic arguments.\nIn philosophy, and more specifically in the philosophy of religion, atheism refers to the proposition that God does not exist. Some religions, such as Jainism, reject the possibility of a creator deity. Philosophers who have provided arguments against the existence of God include David Hume, Ludwig Feuerbach, and Bertrand Russell.\nTheism, the proposition that God exists, is the dominant view among philosophers of religion. In a 2020 PhilPapers survey, 69.50% of philosophers of religion stated that they accept or lean towards theism, while 19.86% stated they accept or lean towards atheism. However, philosophers as a whole tend to be more skeptical of God’s existence: the same survey found that 66.72% of all philosophers surveyed accepted or leaned towards atheism, while 18.64% accepted or leaned towards theism. Prominent contemporary philosophers of religion who defended theism include Alvin Plantinga, Yujin Nagasawa, John Hick, Richard Swinburne, and William Lane Craig, while those who defended atheism include Graham Oppy, Paul Draper, Quentin Smith, \nJ. L. Mackie, and J. L. Schellenberg.\n\n\n== Positions ==\nPositions on the existence of God can be divided along numerous axes, producing a variety of orthogonal classifications. Theism and atheism are positions of belief or lack of it, while gnosticism and agnosticism are positions of knowledge or the lack of it. Ignosticism concerns belief about God's conceptual coherence. Apatheism concerns belief about the practical importance of whether God exists.\nFor the purposes of discussion, Richard Dawkins described seven \"milestones\" on his spectrum of theistic probability:\n\nStrong theist. 100% probability that God exists. In the words of Carl G. Jung: \"I do not believe, I know.\"\nDe facto theist. Very high probability but short of 100%. \"I don't know for certain, but I strongly believe in God and live my life on the assumption that he is there.\"\nLeaning towards theism. Higher than 50% but not very high. \"I am very uncertain, but I am inclined to believe in God.\"\nCompletely impartial. Exactly 50%. \"God's existence and nonexistence are exactly equiprobable.\"\nLeaning towards atheism. Lower than 50% but not very low. \"I do not know whether God exists but I'm inclined to be skeptical.\"\nDe facto atheist. Very low p",
  "fetched_at": "2026-02-09T05:38:58.969115"
}