{
  "url": "https://en.wikipedia.org/wiki/Book_of_Noah",
  "title": "Book of Noah",
  "text": "The Book of Noah is thought to be a non-extant Old Testament pseudepigraphal work, attributed to Noah. It is quoted in several places in another pseudepigraphal work, 1 Enoch, and is mentioned in another, the Book of Jubilees. There have also been fragments attributed to a Book of Noah in the Dead Sea Scrolls.\n\n\n== Fragments ==\nThough this book has not come down to us independently, it has in large measure been incorporated in the Ethiopic Book of Enoch and can in part be reconstructed from it. \nThe Book of Noah is mentioned in Jubilees 10:13, 21:10. Chapters 58, 65-69:25 of the Ethiopic Enoch are without question derived from it. Thus 58 runs: \n\nIn the year 500, in the seventh month ... in the life of Enoch.\nHere, the editor simply changed the name Noah in the context before him into Enoch, for the statement is based on Gen. 5:32, and Enoch lived only 365 years. Chapters 6-11 are clearly from the same source; for they make no reference to Enoch, but bring forward Noah (10:1) and treat of the sin of the angels that led to the flood, and of their temporal and eternal punishment. This section is compounded of the Semjaza and Azazel myths, and in its present composite form is already presupposed by 1 Enoch 88-90. Hence these chapters are earlier than 166 B.C. Chapters 106-107 of the same book are probably from the same source; likewise 54:7-55:2, and Jubilees 7:20-39, 10:1-15.  In the former passage of Jubilees the subject-matter leads to this identification, as well as the fact that Noah is represented as speaking in the first person, although throughout Jubilees it is the angel that speaks. Possibly Eth. En. 41:3-8, 43-49, 59 are from the same work. The book may have opened with Eth. En. 106-107 On these chapters may have followed Eth. En. 6-11., 65-69:25, 60, 41:3-8, 43-44, 54:7-55:2; Jubilees 7:26-39, 10:1-15.\nThe Hebrew Book of Noah, a later work, is printed in Adolf Jellinek's Bet ha-Midrasch, 3:155-156, and translated into German in Rönsch, Das Buch der Jubiläen, 385-387. It is based on the part of the above Book of Noah which is preserved in the Book of Jubilees. The portion of this Hebrew work which is derived from the older work is reprinted in Charles's Ethiopic Version of the Hebrew Book of Jubilees, p. 179.\nJames Charlesworth writes (footnotes used for clarity)\n\nDuring the early parts of the second century B.C. a pseudepigraphon circulated that contained considerable material concerning Noah. The tradition was not merely oral but had been written down, since the author of Jubilees and of an interpolation in the Testament of Levi 18:2 refer to a 'Book of Noah'.\nThe work is now lost except for excerpts preserved in 1 Enoch and Jubilees, for 21 fragments preserved in Qumran Cave 1, and for two large fragments found in Cave 4 that are not yet published.\nFragment 4Q534 of the Book of Noah in the Dead Sea Scrolls describes the physical appearance of the royal messiah:\n\nOn his hair a birthmark of reddish colour. And the shape of a lentil will be on his face, and small birthmarks on his thigh. And after two years he will know how to distinguish one thing from another in his heart. In his youth, he will be like ... a man who knows nothing until the time when he knows the three Books. And then he will acquire prudence and learn understanding ... wise seers come to him, to his knees. And with his father and his ancestors .. of brothers will hurt him. Counsel and prudence will be with him, and he will know the secrets of man. His wisdom will reach all the peoples, and he will know the secrets of all the living. And all their designs against him will come to nothing, and his rule over the living will be great. His designs will succeed, for he is the Elect of God. His birth and the breath of his spirit ... and his designs shall be for ever ...\n\n\n== References ==\n\n\n== Further reading ==\nJames Charlesworth, The Pseudepigrapha and Modern Research\n\n\n== External links ==\nBook of Noah from the Early Jewish Writings Website\nQumran and Th",
  "fetched_at": "2026-02-09T06:13:34.817178"
}