{
  "url": "https://en.wikipedia.org/wiki/Chumbawamba",
  "title": "Chumbawamba",
  "text": "Chumbawamba () were an English band who formed in 1982 and disbanded in 2012. They are best known for their 1997 single \"Tubthumping\", which was nominated for Best British Single at the Brit Awards 1998. Other singles include \"Amnesia\", \"Enough Is Enough\" (with Credit to the Nation), \"Timebomb\", \"Top of the World (Olé, Olé, Olé)\", and \"Homophobia\". Their anarcho-communist political leanings led them to have an irreverent attitude toward authority, and to espouse a variety of political and social causes including animal rights and pacifism (early in their career) and later regarding class struggle, Marxism, feminism,  and anti-fascism.\nFor most of their career, the band had a 7–8 piece lineup and drew from a wide range of musical styles, including punk rock, pop, and folk. While their first two albums were largely punk and pop-influenced, their third was an entirely a capella album of traditional songs. In 2004, several long-term members left the band, which continued with a 4-piece (later 5-piece) acoustic lineup, with more folk-influenced output.\nIn July 2012, Chumbawamba announced they were splitting up after 30 years. The band was joined by former members and collaborators for three final shows between 31 October and 3 November 2012, one of which was filmed and released as a live DVD.\n\n\n== Name ==\nThe band's members have provided multiple mutually-exclusive explanations for the origin of the name \"Chumbawamba\", including Boff Whalley's story that it is a modification of the phrase \"Chum, chum-ba, wailah!\", which he heard chanted by an African drum band in Paris, and Danbert Nobacon's tale that it is inspired by a dream he had in which public toilets were not labeled \"male\" and \"female\", but \"chumba\" and \"wamba\". Jacobin suggested that \"it was a running joke with band members who competed to see who could tell the most ridiculous story about where it came from\".\nEarly interviews suggest that the band was initially called \"Chumbawailing\", and that they intended at one point to change the name for every gig.\nA section on the band's former website asserted that the name was deliberately meaningless, as a reaction to the \"obvious\" names common among bands at the time they formed, and because it did not pin them to any particular associations and would not date.\n\n\n== Band history ==\n\n\n=== Early years (1982–1984) ===\n\nChumbawamba formed in Burnley in 1982 with an initial line-up of Allan \"Boff\" Whalley, Danbert Nobacon (born Nigel Hunter), and Midge, all three previously members of the band Chimp Eats Banana, shortly afterwards joined by Lou Watts.  The band made their live debut in January 1982. Their first vinyl release was a track (\"Three Years Later\") on the Crass Records compilation album Bullshit Detector 2.  They were initially inspired musically by bands as diverse as the Fall, PiL, Wire, and Adam and the Ants and politically by the anarchist stance of Crass.  Another of the band's early releases was under the name \"Skin Disease\", parodying the Oi! bands of the time so successfully that they were included on Back On The Streets, an Oi! compilation EP put together by Sounds magazine journalist Garry Bushell.  \nIn the early period of the band, all members lived together in a communal house, Southview House, on Carr Crofts, Armley, Leeds and kept all money in common. \nBy the end of 1982, the band had expanded to include Alice Nutter (of Ow My Hair's on Fire), and Dunstan \"Dunst\" Bruce (of Men in a Suitcase), who also moved into the Leeds house. Harry \"Daz\" Hamer and Mavis \"Mave\" Dillon (aka David Mills, Man Afraid) - members, along with Whalley, of Barnsley punk band Passion Killers - joined soon after. Simon \"Commonknowledge\" Lanzon, who had been a member of Donovan's band Open Road in the early 1970s, appeared on most of the band's early releases but was not usually listed as a band member. Another band member, Diane, appeared on early cassettes, but was asked to leave the communal house after conflict with other band membe",
  "fetched_at": "2026-02-09T05:46:58.687017"
}