{
  "url": "https://en.wikipedia.org/wiki/Christ_myth_theory",
  "title": "Christ myth theory",
  "text": "The Christ myth theory, also known as the Jesus myth theory, Jesus mythicism, or the Jesus ahistoricity theory, is the fringe view that the story of Jesus is a work of mythology with no historical substance. Alternatively, in terms given by Bart Ehrman paraphrasing Earl Doherty, it is the view that \"the historical Jesus did not exist. Or if he did, he had virtually nothing to do with the founding of Christianity.\" \nThe mainstream scholarly consensus, developed in the three quests for the historical Jesus, holds that there was a historical Jesus of Nazareth who lived in first-century AD Roman Judea, but his baptism and crucifixion are the only facts of his life about which a broad consensus exists. Beyond that, mainstream scholars have no consensus about the historicity of other major aspects of the gospel stories, nor the extent to which they and the Pauline epistles may have replaced the historical Jesus with a supernatural Christ of faith.\nProponents of mythicism, in contrast, argue that a historical Jesus never existed, and that the gospels historicized a mythological character. This view can be traced back to the Age of Enlightenment, when history began to be critically analyzed; it was revived in the 1970s. Most mythicists employ a threefold argument: they question the reliability of the Pauline epistles and the gospels to establish Jesus's historicity; they argue that information is lacking on Jesus in secular sources from the first and early second centuries; and they argue that early Christianity had syncretistic and mythological origins as reflected in both the Pauline epistles and the gospels, with Jesus being a deity who was concretized in the gospels.\nThe non-historicity of Jesus has never garnered significant support among scholars. Mythicism is rejected by virtually all mainstream scholars of antiquity, and has been considered a fringe theory for more than two centuries, but has attracted more attention in popular culture with the rise of the Internet. \n\n\n== Traditional and modern approaches on Jesus ==\n\nMainstream scholarship asserts that there was a historical Jesus. However, scholars differ about the accuracy of the biblical accounts about Jesus, with only two events supported by nearly-universal scholarly consensus: Jesus' baptism, and his crucifixion. The mainstream scholarly view is that the Pauline epistles and the gospels describe the \"Christ of faith\", presenting a religious narrative which replaced the historical Jesus who did live in first-century Roman Judea. Martin Kähler made the famous distinction between the \"Jesus of history\" and the \"Christ of faith\", arguing that faith is more important than exact historical knowledge. According to Ehrman, Jesus was a first-century Judean Jew, who was not like the Jesus preached and proclaimed today, and that the most widely held view by critical scholars is that Jesus was an apocalyptic prophet who was subsequently deified.\nThe origins and rapid rise of Christianity, as well as the historical Jesus and the historicity of Jesus, are a matter of longstanding debate in theological and historical research. While Christianity may have started with an early nucleus of followers of Jesus, within a few years after the presumed death of Jesus in c. AD 33, at the time Paul started preaching, a number of \"Jesus-movements\" seem to have existed, which propagated divergent interpretations of Jesus' teachings. A central question is how these communities developed and what their original convictions were, as a wide range of beliefs and ideas can be found in early Christianity, including adoptionism and docetism, and also Gnostic traditions which used Christian imagery, which were all deemed heretical by proto-orthodox Christianity.\n\n\n=== Quest for the historical Jesus ===\n\nA first quest for the historical Jesus took place in the 19th century when hundreds of biographies about Jesus were proposed. German theologian David Strauss (1808–1874) pioneered the search for the \"histor",
  "fetched_at": "2026-02-09T05:46:31.631829"
}