{
  "url": "https://en.wikipedia.org/wiki/Kiddush_levana",
  "title": "Kiddush levana",
  "text": "Kiddush levana, also known as Birkat halevana, is a Jewish ritual and prayer service, generally observed on the first or second Saturday night of each Hebrew month. The service includes a blessing to God for the appearance of the new moon and further readings depending on custom. In most communities, ritual elements include the shalom aleikhem greeting and jumping toward the moon, with some also incorporating kabbalistic practices.\nThe oldest part of Kiddush levana, the blessing, is described by the Talmud. Other elements were introduced by Massechet Soferim in the 8th century, although their ultimate origin is obscure. In the years since, different Jewish communities have incorporated various quotations from the Bible and Talmud, liturgical compositions, and mystical customs into their version of the ritual. In the Ashkenazic rite it is an individual recitation, but a cantor may lead in Mizrahi communities. In Orthodox Judaism, it is almost exclusively reserved for men, but non-Orthodox Kiddush levana may involve men, women, or both.\nKiddush levana has featured in popular artwork, poems, jokes, stories, and folklore. Tunes based on its liturgy, especially \"David Melekh Yisrael Hai veKayyam\" and \"Siman Tov uMazel Tov Yehei Lanu ulkhol Yisrael\", have spread far beyond the original ritual. Marcia Falk has called it Judaism's most \"colorful and intriguing\" liturgy, while to Shai Secunda it is \"one of the most peculiar and mysterious\".\nSince the 15th century, Kiddush levana has been \"a highly visible target for rationalist critiques, both Jewish and non-Jewish\". Generations of the Authorised Daily Prayer Book expurgated all ritual elements, and some other 20th-century prayerbooks ignored it entirely. By the 1970s, it was widely described as defunct, although it soon began to regain Orthodox popularity. In 1992, Chabad announced a campaign to popularize its observance.\nAs of 2024, Kiddush levana is included with ritual elements in all mainstream Orthodox prayerbooks, including recent editions of the Authorised Daily Prayer Book. It is endorsed by Conservative Judaism, Reconstructionist Judaism, and Jewish Renewal. Although Kiddush levana remains controversial within Reform Judaism, it has recently been endorsed by Dalia Marx, Sylvia Rothschild, and other Reform leaders. Since 1976, many non-Orthodox women's groups have adopted Kiddush levana, and non-Orthodox masculine versions began appearing circa 1993. The ritual has been adapted for use in same-sex weddings, coming-out ceremonies, Brit bats, and the 2024 solar eclipse. It continues to evolve.\n\n\n== Development ==\n\nThe Talmud includes many blessings for the occasion of observing natural phenomena, but only the blessing over the moon has expanded into an elaborate service. Kiddush levana is generally understood to have resulted from the special importance provided to the moon by the rituals associated with declaring a new calendar month, which date back at least to the Second Temple period. Some scholars say that Kiddush levana evolved under their influence, while others say it was intended to replace these rituals, abandoned after the Hebrew calendar was fixed in the 4th century.\nA few argue that it was originally a device for secret communication during the Bar Kokhba revolt, but this is unlikely given its late date. According to Julius Eisenstein, Kiddush levana was instituted by the rabbis to comfort their flock in a time of oppression, as a protection against any harm that might come to them in that month. According to Leon Mandelstamm, it was intended as a substitute for regular observances in times of oppression, and maintained especially for marranos. Others say that it was instituted to protest Zoroastrian moon-worship or the Karaite calendar. Avram Arian calls it \"primarily a redemptive rite\", and Israel Zolli sees it as mostly penitential.\nHowever, many other scholars ascribe Kiddush levana a pagan origin. According to Jacob Reifmann, it was originally a magical practic",
  "fetched_at": "2026-02-09T06:01:01.160794"
}