{
  "url": "https://en.wikipedia.org/wiki/John_Major",
  "title": "John Major",
  "text": "Sir John Major (born 29 March 1943) is a British retired politician who served as Prime Minister of the United Kingdom and Leader of the Conservative Party from 1990 to 1997. He previously held various Cabinet positions under Margaret Thatcher. Major was Member of Parliament (MP) for Huntingdon, formerly Huntingdonshire, from 1979 to 2001. Since stepping down, Major has focused on writing and his business, sporting, and charity work, and commentating on political developments.\nMajor left school before 16, worked as an insurance clerk, joined the Young Conservatives in 1959, and became a highly active member. He was elected to Lambeth London Borough Council in 1968 and, a decade later, to parliament as a Conservative MP at the 1979 general election. Major held junior government positions under Thatcher from 1984 to 1987, including parliamentary private secretary and assistant whip. He served as Chief Secretary to the Treasury from 1987 to 1989, Foreign Secretary in 1989, and Chancellor from 1989 to 1990. Following Thatcher's resignation in 1990, Major stood in the 1990 Conservative leadership election and emerged victorious, becoming prime minister.\nMajor's mild-mannered style and moderate political stance contrasted with Thatcher. Major created the Citizen's Charter, replaced the Poll Tax with the Council Tax, committed British troops to the Gulf War, took charge of the UK's negotiations over the Maastricht Treaty, led the country during the early 1990s economic crisis, withdrew the pound from the European Exchange Rate Mechanism on Black Wednesday, promoted the socially conservative back to basics campaign, privatised the railways and coal industry, and played a pivotal role in creating peace in Northern Ireland. Two years into his premiership, Major led the Conservatives to a fourth consecutive electoral victory, winning more than 14 million votes, which remains the highest won by a British political party. In 1995, Major resigned as party leader, amid internal divisions over UK membership of the EU, parliamentary scandals and questions over his economic credibility. Despite winning the 1995 leadership election, his government remained unpopular, and lost its majority. The Labour Party pulled ahead of the Conservatives in every local election during Major's premiership, which increased after Tony Blair became Labour leader in 1994. The Conservatives were defeated by Labour in a landslide in the 1997 general election, ending 18 years of Conservative government.\n\nAfter Blair became prime minister, Major served as Leader of the Opposition while the leadership election to replace him took place, won by William Hague. Major remained in the House of Commons as a backbencher, regularly attending and contributing in debates, until he stood down at the 2001 election, to focus on writing and his business, sporting and charity work. Major has maintained a low profile, occasionally making political interventions. He supported the unsuccessful Britain Stronger in Europe campaign for the UK to remain in the European Union, and has often criticised Brexit since the 2016 referendum. Major was appointed a Knight Companion of the Order of the Garter (KG) in 2005 for services to politics and charity, and became a member of the Order of the Companions of Honour in 1999 for his work on the Northern Ireland peace process. Though public favourability of Major has improved since he left office, his premiership is viewed as average in historical rankings and public opinion of British prime ministers. As of 2026, he is the oldest living former British prime minister.\n\n\n== Early life and education (1943–1959) ==\n\nJohn Major was born on 29 March 1943 at St Helier Hospital and Queen Mary's Hospital for Children in St Helier, Surrey, to Gwen Major (née Coates, 1905–1970) and former music hall performer Tom Major-Ball (1879–1962), who was 63 years old when Major was born. He was christened \"John Roy Major\" but only \"John Major\" was recorded on his birth c",
  "fetched_at": "2026-02-09T06:20:30.795288"
}