{
  "url": "https://en.wikipedia.org/wiki/Firing_Line_(TV_program)",
  "title": "Firing Line (TV program)",
  "text": "Firing Line is an American public affairs television show. It first ran from 1966 to 1999, with conservative author and columnist William F. Buckley Jr. as host. It was relaunched in 2018 with Margaret Hoover as host.\nWith 1,504 episodes over 33 years under Buckley, Firing Line was the longest-running public affairs show with a single host in television history. The program featured many influential public figures in the United States and won an Emmy Award in 1969.\n\n\n== Broadcast history ==\n\nFiring Line began on April 4, 1966, as an hour-long show (including breaks) for commercial television. The program was produced at WOR-TV in New York City and was syndicated nationally through that station's parent company RKO General and later Show Corporation of America, a syndication firm which RKO acquired majority ownership of in 1968. Firing Line was mainly seen on weekends in low-rated afternoon or late-night time slots, because of the program's admitted appeal to a small, \"middle-brow\" demographic group. The first 39 episodes of the series were taped in black-and-white; the series was converted to color in January 1967.\nIn the fall of 1966, Firing Line began to appear on noncommercial educational television stations, mostly in areas where RKO General found it difficult to sell the program to a commercial outlet. After 240 episodes aired in commercial syndication Firing Line moved exclusively to noncommercial television in May 1971, distributed by the Public Broadcasting Service (PBS) and produced under the auspices of the Southern Educational Communications Association, an arm of South Carolina Educational Television. This was somewhat unusual, given the reputation among many conservatives that PBS unfairly discriminated against non-liberal viewpoints in its other programming. SECA/SCETV, however, was one of the very few public broadcasting entities of the time that was sympathetic to the conservative movement.\nBecause the program received a relatively unfavorable Sunday evening timeslot on PBS' schedule in the early 1970s, Buckley and long-time director Warren Steibel briefly attempted to return Firing Line to commercial TV, but could not find sponsors. Thus, the program would remain on PBS until Buckley and Steibel discontinued production on December 17, 1999, with Buckley's final episode airing December 26, 1999.\nIn April 2018, PBS announced that it would begin airing a new Firing Line, hosted by Margaret Hoover.\n\n\n== Buckley tenure ==\n\n\n=== Show format ===\nAlthough the program's format varied over the years, it typically featured Buckley interviewing, and exchanging views with, a guest, while seated together in front of a small studio audience. Standing or sitting further away in the studio, an \"examiner\", typically a liberal, would ask questions, generally toward the end of the show. Most guests were intellectuals or those in positions of power, being notable in the fields of politics, religion, literature and academia. Their views could either sharply contrast or be in strong agreement with Buckley's.\nReflecting Buckley's talents and preferences, the exchange of views was almost always polite, and the guests were given time to answer questions at length, giving the program a leisurely pace. \"The show was devoted to a leisurely examination of issues and ideas at an extremely high level\", according to Jeff Greenfield, who frequently appeared as an examiner. John Kenneth Galbraith said of the program, \"Firing Line is one of the rare occasions when you have a chance to correct the errors of the man who's interrogating you.\"\nThe show might be compared in politeness and style of discourse to other national public interview shows, specifically those hosted by Richard Heffner, Charlie Rose or Terry Gross, but Buckley was clearly interested in debate. In a 1999 Salon.com article, The Weekly Standard editor William Kristol summarized Buckley's approach to the show: \"Buckley really believes that in order to convince, you have to debate ",
  "fetched_at": "2026-02-09T06:22:17.883352"
}