{
  "url": "https://en.wikipedia.org/wiki/New_Jerusalem_Dead_Sea_Scroll",
  "title": "New Jerusalem Dead Sea Scroll",
  "text": "Discovered among the Dead Sea Scrolls near Qumran were fragments of a scroll which describes New Jerusalem in minute detail. The New Jerusalem Scroll appears to contain an apocalyptic vision, an eschatological vision of the city and the temple, although, being fragmented, it is hard to categorize. Written in Aramaic, the text describes a vast city, rectangular in shape, with twelve gates and encircled by a long wall. Similar descriptions appear in Revelation 21–22 (and possibly Ezekiel 40–48) and comparison to the Temple Scroll (also found near Qumran) shows many similarities despite no direct literary links between the two.\n\n\n== Scroll fragments ==\nMultiple copies or fragments of copies of the New Jerusalem Scroll were discovered within the caves surrounding Qumran. Images for each fragment are available at the Leon Levy Dead Sea Scrolls Digital Library. \n\n\n== The motif of a 'New' Jerusalem in the Bible and at Qumran ==\n\n\n=== Temple Scroll ===\nScholars debate the potential of a relationship between New Jerusalem and the Temple Scroll, another Qumran text featuring similar motifs.  An essay by B.Z. Wacholder explains that the New Jerusalem scroll is dependent on the Temple Scroll; the measurements and data go hand in hand. However, in the opinion of Lorenzo DiTommaso, \"there are almost no similarities between the two texts in the matter of genre, basic form and content, or architectural urban design. Furthermore, neither text is meaningfully dependent upon the other.\"\nDiTommaso states this because the New Jerusalem scroll is written in Aramaic, in third person of a description of a futuristic city, and described from DiTommaso as \"without legislative material\". Different measurements are used, such as rods for length and width. In the New Jerusalem no description of other urban cities surrounding the city exists. The description builds from the outside of the city towards the inside.\nWhile the Temple Scroll is written in first person, in the language of Hebrew, and described as legislative. The measurements used in the Temple Scroll are not the same, they do not use rods as a measurement. Lastly, in the Temple scroll it describes cities that are around the 'New Jerusalem'. The description is from the inside out.\nThree different descriptions are given about New Jerusalem, from Ezekiel, Revelation and writings found at Qumran. Significant similarities  can be drawn between the three.\n\n\n==== Ezekiel ====\nIn a vision, Ezekiel (40–48) saw the temple, the city and the land. In a sense, this is a heavenly blueprint. It is a layout for what is to be established after the exile. Rebuilding the temple was meant to glorify Yahweh in everything from its associated structures to its activities. The core of the vision, as Adela Yarbro Collins writes, \"... is the narrative that describes how an angel led the prophet through the new sanctuary, a tour that reaches the holy of holies\". Steven Tuell divides the description of all this into three sections. First, in 40–43:9, there is a description of the temple and the Lord's arrival to occupy it. Next, there is the law of the temple which is about the liturgy performed by the priests. Finally, the last two chapters deal with the river, land and city. The blueprint described by Ezekiel is believed to be exclusively concerned with restoration after the exile and is completely earth centered; the reconstruction of an earthly temple rather than a heavenly one.\nWhere is God in all of this? Tuell has the answer, \"Ezekiel and his editors agree on the fundamental answer to the question, \"where?\", it is here, in the midst of God's people, that God will be found\".\n\n\n==== Revelation ====\nThe author of the Revelation description took some ideas from Ezekiel. For example, it contains the use of the measuring rod which was used to determine the dimensions of the walls, gates, etc. He also took from Isaiah 65:17–18 which describes God creating a new Heaven and Earth. Jerusalem is also to be a \"joy and its peop",
  "fetched_at": "2026-02-09T02:48:30.223523"
}