{
  "url": "https://en.wikipedia.org/wiki/Dead_Sea_Scrolls",
  "title": "Dead Sea Scrolls",
  "text": "The Dead Sea Scrolls, in the narrow sense identical with the Qumran Caves Scrolls, are a set of ancient Jewish manuscripts from the Second Temple period. They were discovered over a period of ten years, between 1946 and 1956, at the Qumran Caves near Ein Feshkha in the West Bank, on the northern shore of the Dead Sea. Dating from the 3rd century BCE to the 1st century CE, the Dead Sea Scrolls include the oldest surviving manuscripts of entire books later included in the biblical canons, including  deuterocanonical manuscripts from late Second Temple Judaism and extrabiblical books. At the same time, they cast new light on the emergence of Christianity and of Rabbinic Judaism. In the wider sense, the Dead Sea Scrolls also include similar findings from elsewhere in the Judaean Desert, of which some are from later centuries. Almost all of the 15,000 scrolls and scroll fragments are held in the Shrine of the Book at the Israel Museum located in Jerusalem.\nThe Israeli government's custody of the Dead Sea Scrolls is disputed by Jordan and the Palestinian Authority on territorial, legal, and humanitarian grounds—they were mostly discovered following the Jordanian annexation of the West Bank and were acquired by Israel after Jordan lost the 1967 Arab–Israeli War—whilst Israel's claims are primarily based on historical and religious grounds, given their significance in Jewish history and in the heritage of Judaism.\nMany thousands of written fragments have been discovered in the Dead Sea area – most have been published, together with the details of their discovery, in the 40-volume Discoveries in the Judaean Desert. They represent the remnants of larger manuscripts damaged by natural causes or through human interference, with the vast majority holding only small scraps of text. However, a small number of well-preserved and nearly intact manuscripts have survived—fewer than a dozen among those from the Qumran Caves. Researchers have assembled a collection of 981 different manuscripts (discovered in 1946/1947 and in 1956) from 11 caves, which lie in the immediate vicinity of the Hellenistic Jewish settlement at the site of Khirbet Qumran in the eastern Judaean Desert in the West Bank. The caves are located about 1.5 kilometres (1 mi) west of the northwestern shore of the Dead Sea, whence the scrolls derive their name. Archaeologists have long associated the scrolls with the ancient Jewish sect known as the Essenes, although some recent interpretations have challenged this connection and argue that priests in Jerusalem or other unknown Jewish groups wrote the scrolls.\nMost of the manuscripts are written in Hebrew, with some written in Aramaic (for example the Son of God Text, in different regional dialects, including Nabataean) and a few in Greek. Other discoveries from the Judaean Desert add Latin (from Masada), and some later Arabic manuscripts from the 7th-8th centuries CE (from Khirbet al-Mird). Most of the texts are written on parchment, some on papyrus, and one on copper. Though scholarly consensus dates the Dead Sea Scrolls to between the 3rd century BCE and the 1st century CE, there are Arabic manuscripts from associated Judaean Desert sites that are dated between the 8th and 10th century CE. Bronze coins found at the same sites form a series beginning with John Hyrcanus, a ruler of the Hasmonean Kingdom (in office 135–104 BCE), and continuing until the period of the First Jewish–Roman War (66–73 CE), supporting the paleography and radiocarbon dating of the scrolls.\nOwing to the poor condition of some of the scrolls, scholars have not identified all of their texts. The identified texts fall into three general groups:\n\nAbout 40% are copies of texts from Hebrew scriptures.\nApproximately 30% are texts from the Second Temple period that ultimately were not canonized in the Hebrew Bible, such as the Book of Enoch, the Book of Jubilees, the Book of Tobit, the Wisdom of Sirach, Psalms 152–155, etc.\nThe remainder (roughly 30%) are sectaria",
  "fetched_at": "2026-02-09T02:48:18.178773"
}