{
  "url": "https://en.wikipedia.org/wiki/Modern_Jewish_historiography",
  "title": "Modern Jewish historiography",
  "text": "Modern Jewish historiography is the modern iteration of Jewish historical narrative writing and historical literature. While Jewish oral history and the collection of commentaries in the Midrash and Talmud are ancient, the rise of the printing press and movable type in the early modern period led to the publication of Jewish histories and early editions of the Torah/Tanakh that dealt with the history of Jewish diaspora ethno-religious groups, and increasingly, national histories of the Jews, Jewish nationhood or peoplehood and identity. This was a move from a manuscript or scribal culture to a printing culture. Jewish historians wrote accounts of their collective experiences, used history for political, cultural, and scientific or philosophical exploration, and drew upon a corpus of culturally inherited text.\nModern Jewish historiography intertwines with intellectual movements such as the European Renaissance and the Age of Enlightenment. It drew upon earlier works from the Late Middle Ages and antiquity, such as Christian and Hellenistic materials. Modern Jewish historiography as distinct from earlier medieval historiography and ancient biblical historiography developed characteristics of what historians think of as formal historiography such as the study of sources and methods.\n\n\n== Background and context ==\nHistorian Salo Baron argued that medieval Jews preferred storytelling to history, while Yosef Hayim Yerushalmi argued that past was remembered in ritual. However, the abundance of medieval works shows that medieval Jews both produced and consumed historical work.\nMircea Eliade defined Judaism as a \"historical religion;\" Yerushalmi disagreed, but believed Jews practiced oriented or sacred history, such as biblical history, and were the \"fathers of meaning in history.\" However, premodern Judaism before the Renaissance often didn't focus on post-biblical history, preferring philosophy and mysticism. Moshe Idel posits a model of Jewish history distinct from the typical role of history in European nationalism, conceived as a unification with, and then a rupture from, Jewish religious tradition.\nThough not many of their works fully survive, Hellenistic Jewish historians such as Artapanus of Alexandria and Eupolemus presented an interpretatio Judaica which argued for the antiquity of their people, drawing on inherited texts.  While Hellenistic Jewish historiography was forgotten by mainstream Jewish thought for many years, it was preserved by the Church and in the Book of Maccabees from Hasmonean Judea. The historical works of Philo of Alexandria and Justus of Tiberias are only partially preserved. Another example is Demetrius the Chronographer.\nThe earliest Hebrew books were printed in Rome starting in 1469. Early printers were aware of the strong sofer tradition of Hebrew scribal production. The move to printing eliminated the diversity in manuscripts and enabled texts to reach more people.\nThe major publications in Jewish history in the early modern period were influenced by the political climate of their respective times. Certain Jewish historians, acting on a desire to achieve Jewish equality, used Jewish history as a tool towards Jewish emancipation and religious reform. Regarding the Jewish historians of the 18th and 19th century, Michael A. Meyer writes that: \"Envisaging Jewish identity as essentially religious, they created a Jewish past that focused on Jewish religious rationality, and stressed Jewish integration within the societies in which Jews lived.\"\n\n\n=== Attitudes toward historical writing ===\nTalmudic authorities discouraged the writing of history in the medieval and early modern era; the extent to which this was effective in discouraging actual historical production is unclear. Moritz Steinschneider and Arnaldo Momigliano had observed that Jewish historiography appears to slow down at the end of the Second Temple period, and even Maimonides (1138–1204) considered history a waste of time. Maimonides does howev",
  "fetched_at": "2026-02-09T05:36:07.188278"
}