{
  "url": "https://en.wikipedia.org/wiki/Enoch_Powell",
  "title": "Enoch Powell",
  "text": "John Enoch Powell (16 June 1912 – 8 February 1998) was a British politician, scholar and writer. He was Member of Parliament (MP) for Wolverhampton South West for the Conservative Party from 1950 to February 1974 and the MP for South Down for the Ulster Unionist Party (UUP) from October 1974 to 1987. He was Minister of Health from 1960 to 1963 in the second Macmillan ministry and was Shadow Secretary of State for Defence from 1965 to 1968 in the Shadow Cabinet of Edward Heath. \nBefore entering politics, Powell was a classical scholar; in 1937 he was appointed Professor of Greek at the University of Sydney, aged only 25. He served in the British Army during the Second World War, reaching the rank of brigadier. He wrote both poetry and books on classical and political subjects. He is remembered particularly for his views on immigration and demographic change. In 1968 Powell attracted attention nationwide for his \"Rivers of Blood\" speech, in which he criticised immigration to Britain, especially the rapid influx from the Commonwealth of Nations (former colonies of the British Empire) in the post-war era. He opposed the Race Relations Bill, a major anti-discrimination bill which ultimately became law. His speech was criticised by some of his own party members and The Times as racialist. Heath, who was then the leader of the Conservative Party and the leader of the Opposition, dismissed Powell from the Shadow Cabinet the day after the speech. In the aftermath several polls suggested that between 67 and 82 per cent of the British population agreed with Powell. \nPowell turned his back on the Conservatives and endorsed a vote for the Labour Party, which returned as a minority government at the February 1974 general election. Powell was returned to the House of Commons in October 1974 as the Ulster Unionist Party MP for the constituency of South Down in Northern Ireland. He represented it until he was defeated at the 1987 general election. Powell died in 1998 aged 85 and remains a divisive and controversial figure in Britain.\n\n\n== Early years ==\nJohn Enoch Powell was born on 16 June 1912 in Stechford, within the city of Birmingham, and was baptised at the St Nicholas's Church in Newport, Shropshire, where his parents had married in 1909. He was the only child of Albert Enoch Powell, a primary school headmaster, and his wife, Ellen Mary Ellen (who was the daughter of Henry Breese, a Liverpool policeman, and his wife Eliza, who had been a teacher). His mother did not like his name and as a child he was known as \"Jack\". At the age of three, Powell was nicknamed \"the Professor\" because he used to stand on a chair and describe the stuffed birds that his grandfather had shot, which were displayed in his parents' home. In 1918 the family moved to Kings Norton, where Powell remained until he went up to the University of Cambridge in 1930.\nThe Powells were of Welsh descent and from Radnorshire (a Welsh border county), having moved to the developing Black Country during the early 19th century. Enoch's great-grandfather was a coal-miner and his grandfather had been in the iron trade.\nPowell read avidly from a young age; as early as three, he could \"read reasonably well\". Though not wealthy, the Powells were financially comfortable and their home included a library. By the age of six, Powell loved to read. Every Sunday he would give lectures to his parents on the books that he had read and also conducted evensong and preached a sermon. Once he was old enough to go out on his own, Powell would walk around rural Worcestershire with the aid of Ordnance Survey maps, which instilled in him a love for landscape and cartography.\n\n\n== Education ==\nPowell attended a dame school until he was eleven. He was then a pupil for three years at King's Norton Grammar School for Boys before he won a scholarship to King Edward's School in Birmingham in 1925, aged 13. The legacy of the First World War loomed large for Powell; almost all his teachers had fought in the ",
  "fetched_at": "2026-02-09T05:48:54.224769"
}