{
  "url": "https://en.wikipedia.org/wiki/Egregore",
  "title": "Egregore",
  "text": "An Egregore (also spelled egregor; from French  égrégore, from Ancient Greek  ἐγρήγορος, egrēgoros 'wakeful') is a concept in Western esotericism of a non-physical entity or thoughtform that arises from the collective thoughts and emotions of a distinct group of individuals.\n\n\n== Overview ==\nIn magical and other occult traditions, it is typically seen as having an independent existence, but in other kinds of esotericism, it is merely the collective mind of a religious community, either esoteric or exoteric. In the latter sense, as a collective mind, the term collective entity, preferred by René Guénon, is synonymous with egregore. See the usage overview below.\nIn the apocryphal Book of Enoch, the term referred to angelic beings known as watchers. Some other literary and religious works, such as The Manuscript Found in Saragossa, have also made references to these angelic beings.\n\n\n== Variant descriptions ==\n\n\n=== As independent angelic being ===\n\nEgregores are quite independent entities in the Book of Enoch, and there was then no notion that they arose from a collective. In literature, especially older literature, \"egregores\" have often been straightforward references to these Enochian entities. This is the case in Jan Potocki's novel The Manuscript Found in Saragossa, which calls egregores \"the most illustrious of fallen angels\". The French author Victor Hugo, in La Légende des siècles (1859) (\"The Legend of the Ages\"), also uses the word égrégore, first as an adjective, then as a noun, while leaving the meaning obscure.\n\n\n=== As spiritual elite ===\nThe Traditionalist School philosopher Julius Evola, in his Revolt Against the Modern World, referred to an elite of spiritually aware people, who keep Tradition alive, as \"those who are awake, whom in Greek are called the εγρῄγοροι\", apparently alluding to the Watchers, and the most literal sense of their name, which is \"wakeful\" or \"awake\".\n\n\n=== As group mind ===\nIn esotericism, \"egregore\" has been used to denote a \"group mind\" or \"collective consciousness\" of a religious community. René Guénon said, \"the collective, in its psychic as well as its corporeal aspects, is nothing but a simple extension of the individual, and thus has absolutely nothing transcendent with respect to it, as opposed to spiritual influences, which are of a wholly different order\". This usage was followed by Gnosis magazine and by Olavo de Carvalho, and, according to Guénon, began with Éliphas Lévi.\nThe concept of a tulpa is similar.\n\n\n== In occult and magical thought ==\n\n\n=== In Meditations on the Tarot ===\nThe Meditations on the Tarot describe the Antichrist as \"an egregore, an artificial being who owes his existence to collective generation from below\". Elsewhere, the book calls egregores \"demons engendered by the collective will and imagination of nations\". The book cites, but does not completely agree with, the usage of Robert Ambelain in his La Kabbale pratique. Ambelain defined the egregore as \"a force generated by a powerful spiritual current and then nourished at regular intervals, according to a rhythm in harmony with the universal life of the cosmos, or to a union of entities united by a common characteristic nature\". The author of the Meditations on the Tarot calls this passage from Ambelain \"a definition which leaves nothing more to be desired\", but disagrees with Ambelain's description of Catholicism, Freemasonry, and Protestantism as egregores.\n\n\n=== In the work of Gary Lachman ===\nGary Lachman follows the usage of the Meditations on the Tarot in his book Dark Star Rising, which also suggests that Pepe the Frog may be an egregore in this sense—or a tulpa, which Lachman sees as a similar phenomenon. In the usage of Lachman and of the Meditations on the Tarot, \"there are no 'good' egregores, only 'negative' ones\". Lachman cited Joscelyn Godwin's The Golden Thread, which itself cited the Meditations on the Tarot, as a source for the idea that, while a religious (or other) group who creates an ",
  "fetched_at": "2026-02-09T02:44:53.543277"
}