{
  "url": "https://en.wikipedia.org/wiki/Enoch_Adeboye",
  "title": "Enoch Adeboye",
  "text": "Enoch Adejare Adeboye  (born 2 March 1942) is a Nigerian pastor, and the present General Overseer of The Redeemed Christian Church of God. He served as the second national president of the Pentecostal Fellowship of Nigeria.\n\n\n== Early life ==\nEnoch Adejare Adeboye was born on 2 March 1942 in Ifewara, near Ife, in the then Southern Region, British Nigeria. He was born into a very humble family, and often tells the story of wearing his first shoes at the age of 18.\n\n\n== Education ==\nEnoch Adejare Adeboye started his education at Ilesha Grammar School Ilesha Osun State in 1956. Enoch Adejare Adeboye then proceeded to the University of Nigeria Nsukka (UNN) in Nsukka, but because of the Nigeria Civil War, he completed his first degree in the University of Ife (now Obafemi Awolowo University), graduating with a Bachelor's degree in Mathematics in 1967.\nIn 1969, he obtained a Master's degree in Hydrodynamics from University of Lagos, and in 1975, he obtained a Ph.D. in Applied Mathematics from the University of Lagos.\n\n\n== Ministry ==\nAdejare Adeboye joined the Redeemed Christian Church of God in 1973 and served as an interpreter before he was ordained a pastor in the church by Pa. Josiah Akindayomi in 1975. He became General Overseer of the church in 1981. For three years, he filled the role part-time at Unilorin before giving up his university position to preach full-time. In 2017, Adeboye announced his resignation as General Overseer, but he retained the role.\nThe church, which was not well known before Adeboye became the General Overseer, has branches in about 198 nations as of (March 2017), including more than 14,000,000 worshipers in Nigeria. Adeboye has stated that he aims to put a church within five minutes' walking distance in developing cities and five minutes' driving distance in developed cities.\nAdeboye is considered a preacher of the prosperity gospel, a claim he does not deny. He says \"Pentecostals have such an impact because they talk of the here and now, not just the by and by… while we have to worry about heaven, there are some things God could do for us in the here and now.\"\nHe celebrated his 80th birthday in 2022. Adeboye's foundation donated eight dialysis machines to Wuse District Hospital, together with a reverse osmosis medical water purification system and an electrical generator.\n\n\n== Publications ==\nAdeboye has written several books, including:\n\nOpen Heavens Daily Devotional\nLessons from the Sower\nChristian Moderator\nDeadly Enemy of Man\nDivine Favour\nKingdom Prosperity\nFruits of the Spirit\nGod of Wonders\nGod’s Remembrance and Deliverance\nPrevailing Prayers\nThe Wonder Working God\nTransitions\nMathematics & Greatness\nBehold, He Cometh! Are You Prepared?\nAs Pure as Light\nLast days: A Study of the Book of Revelation\nWorkers in Training Manual\nIn His Presence\nDavid\nSigns and wonders\nAre you working with God: Are you a partner?\nA biographical book titled ENOCH, detailing the life and ministry of Pastor Adeboye was released in late 2025. The book, which followed a biopic film on Pastor Adeboye, was written by Oluwakemi Sodeinde.\n\n\n== University endowments ==\nAdeboye has endowed four Nigerian universities, including Obafemi Awolowo University and the University of Nigeria.\n\n\n== Awards and recognition ==\n1 of the 50 most powerful people in the world by Newsweek (2008)\nAdeboye was cited as one of the Top 100 most influential Africans by New African magazine in 2019.\n\n\n=== Honorary doctorates ===\nHe has received several honorary doctorates.\n\n2009 : Honorary doctorate, University of Lagos\n2009 : Honorary doctorate, University of Nigeria\n2009 : Doctor of Theology, Canada Christian College\n2011 : Honorary doctorate, University of Ibadan\n2015 : Doctor of Science, University of Lagos\n2016 : Honorary doctorate, Obafemi Awolowo University\n2017 : Doctor of Divinity, University of Nigeria\n2022 : Doctor of Divinity, Oral Roberts University\n\n\n== Personal life ==\nAdeboye married Folu Adeboye on 17 December 1967. He is a father to ",
  "fetched_at": "2026-02-09T06:13:05.118459"
}