{
  "url": "https://en.wikipedia.org/wiki/Heraklion",
  "title": "Heraklion",
  "text": "Heraklion, Herakleion ( hih-RAK-lee-ən; Greek: Ηράκλειο, Iráklio, pronounced [iˈrakli.o], not to be mistaken with Heracleion, Egypt) or Iraklion, is the largest city and the administrative capital of the island of Crete and capital of Heraklion regional unit. It is the fourth largest city in Greece, and the largest city in the Greek islands, with a municipal population of 179,302 (2021) and 211,370 in its wider metropolitan area, according to the 2011 census.\nThe greater area of Heraklion has been continuously inhabited since at least 7000 BCE, making it one of the oldest inhabited regions in Europe. It is also home to the ancient Knossos Palace, a major center of the Minoan civilization dating back to approximately 2000-1350 BCE, often considered Europe's oldest city. The palace is one of the most significant archaeological sites in Greece, second only to the Parthenon in terms of visitor numbers.\nHeraklion was Europe's fastest growing tourism destination for 2017, according to Euromonitor, with an 11.2% growth in international arrivals. According to the ranking, Heraklion was ranked as the 20th most visited region in Europe, as the 66th area on the planet and as the 2nd in Greece for the year 2017, with 3.2 million visitors and the 19th in Europe for 2018, with 3.4 million visitors.\n\n\n== Etymology ==\nThe name Herakleion (Ηράκλειον) is derived from an ancient port of Heracleium that served as the harbour for Knossos. The port, bearing the same name, was named in honour of the hero Heracles (Hercules). In antiquity, it was located about 20 stadia (approximately 3.7 kilometers) from Knossos. Strabo also confirms the connection between the two.\nThe site of the ancient port falls within the boundaries of the modern city, near today’s port area. Although ecclesiastical records do not list it as a bishopric, a bishop named Theodoros of Heracleopolis is mentioned at the Second Council of Nicaea.\nThe name was revived in the 19th century and was in use by locals as early as 1867.\n\n\n=== Other names ===\n1. In antiquity: The area that would later become the city of Heraklion served as the port for the ancient city of Knossos, one of the centers of the Minoan civilization. This strategic location facilitated trade and communication across the Mediterranean. Over time, as Knossos declined, the port area grew in significance, eventually becoming a prominent urban center.\n2. Rabḍ al-ḫandaq (ربض الخندق): In 824 CE, Arab exiles from al-Andalus (Iberia) who conquered Crete and founded the Emirate of Crete moved the island's capital from Gortyna to a new castle they called rabḍ al-ḫandaq (\"Castle of the Moat\").\n3. Chándax (Χάνδαξ) / Chándakas (Χάνδακας): The Arabic name rabḍ al-ḫandaq was Hellenized to Χάνδαξ (Chándax) or Χάνδακας (Chándakas).\n4. Candia: This name, derived from Chándax, was Latinized as Candia and adopted into other European languages: in Italian and Latin as Candia, in Spanish as Candía, in French as Candie, and in English as Candy. These names could refer to the island of Crete as a whole as well as to the city alone; the Ottoman name for the city was Kandiye.\n5. Megalo Kastro (Μεγάλο Κάστρο): After the Byzantine reconquest of Crete, the city was locally known as Megalo Kastro (Μεγάλο Κάστρο, 'Big Castle' in Greek) and its inhabitants were called Kastrinoi (Καστρινοί, \"castle-dwellers\").\n\n\n== History ==\n\n\n=== Minoan era ===\nHeraklion is home to the ruins of the palace of Knossos, located in the southern periphery of the city and part of the Heraklion municipality. In Minoan times, Knossos was the largest centre of population on Crete and is considered by many to be the oldest city in Europe.\nKnossos itself had a port at the site of Heraklion (in the modern area of Poros-Katsambas neighborhood) from the beginning of the Early Minoan period (3500 to 2100 BC).\n\n\n=== Antiquity ===\n\nAfter the fall of the Minoans, Heraklion, as well as the rest of Crete in general, fared poorly, with very little development in the area. Only with th",
  "fetched_at": "2026-02-09T05:56:07.670935"
}