{
  "url": "https://en.wikipedia.org/wiki/Shayatin",
  "title": "Shayatin",
  "text": "Shayāṭīn (Arabic: شَيَاطِين shayāṭīn; sing. شَيْطَان shayṭān) refers to a class of evil spirits in Islam, inciting humans and jinn to sin by whispering (وَسْوَسَة waswasa) in their hearts (قَلْب qalb). According to Islamic tradition, though invisible to humans, shayāṭīn are imagined to be ugly and grotesque creatures created from the fires of hell.\nThe Quran speaks of various ways the shayāṭīn tempt humans into sin. They may teach sorcery, float below the heavens to steal the news of the angels, or lurk near humans without being seen. Several hadith tell of how the shayāṭīn are responsible for various calamities that affect personal life. Both the hadith literature and Arab folklore usually speak of the shayāṭīn in abstract terms, describing their evil influence only. According to hadith, during Ramadan they are said to be chained up.\nIn Islamic theology, the influence of the shayāṭīn on humans is elaborated as an internal struggle against the noble angels, often described in the invisible reality called alam al-mithal or alam al-malakut. On a narrative perspective, Islamic traditions disagrees whether the shayāṭīn are simply misguided jinn, or a separate class of being. The latter position often identifies them with the terrestrial angels who defied Adam as a governor of Earth and become enemies of mankind.\n\n\n== Etymology and history ==\nThe term shayāṭīn roughly corresponds to the English words \"demons\", \"satans\", or \"devils\". The Arabic term šayṭān originated from the triliteral root š-ṭ-n (\"distant, astray\") and is cognate to Satan. It has a theological connotation designating a creature distant from the divine mercy. As a spirit, it can refer both to pre-Islamic jinn as well as satans comparable to the Jewish tradition.\nIn pre-Islamic usage, the term is attested in Geʽez. In the Book of Enoch, \"angels of punishment prepare the instruments for the säyəṭanə\". Similarly to the Quranic usage, the term referred to the hosts of Satan. Book of Jubilees mentions the shayṭān Mastema, who commands over evil spirits (manafəsəta).\nBesides referring to a specific entity, the term shayāṭīn is also applied to any being who rebels against God. This can be from among the jinn as well as humans. The template for this descriptive character of the term is already provided by the Quran. In Surah 6:112, the Quran speaks about shayāṭīn from al-ins wa al-jinn (humans and jinn).\nJacques Waardenburg argued that jinn underwent a transition from neutral spirits to demons through the progress of Qur‘anic revelation whereby substituting jinn by the shayāṭīn , and explains by that the absence of jinn mentioned in Medinan Surahs and presence of multiple satans whereas Christian tradition knows only one satan. Accordingly, the multitude of devils may have been adopted from previous jinn-beliefs. \nPaul Arno Eichler, however, held this theory unconvincing; since the idea of a multitude of shayāṭīn already existed in Judeo-Christian tradition, independent from jinn-beliefs. Generally, the term šayṭān appears in traditions associated with Jewish and Christian narratives, while the term jinn represents entities of polytheistic background.\nIn the Qur’an, the existence of the shayāṭīn, like that of jinn, is taken for granted. While the jinn are autonomous spirits of pre-Islamic Arabian beliefs, the shayāṭīn are primarily adversaries of the believers („satans“). The origin and theological purpose of the shayāṭīn is then explained through the figure of al-šayṭān (the Devil). Through analysis of textual criticism, Karl-Friedrich Pohlmann argues that the Quranic figure of the primary Devil was a later redaction in order to offer a theological explanation for the opposition towards Islam told through the concept of satans and a respond to discussions regarding the origin of evil (unde malum?).\nThe narratives about the primary devil reveal strong parallelism to Judeo-Christian traditions, particularly Vitae Adam et Eva which may have served as a foundation of theologi",
  "fetched_at": "2026-02-09T06:15:58.104460"
}