{
  "url": "https://en.wikipedia.org/wiki/Damascus_Document",
  "title": "Damascus Document",
  "text": "The Damascus Document is an ancient Hebrew text known from both the Cairo Geniza and the Dead Sea Scrolls. It is considered one of the foundational documents of the ancient Jewish community of Qumran.\nThe Damascus Document is a fragmentary text, no complete version of which survives. There have been attempts to reconstruct the original text from the various fragments. The medieval recension appears to have been shorter than the Qumran version, but where they overlap there is little divergence. The correct ordering of all the Qumran fragments is not certain.\nThe Damascus Document's primary body of composition is a compilation of sectarian laws that have been coupled with historical information on the sect, and utilize the same figure names used in the group's pesharim commentaries. As the rules permit a woman to marry and possess private property, most scholars believe that they were composed to determine the lifestyles of the Essenes who lived in the camps and did not join the Qumran community. The redactor of the text allows that the covenant is open to all Israelites who accept the sect's halakha, while condemning the others as the \"wicked of Judah\" against whom God would direct \"a great anger with flames of fire by the hand of all the angels of destruction against persons turning aside from the path\". The text states that those who abandon the true covenant \"will not live\".\n\n\n== Name ==\nThe fragments found in Cairo in 1897 were originally called the Zadokite Fragments but after the work was found at Qumran, the name was changed because the document had numerous references to Damascus. The way this Damascus is treated in the document makes it possible that it was not a literal reference to Damascus in Syria, but to be understood either geographically for Babylon or Qumran itself. If symbolic, it is probably taking up the Biblical language found in Amos 5:27, \"therefore I shall take you into exile beyond Damascus\"; Damascus was part of Israel under King David, and the Damascus Document expresses an eschatological hope of the restoration of a Davidic monarchy.\n\n\n== Discovery ==\nTwo manuscripts (CDa and CDb) were found in Cairo, with further findings at Qumran. In contrast to the fragments found at Qumran, the CD documents are largely complete, and therefore are vital for reconstructing the text.\n\n\n=== Cairo Geniza ===\nThe main fragments were discovered by Solomon Schechter in 1897 in the Cairo Geniza, a storeroom adjoining Ben Ezra Synagogue in Fustat (Old Cairo), among over 190,000 manuscripts and fragments that were written in mainly Hebrew and Judaeo-Arabic. The fragments were quite large, and a number of them matched documents found later in Qumran. They were divided into two separate sections, CDa, and CDb. Schechter dated CDa to the 10th century C.E and CDb to 11th or 12th century C.E. These fragments are housed at the Cambridge University Library with the classmarks T-S 10K6 and T-S 16.311 (other references are CDa and CDb).\n\n\n=== Qumran scrolls ===\nThe fragments from Qumran have been assigned the document references 4Q266-73 (pictured above), 5Q12, and 6Q15.\n\n\n== Structure ==\nThe combined text of CDa and CDb contains twenty columns of writing. As it has come down to us, two columns have been mislocated: columns 15 & 16 originally preceded col 9. Fragments of this text from Qumran include material not found in CD.\nThe Damascus Document can be divided into two separate sections, commonly called Admonition and Laws. Davies divides the Admonition into four sections: History, Legal, Warnings, a Supplement (which Wise refers to as exhortations). The Admonition comprises moral instruction, exhortation, and warning addressed to members of the sect, together with polemic against its opponents; it serves as a kind of introduction to the second section.\nThe Laws feature Oaths & vows, Sundry rulings (halakhot), Camp laws, and a fragment of Penal codes (more of which were found in the Qumran fragments).\n\n\n=== The Admonition ===\nThi",
  "fetched_at": "2026-02-09T05:54:56.912998"
}