{
  "url": "https://en.wikipedia.org/wiki/Epistle_of_Barnabas",
  "title": "Epistle of Barnabas",
  "text": "The Epistle of Barnabas (Ancient Greek: Βαρναβᾶ Ἐπιστολή) is an early Christian Greek epistle written between 70 and 135 AD. The complete text is preserved in the 4th-century Codex Sinaiticus, where it is positioned at the end of the New Testament, following the Book of Revelation and preceding the Shepherd of Hermas.\nFor several centuries, the epistle was categorized among the \"antilegomena\" (\"disputed writings\"); while some early Christians regarded it as sacred scripture, others excluded it. Eusebius of Caesarea classified it with excluded texts. It is mentioned in a perhaps third-century list in the sixth century Codex Claromontanus and in the later Stichometry of Nicephorus appended to the ninth-century Chronography of Nikephoros I of Constantinople. Some early Fathers of the Church ascribed it to the Barnabas mentioned in the Acts of the Apostles, but it is now generally attributed to an otherwise unknown early Christian teacher (though some scholars do defend the traditional attribution). It is distinct from the Gospel of Barnabas.\nThe central message of the Epistle of Barnabas is that the writings comprising the Hebrew Bible—what would become the Old Testament of the Christian Bible—were, from even their times of authorship, written for use by Christians rather than the Israelites and, by extension, the Jews. According to the epistle, the Jews had misinterpreted their own law (i.e., halakha) by applying it literally; the true meaning was to be found in its symbolic prophecies foreshadowing the coming of Jesus of Nazareth, whom Christians believe to be the messiah. Furthermore, the author posits that the Jews broke their covenant from the very beginning and were misled by an evil angel. After explaining its Christian interpretations of the Jewish scriptures, the epistle concludes by discussing the \"Two Ways\", also seen in the Didache: a \"Way of Light\" and a \"Way of Darkness\".\n\n\n== Manuscript tradition ==\nThe 4th-century Codex Sinaiticus (S), discovered by Constantin von Tischendorf in 1859 and published by him in 1862, contains a complete text of the Epistle placed after the canonical New Testament and followed by the Shepherd of Hermas. The 11th-century Codex Hierosolymitanus (H), which also includes the Didache, the two Epistles of Clement and the longer version of the Letters of Ignatius of Antioch, is another witness to the full text. It was discovered by Philotheos Bryennios at Constantinople in 1873 and published by him in 1875. Adolf Hilgenfeld used it for his 1877 edition of the Epistle of Barnabas. A family of 10 or 11 manuscripts dependent on the 11th-century Codex Vaticanus graecus 859 (G) contain chapters 5:7b−21:9 placed as a continuation of a truncated text of Polycarp's letter to the Philippians (1:1–9:2). An old Latin version (L), perhaps of no later than the end of the 4th century, that is preserved in a single 9th-century manuscript (St Petersburg, Q.v.I.39) gives the first 17 chapters (without the \"Two Ways\" section of chapters 18 to 21). This is a fairly literal rendering in general, but is sometimes significantly shorter than the Greek text. S and H generally agree on readings. G often agrees with L against S and H. A small papyrus fragment (PSI 757) of the third or fourth century has the first 6 verses of chapter 9, and there are a few fragments in Syriac of chapters 1, 19, 20. The writings of Clement of Alexandria give a few brief quotations, as to a smaller extent do Origen, Didymus the Blind and Jerome.\n\n\n== Status for Christians ==\n\nThe Epistle was viewed as authoritative scripture by some Christians in the early centuries of church history. It was attributed to Barnabas, the companion of Paul the Apostle, by Clement of Alexandria (c. 150 – c. 215) and Origen (c. 184 – c. 253). Clement quotes it with phrases such as \"the Apostle Barnabas says.\" Origen speaks of it as \"the General Epistle of Barnabas\", a phrase usually associated with canonical non-Pauline epistles.\nIn the fourth century, the Ep",
  "fetched_at": "2026-02-09T06:23:58.997603"
}