{
  "url": "https://en.wikipedia.org/wiki/Clementine_literature",
  "title": "Clementine literature",
  "text": "The Clementine literature (also referred to as the Clementine Romance or Pseudo-Clementine Writings) is a late antique third-century Christian romance containing an account of the conversion of Clement of Rome to Christianity, his subsequent life and travels with the apostle Peter and an account of how they became traveling companions, Peter's discourses, and finally Clement's family history and eventual reunion with his family. To reflect the pseudonymous nature of the authorship, the author is sometimes referred to as Pseudo-Clement. In all likelihood, the original text went by the name of Periodoi Petrou (\"Circuits of Peter\"); sometimes historians refer to it as the \"Grundschrift\" (\"Basic Writing\").\nThough lost, the original survives in two recensions known as the Clementine Homilies and the Clementine Recognitions. The overlap between the two has been used to produce a provisional reconstruction of the Circuits of Peter. Respectively, the original titles for these two texts were the Klementia and the Recognitions of the Roman Clement. Both were composed in the fourth-century. In turn, there was plausibly a second-century document (referred to as the Kerygmata Petrou (\"Preaching of Peter\")) that was used as a source for the original Clementine literature text. The Kerygma is thought to consist of a letter from Peter to James, lectures and debates of Peter, and James's testimony about the letters recipients.\nSome believe that the original was lost due to the substantially greater popularity of its recensions in the Homilies and Recognitions. These were so popular that translations and recensions of them appeared in Syriac, Greek, Latin, Ethiopic, Arabic, Slavonic, and Georgian. Vernacular versions also appeared in Icelandic, Old Swedish, Middle High German, Early South English, and Anglo-Norman.\n\n\n== Overview ==\nTwo versions of this romance have survived:\n\nClementine Homilies (H), consisting of the Epistle of Peter, the Adjuration (also called Contestation) and finally the Epistle of Clement, all followed by twenty numbered books. The books are each called a \"Homily\", but more accurately, they are theological-philosophical dialogues.\nClementine Recognitions (R), for which the original Greek has been lost but exists in a Latin translation produced by Rufinus of Aquileia in 406.\nQuotations of the original are also available from the writings of Origen, the Apostolic Constitutions of Epiphanius, the Chronicon Paschale, and possibly, the Cave of Treasures and the writings of Lactantius.\nTwo later epitomes of the Homilies also exist, and there is a partial Syriac translation, which includes passages from both the Recognitions (specifically books 1–3), and the Homilies (books 10–14), preserved in two Syriac British Library manuscripts, one of which was written in the year 411. Fragments of the Clementine literature are also known in Arabic, Classical Armenian, and Old Church Slavonic. Though H and R largely correspond in wording and content, and have a similar length and framework, there is material that is distinctive to both.\nIt is now almost universally held that H and R are two versions of an original and longer Clementine romance that largely covered the content in the extant versions.\n\n\n== Law ==\nGentile and Jewish law is an important focus of the Clementine literature. It sharpens the divide between the two forms of these laws as was earlier witnessed in the canonical Acts of the Apostles. Jews need to follow all of the Law of Moses described in the Torah (though they are not discussed in detail) whereas gentiles need to follow the teachings of Jesus. However, unlike previous writings which comment on gentile and Jewish law, the Clementine literature goes further insofar as it holds the position that Jews do not need Jesus to attain salvation; in turn, gentiles do not need the Law of Moses either. Hence, the text endorses an ethnic separation between Jews and gentiles. The Homilies even say that a pagan might be saved throu",
  "fetched_at": "2026-02-09T02:44:55.135041"
}