{
  "url": "https://en.wikipedia.org/wiki/Abraham_Zacuto",
  "title": "Abraham Zacuto",
  "text": "Abraham Zacuto (Hebrew: אַבְרָהָם בֵּן שְׁמוּאֵל זַכּוּת‎, romanized: Avraham ben Shmuel Zacut, Portuguese: Abraão ben Samuel Zacuto; 12 August 1452 – c. 1515) was a Sephardic Jewish astronomer, astrologer, mathematician, rabbi and historian. Born in Castile, he served as Royal Astronomer to King John II of Portugal before fleeing to Tunis.\nHis astrolabe of copper, astronomical tables, and maritime charts played an important role in the Spanish and Portuguese voyages of discovery, being used by both Vasco Da Gama and Christopher Columbus.\n\n\n== Life ==\nZacuto was born in Salamanca, Castile in 1452. He may have studied and taught astronomy at the University of Salamanca. He later taught astronomy at the universities of Zaragoza and then Carthage. He was well versed in Jewish Law, and was the rabbi of his community. Zacuto was actually Abraham Zacuto III, his ancestor the first was the author of the Sepher ha-Mishpotim in 1311, which today is in the library of the Jewish Theological Seminary in New York. He writes that his family had resided in Iberia since the expulsion of the Jews from France in 1306. His brother in law was the kabbalist, Rabbi Abraham ben Eliezer Halevi\nWith the Catholic Monarchs of Spain issuing the 1492 Alhambra Decree ordering the expulsion of the Jews, Zacuto took refuge in Lisbon, Portugal. Already famous in academic circles, he was invited to court and nominated Royal Astronomer and Historian by King John II of Portugal, a position which he held until the early reign of Manuel I. He was consulted by the king on the possibility of a sea route to India, a project which he supported and encouraged.\nZacuto was one of the few who managed to flee Portugal during the forced conversions and prohibitions of departure that the Portuguese king Manuel I enacted to keep the Jews in Portugal as nominal Christians for foreign policy reasons (see persecution of Jews and Muslims by Manuel I of Portugal). Zacuto first fled to Tunis and later moved to Jerusalem. He probably died in 1515 in Jerusalem; however, other reports indicate his final home was the Jewish community in Damascus and his death occurred in 1520. Though in a similar vein to other giants of the Jewish faith, such as Saadia Gaon, Maimonides and the Vilna Gaon, he followed the custom (believed to have begun in the Babylonian captivity) of being buried as close to Jerusalem as possible. Zacuto had announced his wish to make his death pilgrimage at a Passover gathering.\n\n\n== Work ==\n\n\n=== Ha-ḥibbur ha-gadol ===\nAbraham Zacuto developed a new type of astrolabe, specialised for practical determination of latitude while at sea, in contrast to earlier multi-purpose devices intended for use ashore. Zacuto's principal claim to fame is the great astronomical treatise, written in Hebrew while he was in Salamanca,  with the title Ha-ḥibbur ha-gadol (\"The Great Book\").  It was begun around 1470 and completed in 1478. It was composed of 65 detailed astronomical tables (ephemerides), with radix set for the year 1473 and with the meridian at Salamanca, charting the positions of the Sun, Moon and five planets.  The calculations were based on the Alfonsine Tables and the works of earlier astronomers (notably of the 14th-century Majorcan school).  Zacuto set out the data in a simple \"almanac\" format, with the positions of a planet easily interpolated between entries, making it quite easy to use.\nThe first Castilian translation was undertaken in 1481 by Juan de Salaya.  Zacuto's Portuguese disciple Joseph Vizinus (Mestre José Vizinho, the much-valued physician and advisor of John II of Portugal) translated it into Latin, under the title Tabulae tabularum Celestium motuum sive Almanach perpetuum (\"Book of Tables on the celestial motions or the Perpetual Almanac\"), along with a new Castilian translation, and arranged for its publication in 1496 by Samuel d'Ortas in Leiria, Portugal. (one of the first books published in Portugal with a movable type printing press).\n\n\n=== Biur luḥ",
  "fetched_at": "2026-02-09T05:20:49.904979"
}