{
  "url": "https://en.wikipedia.org/wiki/Proud_Boys",
  "title": "Proud Boys",
  "text": "The Proud Boys is an American far-right, neo-fascist militant organization that promotes and engages in political violence. The group's leaders have been convicted of violently opposing the federal government of the United States, including its constitutionally prescribed transfer of presidential power. It has been called a street gang and was designated as a terrorist group in Canada and New Zealand. The Proud Boys are opposed to left-wing and progressive groups and support President Donald Trump. While Proud Boys leadership has denied being a white supremacist organization, the group and some of its members have been connected to white supremacist events, ideologies, and other white-power groups throughout its existence.\nThe group originated in the far-right Taki's Magazine in 2016 under the leadership of the Vice Media co-founder and the former commentator Gavin McInnes, taking its name from the song \"Proud of Your Boy\" from the Walt Disney Company’s musical Aladdin from 2011. Although the Proud Boys emerged as part of the alt-right, McInnes distanced himself from the movement in early 2017, saying the Proud Boys were alt-lite while the alt-right's focus was on race.  Donald Trump's comment, \"Proud Boys, stand back and stand by\", during a presidential debate in September 2020 prior to the 2020 U.S. presidential election was credited with increasing interest and recruitment. After the remark caused an outcry for its apparent endorsement, Trump condemned the Proud Boys while saying he did not \"know much about\" them.\nAccording to the International Centre for Counter-Terrorism the group believes that traditional masculinity and Western culture are under siege, using \"Western chauvinism\" as euphemism for the white genocide conspiracy theory. Members have participated in overtly racist events and events centered around fascist, anti-left, and anti-socialist violence. The Southern Poverty Law Center (SPLC) has called the group an \"alt-right fight club\" and a hate group that uses rhetorical devices to obscure its motives. The Anti-Defamation League (ADL) described the Proud Boys as \"extremist conservative\" and \"alt lite\", \"overtly Islamophobic and misogynistic\", \"transphobic and anti-immigration\", \"all too willing to embrace racists, antisemites and bigots of all kinds\", and cites the group's promotion and use of violence as a core tactic.\nThe group has been banned from multiple social networks, including Facebook, Instagram, Twitter, and YouTube. In February 2021 the U.S. Department of Justice announced the indictment of members for conspiracy related to the 2021 United States Capitol attack, and the Canadian arm of the group folded after being designated a terrorist organization. \nAs of February 3, 2025, the trademarked name of Proud Boys Intl., LLC is owned by Metropolitan African Methodist Episcopal Church. A court awarded this property to the church to satisfy its judgment regarding the Proud Boys' 2020 vandalization of a Black Lives Matter banner.\n\n\n== History and organization ==\nGavin McInnes co-founded Vice magazine in 1994, but was pushed out in 2008 due to \"creative differences\". After leaving, he began \"doggedly hacking a jagged but unrelenting path to the far-right fringes of American culture\", according to a 2017 profile in the Canadian Globe and Mail. The Proud Boys organization was launched in September 2016, on the website of Taki's Magazine, a far-right publication for which white nationalist Richard B. Spencer had once served as executive editor. It existed informally before then as a group centered around McInnes, and the first gathering of the Brooklyn chapter in July 2016 resulted in a brawl in the bar where they met.\nThe name is derived from the song \"Proud of Your Boy\", originally created for Disney's 1992 film Aladdin but left out following story changes in production; it was later featured in the 2011 musical adaptation. In the song, the character Aladdin apologizes to his mother for being a bad son and pro",
  "fetched_at": "2026-02-09T05:48:11.320835"
}