{
  "url": "https://en.wikipedia.org/wiki/4Q521",
  "title": "4Q521",
  "text": "4Q521 or the Messianic Apocalypse is one of the Dead Sea Scrolls found in the Cave 4 near Qumran.\n\n\n== Description ==\n4Q521 comprises two larger fragments. The original editor was Jean Starcky, though translation revisions have been proposed by Émile Puech.\n\n\n== Text ==\nThe text:\n\n\n== Analysis ==\nThe subject of the text is eschatological and makes a connection with the healing ministry of the Messiah. 4Q521 may be related to other apocalyptic end-time texts, 4QSecond Ezekiel 4QApocryphon of Daniel, and has been studied in relation to the Gospel of Luke's Messianic Magnificat and Benedictus; especially striking is the comparison with Luke 7:22 about raising the dead.\nThe references to heaven and earth listening to the Messiah are not paralleled in any other text in the context of Second Temple Judaism and have given speculation as to the heavenly status of the Messiah in this text. Some see it as an allusion to Isaiah 1:2a which says \"Hear, O heavens, and listen, O earth; for the Lord has spoken\". However, heaven and earth are also said to listen to Moses in Deuteronomy 32:1, precluding any conclusions about the heavenly status of the Messiah in 4Q521. There is also some dispute among scholars as to whether the Greek \"anointed one\" should be read in the defective plural as \"anointed ones\", which would form a parallelism to the second half of the first line to the \"holy ones\" (angels) and imply that both halves of the text are referring to angelic figures, rather than a Messiah.\nThe Messiah/anointed figure in 4Q521 is commonly interpreted as an Elijah-type figure rather than a Davidic warrior Messiah. In the Dead Sea Scrolls, Hebrew prophets, such as Elijah, are regularly referred to as \"anointed ones\". Furthermore, it is the role of a herald or messenger to \"bring good news to the poor\" (line 12), suggesting a prophetic rather than warrior figure. The description of Elijah in Ben Sira provides a direct parallel with 4Q521's reference to the Messiah commanding the heavens and the earth, where, through the authority of God, Elijah himself commands the heavens: \"By the word of the Lord he shut up the heavens and also three times brought down fire\" (Sira 48:3). The two trees in Revelation 11 that prevent rainfall are also commonly interpreted as symbols for Elijah and Moses. Another fragment of 4Q521 reads \"(1) and the precept of your mercy and I will liberate them (2) for it is sure: 'the fathers will return to the sons.'\" This phrase is a reference to Malachi 3:24, where Elijah \"will turn the hearts of fathers to their children and the hearts of children to their fathers.\" Sirach 48:10 also cites Malachi 3:24 when describing Elijah.\n\n\n== See also ==\nLuke 1\n\n\n== References ==\n\n\n== External links ==\nFlorentino García Martínez. \"Qumran scroll 4Q521, text and translation\". Archived from the original on 2022-10-19.\nComparison between 4Q521 and early Gospel tradition by James Tabor",
  "fetched_at": "2026-02-09T06:13:34.656922"
}