{
  "url": "https://en.wikipedia.org/wiki/Jadranka_Đokić",
  "title": "Jadranka Đokić",
  "text": "Jadranka Đokić (born 14 January 1981) is a Croatian actress. One of the top Croatian actresses, she has won critical approval for her theatre, film and television performances.\nHer notable film roles include starring in Fine Dead Girls, Sorry for Kung Fu, Behind the Glass, Storm, Metastases and The Priest's Children. For her performance in Behind the Glass, she won the 2008 Golden Arena for Best Actress. In television, she gained massive mainstream TV fame for her lead roles as nurse Helga in Naša mala klinika, Verica in Luda kuća, herself in Moja 3 zida and Lili in Ko te šiša. She was also lauded for her award-winning performances in HNK Zagreb, including King Lear, Tartuffe, A Winter's Tale, Uncle Vanya, Svaki tvoj rođendan and The Idiot. Đokić voiced Terk in the Croatian dub of Tarzan.\n\n\n== Early life ==\nĐokić was born in Pula on 14 January 1981. She was born to Croatian parents of Bosnian descent, and raised in the neighbourhood of Šijana, near the Pula Arena. In Pula, she finished primary school and gymnasium. She was theatre fan in her teenage years. Đokić graduated from the Academy of Dramatic Art, University of Zagreb, from which she earned a Master of Fine Arts Degree.\n\n\n== Career ==\n\n\n=== Theatre ===\nĐokić started her career in drama studio INK Pula. She was mentored by Robert Raponja and mostly performed Shakespearean plays, including Othello, Timon of Athens, Hamlet and Cymbeline. After entering the Academy of Dramatic Art, University of Zagreb, she achieved her first professional engagement in Spring Awakening, directed by Ozren Prohić.\nIn 2011,  she won the Croatian Theatre Award for Best Actress for her performance in Ovo bi mogla biti moja ulica. She starred alongside Suzana Nikolić and Nataša Dorčić in the production, and it was presented in Zagreb, Rome, Prague and Berlin.\nIn 2018, she performed as Cordelia in the HNK Zagreb production of King Lear, with Predrag Miki Manojlović portraying the title king.\nThe 2019 premier of The Idiot saw Đokić as Nastasya Filippovna. For the Vasilij Senin-directed performance she received immense admiration among critics winning a Vladimir Nazor Award for excellence in theatre and a Croatian Actor Award for Best Actress in a Leading Role.\n\n\n=== Television ===\nTo television audiences, she known for her role as nurse Helga in comedy series Naša mala klinika. From 2004 to 2009, Naša mala klinika was the most watched television series in Croatia. Večernji list proclaimed her as the best actress in a comedy series, awarding her with two Večernji List Screen Awards for Best Actress in a Comedy Series, in 2007 and 2008. Prominent Balkan film critics, including Milivoj Jukić and Dalibor Rajić praised her character delivery and comedic timing, and her eccentric, emotionally vulnerable and optimistic character is considered to be the show's breakout character. The same year, she became a member of the ensemble ZKM.\nOther than nurse Helga, her repertoire on television includes being the main part of the ensemble cast of three other long-running Croatian sitcoms, being Luda kuća, Moja 3 zida and Ko te šiša. From 2009 to 2011, he starred alongside actor Ozren Grabarić in the popular sitcom series Moja 3 zida, which was filmed in her own apartment. For Ko te šiša, the most watched Croatian comedy series from 2016 to 2019, she received critical and commercial exaltation for her performance as hairdresser Lili.\nShe appeared in Kada zvoni? as Gabrijela, and played the supporting role of Ruža in the children's television show Žutokljunac.\n\n\n=== Film ===\nĐokić made her acting debut in the 1999 film Šverceri hlapić directed by fellow Pula native Luka Juričić, who also made his debut in this movie, as supporting Nataša Malek. Her first critically defined role was in Fine Dead Girls, directed by Dalibor Matanić, followed by the role of Zorica in the Ognjen Sviličić-directed drama film Sorry for Kung Fu.\nShe played the protagonist, Klara in the 2007 independent film Pusti me da spavam, directed by ",
  "fetched_at": "2026-02-09T05:55:34.372237"
}