{
  "url": "https://en.wikipedia.org/wiki/Rei_III",
  "title": "Rei III",
  "text": "\"Rei III\" is the twenty-third episode of the Japanese anime television series Neon Genesis Evangelion, created by Gainax. The episode was written by Hideaki Anno and Hiroshi Yamaguchi and directed by the animator Shōichi Masuo. In the episode, Rei Ayanami, the pilot of the giant mecha Evangelion Unit-00, is attacked by the sixteenth in a series of enemies of mankind called Angels, Armisael, and decides to commit suicide to defeat the enemy. Following her death, her fellow pilot Shinji Ikari and Misato Katsuragi, head of the strategy department of the military agency Nerv, discover thanks to Dr. Ritsuko Akagi that Rei is a series of replaceable clones.\nThe episode is characterized by dramatic tones but still by a speed and dryness in the exposition of the series's mysteries. Critics also interpreted some imagery from the episode, including a nude scene involving Ritsuko and Rei's battle against Armisal, as sexual imagery of rape. \"Rei III\" contains cultural references to Christian iconography, quantum physics, the concept of death drive postulated by Sigmund Freud, and Sailor Moon, among others.\n\"Rei III\" was first broadcast on 6 March 1996 and drew a 6.9% audience share on Japanese television. The episode received an ambivalent reception from critics. Some of them praised the revelations of Rei's true identity and the action scenes; other reviewers criticized said revelations, plus the animation quality and the voice acting.\n\n\n== Plot ==\nAsuka Langley Soryu, a pilot assigned to the giant mecha Evangelion Unit-02, sinks into clinical depression in the grip of an existential crisis. She leaves the home of Misato Katsuragi, her legal guardian, to go to the home of her friend Hikari Horaki, where she spends her days playing video games. Gendo Ikari, supreme commander of the special agency Nerv, is questioned by the secret sect Seele about the previous battle, in which he used a weapon called the Spear of Longinus against Seele's plans.\nDuring Gendo's interview, the sixteenth in a series of enemies of mankind known as Angels, Armisael, is sighted. Rei Ayanami, pilot of the Evangelion Unit-00, confronts it in combat, but is violated by Armisael, who violates the Eva-00's body and sneaks into Rei's mind in the form of another self. Shinji Ikari, Gendo's son and pilot of the Evangelion-01, goes out to rescue Rei, but is also attacked by Armisael. To kill Armisael, Rei decides to let herself explode while inside the Eva-00 with the Angel. After the fight, Misato tries to console despondent Shinji, who refuses her comfort.\nNerv warns Shinji that Rei has survived. Rei, however, proves unable to remember the fight, treating Shinji coldly and saying she is the third one. Ritsuko Akagi, head of Nerv's science department, is sent by Gendo to a Seele interrogation in place of Rei. Ritsuko, feeling betrayed, calls Shinji and Misato to explain several dark truths about the Evangelions and Rei. They descend into the depths of the Nerv headquarters, discovering that Rei is a collection of clones with a soul that is activated from time to time and can be replaced. Out of anger and resentment at Gendo, Ritsuko destroys Rei's clones before breaking down in tears.\n\n\n== Production ==\n\n\n=== Genesis and staff ===\nIn 1994, Gainax released an initial presentation for Neon Genesis Evangelion containing an initial synopsis of the twenty-third episode. In the original draft, the episode, initially titled \"The Human Instrumentality Project\" (人類補完計画, jinrui hokan keikaku), would have centred on a series of revelations of secrets about the Evangelions, the true intentions of Gendo Ikari and Ritsuko Akagi, and the Human Instrumentality, a project pursued by Gendo and other characters in the series to evolve humanity towards a new stage of evolution. In the following episode, \"Now, the Promised Time\" (今、契約時間, ima, keiyaku jikan), Rei's secrets would be revealed, and twelve powerful enemies called Apostolo, later called Angels, would descend from the Moon. The pro",
  "fetched_at": "2026-02-09T06:15:15.094877"
}