{
  "url": "https://en.wikipedia.org/wiki/List_of_legendary_creatures_by_type",
  "title": "List of legendary creatures by type",
  "text": "This list of legendary creatures from mythology, folklore and fairy tales is sorted by their classification or affiliation. Creatures from modern fantasy fiction and role-playing games are not included.\n\n\n== Animals, creatures associated with ==\n\n\n=== Arthropods ===\n\nKarkinos (Greek) – Crab who attacked Heracles and was killed, becoming the constellation of Cancer.\nNerites (Greek) – Minor sea deity turned into a shellfish by jealous gods.\nŌmukade (Japanese) – Giant man-eating centipede, but weak to human saliva.\nZaratan (Arabic) – Giant crab mistaken for an island.\n\n\n==== Insects ====\n\n\n==== Scorpions ====\n\n\n==== Spiders ====\n\n\n=== Birds ===\n\n\n==== Avian Humanoids ====\n\n\n==== Chickens ====\n\n\n==== Corvids ====\n\n\n==== Eagles ====\n\n\n==== Owls ====\n\nChickcharney (Bahamas) – Magical owl with powers over fate, sometimes encountered by travellers in pine forests.\nNyctimene (Roman) – Princess transformed into an owl by Minerva.\nOwlman (English) – Owl-like humanoid compared to America's Mothman.\nSirin (Slavic) – Birds with women's heads who lured men to their deaths.\nStrix (Greek) – Owl that ate human flesh.\n\n\n=== Fish ===\n\n\n=== Mammals ===\n\n\n==== Aquatic and marine-based ====\n\n\n==== Bats ====\n\nBalayang (Australian Aboriginal) – Bat-god and brother to Bunjil.\nCamazotz (Mayan) – Bat spirit and servant of the lords of the underworld.\nLeutogi (Polynesian) – Samoan princess rescued by bats.\nMinyades (Greek) – Three sisters who refused to take part in the worship of Dionysus, and turned into bats by Hermes.\nTjinimin (Australian Aboriginal) – Ancestor of the Australian people.\nVetala (Hindu) – Vampiric entity that takes over cadavers.\n\n\n==== Carnivorans ====\n\n\n===== Bears =====\n\nBjarndyrakongur (Icelandic) –  King of bears. Stems from Polar Bear sightings in Iceland being extremely rare, but not unheard of. Has a shining horn on its head topped with a ball and red patches on cheeks.\nBugbear (Celtic) – Child-eating hobgoblin.\nCallisto (Greek) – A nymph who was turned into a bear by Hera.\nStiff-Legged Bear (Native American) – Gigantic, hairless bear monster in tribal folklore, predominantly Iroquoians and Algonquians, possibly inspired by mammoths.\n\n\n===== Canines =====\n\n\n====== Foxes ======\n\n\n===== Felines =====\n\n\n====== Lions ======\n\n\n===== Hyenas =====\nWerehyena\n\n\n===== Musteloids and non-hyena herpestoids =====\n\n\n===== Procyonids =====\nAzeban – trickster raccoon spirit in Abenaki mythology\n\n\n==== Marsupials ====\n\nDrop bear\nBunyip  (Australian Aboriginal)\n\n\n==== Primates ====\n\n\n==== Rabbits and hares ====\n\n\n==== Rodents ====\n\nAfanc\nLavellan (Scottish) – Water shrew or water vole with poisonous abilities, said to be able to injure cattle over a hundred feet away.\nRatatoskr\nRat king; phenomenon in which a number of rats become intertwined at their tails (Germany, France).\nWolpertinger\n\n\n==== Ungulates ====\n\n\n===== Antelopes and deer =====\n\n\n===== Bovines =====\n\n\n===== Camelids =====\nAllocamelus – A donkey-headed camel.\nHeavenly Llama\n\n\n===== Caprids =====\n\n\n===== Equines =====\n\n\n===== Pachyderms =====\n\nAbath\nBaku\nBehemoth\nQuugaarpak - (Inuit) Explanation for Mammoths & other Ice Age remains washing out of riversides. Underworld monsters who dig their way up to the human world, but die upon breathing our air.\nTaweret\n\n\n===== Pigs and boars =====\n\nCalydonian Boar\nErymanthian Boar\nZhu Bajie\n\n\n==== Xenarthrans ====\nMapinguari\n\n\n=== Molluscs ===\n\nAkkorokamui – octopus monster (Ainu, Japan)\nAmikuk (Yup'ik) - Shapeshifting four armed 'octopus' that can swim through land as easily as water.\nCarbuncle (Chilote) – one of its many descriptions is a luminescent bivalve\nLou Carcolh – A giant, man-eating snail with fur and tentacles (France)\nKraken – squid monster (Worldwide)\nShen – A clam-dragon that creates mirages and fata morgana at sea (China)\n\n\n=== Reptiles ===\n\n\n==== Limbed ====\n\n\n==== Serpents and worms ====\n\n\n=== Megafauna ===\n\n\n==== Giants ====\n\n\n== Artificial creatures ==\nThis listing includes creatures that are man-made, mechanical or of alchem",
  "fetched_at": "2026-02-09T06:14:50.816937"
}