{
  "url": "https://en.wikipedia.org/wiki/Aramaic_Enoch_Scroll",
  "title": "Aramaic Enoch Scroll",
  "text": "The Aramaic Enoch Scroll is a non-published, complete copy of the Book of Enoch which is rumored to be in possession of private investors.\nThere is no proof of its existence, but according to the former chief editor of the official Dead Sea Scrolls editorial team, John Strugnell (1930 - 2007), the scroll is well preserved, and microfilmed. Strugnell said that he was shown the microfilm in 1990, during the Kuwait crisis, but he was never able to buy it for the editorial team.\n\n\n== Qumran Cave 11 ==\n\nAccording to Strugnell, the scroll was found in the Qumran \"Cave 11\", in 1956, together with the other, already publicized scrolls and fragments. This cave was found by the same Bedouin, Abu Dahoud, who found the first cave in 1947.\nApart from this and another scroll from Cave 11 that he claimed to have seen, Strugnell had heard Gerald Lankester Harding, the director of Jordan's Department of Antiquities (1936–1956), speak of at least two, never-published scrolls from the same find. These, or some of them, were at that time (the Kuwait crisis) about to be bought by private, probably European collectors or bankers. The reason for buying them was for investments. Although Strugnell had arrangements with serious buyers who would publicize the scrolls, he was not able to convince the owners to sell them.\nAbu Dahoud has confirmed that he and ten other men found the cave, and sold the scrolls to many different people.\n\n\n== Importance ==\nThe importance of a complete Aramaic manuscript of the Book of Enoch could be immense. Michael Wise, a DSS scholar, writes: \"No trace of the Parables of Enoch has been discovered at Qumran, and it is widely considered today to be a composition of the later first century C.E. If a pre-Christian copy of the Parables were ever discovered, it would create a sensation.\"\nThe Parables is a part of the Ethiopic translation of the Book of Enoch. It is disputed how old it is, and whether it was originally a part of Enoch. Currently, most scholars believe it to be pre-Christian.\n\n\n== References ==",
  "fetched_at": "2026-02-09T02:51:31.907392"
}