{
  "url": "https://en.wikipedia.org/wiki/Giovanni_Mercurio_da_Correggio",
  "title": "Giovanni Mercurio da Correggio",
  "text": "Giovanni Mercurio da Correggio (Latin name: Iohannes Mercurius de Corigio; 1451 – ?) was an Italian itinerant preacher, Hermeticist, and alchemist. Due to his bizarre appearance in Rome on Palm Sunday 1484 he has been believed by some scholars to have not actually existed, but this has been contested with other reports that corroborate his eccentricities. His most notable follower was Lodovico Lazzarelli, an Italian humanist poet and alchemist, who writes his accounts of da Correggio in his Epistola Enoch.\n\n\n== Biography ==\n\n\n=== Early life ===\nGiovanni da Correggio was born sometime around 1451 to a noble family in Bologna, and was likely the illegitimate son of a certain Antonio da Correggio (not the artist), who died in 1474. Da Correggio is also likely from the same feudal family that produced Niccolò da Correggio. He does not appear to have had any formal education in academics, oration, grammar, or rhetoric, but nevertheless went on to become a very eloquent wandering preacher.\nThe first account of da Correggio was on 12 November 1481 in Rome, where Lodovico Lazzarelli encountered him as an apocalyptic preacher trying to gain the attention of the pope (Sixtus IV) and the College of Cardinals. Lazzarelli was so taken in by da Correggio that he decided to become his pupil.  This meeting is reported by Lazzarelli to have been a turning point in his life and studies. It is possible that Lazzarelli may have introduced da Correggio to Hermetic philosophy and writings.\n\n\n=== Palm Sunday 1484 ===\nOn Palm Sunday, 11 April 1484 da Correggio is reported by Lazzarelli to have been in Rome dressed in rich garments and gold with four servants. Lazzarelli reports that da Correggio then exits the city of Rome, and returns riding on a white donkey in imitation of Jesus. He is wearing blood-stained linen garments, a crown of thorns, on top of which is a silver crescent moon shaped disk. He then travels up to Saint Peter's Basilica and walks right up to the altar. Da Correggio places upon the altar his mystical apparel and a paper entitled The Eternal Gospel, knelt to pray, and then left. He proclaimed that he was \"Giovanni Mercurio da Correggio\" (or the Latin equivalent: \"Iohannes Mercurius de Corigio\"), \"the angel of wisdom,\" \"Poimandres\" (or Pimander, a Hermetic manifestation of the mind of God), and \"the most perfect manifestation of Jesus Christ.\" He distributed scrolls that read: \"Ego Joannes Mercurius de Corigio, sapientiae angelus Pimanderque in summo ac maximo spiritus Jesu Chrisi excessu, hanc aquam regni pro paucis, sic super omnes magna voce evangelizo.\"\nAccording to Lazzarelli da Correggio did all this completely unaccosted.\nThe only other account of da Correggio's Palm Sunday appearance in Rome was written by Abraham Farissol, an Italian Jewish scholar and scribe, in his Magen Avraham, who was in Rome at the time. According to Farissol da Correggio never even made it to the altar, but was arrested for heresy. According to Farissol da Correggio also calls himself \"Son of God,\" \"Hermes Trismegistus,\" \"Enoch,\" and \"Methuselah.\" Later da Correggio escapes from prison, possibly with the assistance of some friends.\nAccording to both Lazzarelli and Farissol, after leaving Rome, da Correggio returns to Bologna to his wife, Elana Marie, and five children. Upon arriving in Bologna da Correggio is arrested again with new charges of heresy, but either escapes from prison in Bologna or is released.\n\n\n=== Later life ===\nAfter 1484, Giovanni da Correggio begins to wander from city to city preaching. Accounts of his appearances throughout Italy are scarce and scattered.\nThe first appearance of da Correggio since Palm Sunday is on 4 July 1486 in Florence while on his way to Naples. Lazzarelli was in the court of Ferdinand I of Naples at the time, and Ferdinand I requested to meet with da Correggio. While in Florence da Correggio is ordered to be arrested by Lorenzo de' Medici and accosted by a Franciscan inquisitor. It is unclear if da Correg",
  "fetched_at": "2026-02-09T06:06:05.865444"
}