{
  "url": "https://en.wikipedia.org/wiki/Second_Temple_period",
  "title": "Second Temple period",
  "text": "The Second Temple period or post-exilic period in Jewish history denotes the approximately 600 years (516 BCE – 70 CE) during which the Second Temple stood in the city of Jerusalem. It began with the return to Zion after the Babylonian captivity and the subsequent reconstruction of the Temple in Jerusalem, and ended with the First Jewish–Roman War and the Roman siege of Jerusalem.\nIn 587/586 BCE, the Neo-Babylonian Empire conquered the Kingdom of Judah; the Judeans lost their independence upon the Babylonian siege of Jerusalem, during which the First Temple was destroyed. After the Babylonians annexed Judah as a province, part of the subjugated populace was exiled to Babylon. This exilic period lasted for nearly five decades, ending after the Neo-Babylonian Empire itself was conquered by the Achaemenid Persian Empire, which annexed Babylonian territorial possessions after the fall of Babylon. Soon after the conquest, Persian king Cyrus the Great issued a proclamation known as the Edict of Cyrus, encouraging the exiles to return to their homeland after the Persians raised it as an autonomous Jewish-governed province. Under the Persians (c. 539–332 BCE), the returned Jewish population restored the city and rebuilt the Temple in Jerusalem. In 332 BCE, the Achaemenid Empire fell to Alexander the Great, and the region was later incorporated into the Ptolemaic Kingdom (c. 301–200 BCE) and the Seleucid Empire (c. 200–167 BCE).\nThe Maccabean Revolt against Seleucid rule led to the establishment of a nominally independent Jewish kingdom under the Hasmonean dynasty (140–37 BCE). While it initially exercised governance semi-autonomously under Seleucid hegemony, the Hasmonean kingdom increasingly exercised total self-governance as it undertook military campaigns to push the weakening Seleucids out of the region, establishing itself as the last Jewish kingdom and preceding an almost 2000-year-long hiatus in Jewish sovereignty in the Levant. In 63 BCE, the Roman Republic conquered the kingdom. In 37 BCE, the Romans appointed Herod the Great as king of a vassal Judea. In 6 CE, Judea was fully incorporated into the Roman Empire as the province of Judaea. Growing dissatisfaction with Roman rule and civil disturbances eventually led to the First Jewish–Roman War (66–73 CE), resulting in the destruction of Jerusalem and its Temple, which ended the Second Temple period.\nAs Second Temple Judaism developed, multiple religious currents emerged and extensive cultural, religious, and political developments occurred. The development of the Hebrew Bible canon, the synagogue and Jewish eschatology can be traced back to the Second Temple period. According to Jewish tradition, prophecy ceased during the early Second Temple period; this left the Jews without their version of divine guidance when they felt most in need of support and direction. Under Hellenistic rule, the growing influence of Hellenism in Judaism became a source of dissent for those Jews who clung to their monotheistic faith; this was a major catalyst for the Maccabean revolt. In the latter years of the period, Jewish society was deeply polarized along ideological lines, and the sects of the Pharisees, Sadducees, Essenes, Zealots, and early Christianity were formed. Important Jewish writings were also composed during the Second Temple period, including portions of the Hebrew Bible, such as the books of Ezra, Nehemiah, Esther and Daniel and writings that are a part of the Apocrypha and the Dead Sea Scrolls. Among the major sources for the time period are the writings of Josephus, Philo, the Books of the Maccabees, Greek and Roman writers and later Rabbinic literature.\nThe destruction of Jerusalem and the Second Temple in 70 CE is considered one of the most cataclysmic events in Jewish history. The loss of mother-city and temple necessitated a reshaping of Jewish culture to ensure its survival. Judaism's Temple-based sects disappeared. Rabbinic Judaism, centered around communal synagogue worsh",
  "fetched_at": "2026-02-09T05:46:52.880356"
}