{
  "url": "https://en.wikipedia.org/wiki/1988",
  "title": "1988",
  "text": "1988 (MCMLXXXVIII) was a leap year starting on Friday of the Gregorian calendar, the 1988th year of the Common Era (CE) and Anno Domini (AD) designations, the 988th  year of the 2nd millennium, the 88th  year of the 20th century, and the  9th   year of the 1980s decade.  \n1988 was a crucial year in the early history of the Internet—it was the year of the first well-known computer virus, the 1988 Internet worm. The first permanent intercontinental Internet link was made between the United States (National Science Foundation Network) and Europe (Nordunet) as well as the first Internet-based chat protocol, Internet Relay Chat. The concept of the World Wide Web was first discussed at CERN in 1988.\nThe Soviet Union began its major deconstructing towards a mixed economy at the beginning of 1988 and began its gradual dissolution. The Iron Curtain began to disintegrate in 1988 as Hungary began allowing freer travel to the Western world. The first extrasolar planet, Gamma Cephei Ab (confirmed in 2003), was detected this year and the World Health Organization began its mission to eradicate polio. Global warming also began to emerge as a more significant concern, with climate scientist James Hansen testifying before the U.S. Senate on the issue.\n\n\n== Events ==\n\n\n=== January ===\nJanuary – The cargo ship Khian Sea deposits 4,000 tons of toxic waste in Haiti after wandering around the Atlantic for sixteen months.\nJanuary 1 – The Soviet Union begins its program of economic restructuring (perestroika) with legislation initiated by Premier Mikhail Gorbachev (though Gorbachev had begun minor restructuring in 1985).\nJanuary 7–8 – In the Soviet-Afghan War, 39 men of the Soviet Airborne Troops from the 345th Independent Guards Airborne Regiment fight off an attack by 200 to 250 Mujahideen in the Battle for Hill 3234, later dramatized in the Russian film The 9th Company.\nJanuary 13 – Vice-president Lee Teng-hui takes over as President of the Republic of China and Chairman of the Kuomintang following the death of Chiang Ching-kuo.\nJanuary 26 – Upon request of Hubert Michon, archbishop of Rabat, two Trappist monks come to Fez and start a community that will later become the Priory of Our Lady of the Atlas.\n\n\n=== February ===\nFebruary 12 – The 1988 Black Sea bumping incident: Soviet frigate Bezzavetnyy intentionally rams USS Yorktown in Soviet territorial waters while Yorktown claims innocent passage. The accompanying US destroyer USS Caron escapes damage.\nFebruary 13–28 – The 1988 Winter Olympics are held in Calgary, Alberta, Canada.\nFebruary 17\n1988 Oshakati bomb blast: A bomb explodes outside the First National Bank in Oshakati, Namibia, killing 27 and injuring 70.\nU.S. Lieutenant Colonel William R. Higgins, serving with a United Nations group monitoring a truce in southern Lebanon, is kidnapped (and later killed by his captors).\nFebruary 20 – The Nagorno-Karabakh Autonomous Oblast votes to secede from the Azerbaijan Soviet Socialist Republic and join the Armenian SSR, triggering the First Nagorno-Karabakh War.\nFebruary 23 – Start of Anfal campaign, a genocidal counterinsurgency operation within the Iran–Iraq War carried out by Ba'athist Iraqi forces led by Ali Hassan al-Majid on the orders of President Saddam Hussein that will kill between 50,000 and 182,000 Kurds in Iraqi Kurdistan.\nFebruary 25 – The constitution of the Sixth Republic of Korea comes into effect.\nFebruary 27–29 – Collapse of the Soviet Union: The Sumgait pogrom of Armenians occurs in Sumqayit.\nFebruary 29 – A Nazi document implicates Kurt Waldheim in World War II deportations.\n\n\n=== March ===\nMarch 6 – Operation Flavius: A Special Air Service team of the British Army shoots dead 3 unarmed members of a Provisional Irish Republican Army (IRA) Active service unit in Gibraltar.\nMarch 16\nThe Halabja chemical attack is carried out by Iraqi government forces.\nIran–Contra affair: Lieutenant Colonel Oliver North and Vice Admiral John Poindexter are indicted on charges of conspiracy to defr",
  "fetched_at": "2026-02-09T05:19:49.426613"
}