{
  "url": "https://en.wikipedia.org/wiki/Christian_mortalism",
  "title": "Christian mortalism",
  "text": "Christian mortalism is the Christian belief that the human soul is not naturally immortal, and may include the belief that the soul is \"sleeping\" after death until the Resurrection of the Dead and the Last Judgment, a time known as the intermediate state. \"Soul sleep\" is often used as a pejorative term, so the more neutral term \"mortalism\" was also used in the nineteenth century, and \"Christian mortalism\" since the 1970s. Historically the term psychopannychism was also used, despite problems with the etymology and application. The term thnetopsychism has also been used; for example, Gordon Campbell (2008) identified John Milton as believing in the latter.\nChristian mortalism stands in contrast with the traditional Christian belief that the souls of the dead immediately go to heaven, or hell, or (in Catholicism) purgatory. Christian mortalism has been taught by several theologians and church organizations throughout history, while also facing opposition from aspects of Christian organized religion. The Catholic Church condemned such thinking in the Fifth Council of the Lateran as \"erroneous assertions\". Supporters include eighteenth-century religious figure Henry Layton, among many others.\n\n\n== Etymology and terminology ==\nSince the phrases \"soul sleep\" or \"soul death\" do not occur either in the Bible or in early Patristic materials, an explanation is required for the origin of the term. Additionally, several other terms have been introduced which relate to the view. Modern theologians have used the term \"Christian mortalism\" and related wordings from the 21st century onwards.\n\n\n=== Soul sleep ===\nThe phrase soul sleep appears to have been popularized by John Calvin in the subtitle to his Latin tract Psychopannychia (Psychopannychia (manuscript), Orléans, 1534, Psychopannychia (print) (in Latin), Strasbourg, 1542, Psychopannychia (in French) (2nd ed.), Geneva, 1558 [1545], Psychopannychia, 1581). The title of the booklet comes from Greek psyche (soul, mind) with pan-nychis (παν-νυχίς, all-night vigil, all-night banquet), so Psychopannychia, originally, represents Calvin's view that the soul was conscious and active after death.\nThe title and subtitle of the 1542 Strasbourg 1st edition read: Vivere apud Christum non-dormire animas sanctas qui in fide Christi decedunt. Assertio. [That the holy souls of those who die in the faith of Christ live with Christ and do not sleep. An Assertion.] (in Latin).\nThe title and subtitle of the 1545 2nd Latin edition read: Psychopannychia – qua repellitur quorundam imperitorum error qui animas post mortem usque ad ultimum iudicium dormire putant. [Psychopannychia – Or a refutation of the error entertained by some unskillful persons, who ignorantly imagine that in the interval between death and the judgment the soul sleeps.] (in Latin).\nThe 1558 French edition was a translation of that of the 1545 2nd edition: Psychopannychie – traitté par lequel est prouvé que les âmes veillent et vivent après qu'elles sont sorties des corps; contre l'erreur de quelques ignorans qui pensent qu'elles dorment jusque au dernier jugement.\n\n\n=== Other terms ===\n\"Psychopannychism\" – In the Latin it is clearer that Psychopannychia is actually the refutation of, the opposite of, the idea of soul sleep. The version Psychopannychie – La nuit ou le sommeil de l'âme [Psychopannychia – the night or the sleep of the soul] (in French), Geneva, 1558 may have caused the confusion that by -pannychis Calvin meant sleep (in Greek -hypnos, sleep, not -pannychis, vigil). The subtitle le sommeil de l'âme (in French) was taken up as Seelenschlaf [Soul-sleep] (in German). The tract first appeared in English as An excellent treatise of the Immortalytie of the Soule, translated by Stocker, T., London, 1581.\nLuther's use of similar language (but this time defending the view) appears in print only a few years after Calvin:\n\n …so the soul after death enters its chamber and peace, and sleeping does not feel its sleep \n\"Hypnopsychism\" – from h",
  "fetched_at": "2026-02-09T06:03:48.316143"
}