{
  "url": "https://en.wikipedia.org/wiki/Codex_Dublinensis",
  "title": "Codex Dublinensis",
  "text": "Codex Dublinensis is a Greek uncial manuscript of the New Testament Gospels, written on parchment. It is designated by Z or 035 in the Gregory-Aland numbering of New Testament manuscripts, and ε 26 in the von Soden numbering of New Testament manuscripts. Using the study of comparative writing styles (palaeography), it has been dated to the 6th century CE. The manuscript has several gaps.\nIt is a palimpsest manuscript, the upper layer containing excerpts from commentaries by early Church fathers.\n\n\n== Description ==\nThe manuscript is a codex (precursor to the modern book), containing a portions of the text of Gospel of Matthew on 32 parchment leaves (sixed 27 cm by 20 cm), with numerous gaps. The manuscript itself is a palimpsest (a manuscript with the initial text washed off, and then written over again with a different text), currently consisting of 110 folios from a likely total of 120, with 69 of these being palimpsest. The upper text is a patristic commentary written in a minuscule hand, with most of the commentary from the works of John Chrysostom. Other present comments are from the writings of Basil, Anastasius, Epiphanius, and Theodorus Abucara. The upper text is written with \"no elegance\" or \"magnificence\", and is much mutilated. The under-text is written in one column per page, 21 lines per column, with 27 letters per line. The original parchment was purplish in colour, rather thin, and the writing on one side shows through to the other in many places, and there are many holes present. The manuscript has been rebound at some point between 1801 and 1853, to which biblical scholar Samuel Tregelles decries:\n\nThe binder simply seems to have known of the Greek book in the cursive letters, which are all black and plain to the eye. And so the pages have been unmercifully strengthened in parts, by pasting paper or vellum over the margins, leaving indeed the cursive writing untouched, but burying the uncial letters, of so much greater value... Also in places there were fragments all rough at the edges of the leaves, and these have been cut away so as to make all smooth and neat ; and thus many words and parts of words read by Dr. Barrett are now gone irrecoverably.\nAccording to biblical scholar Bruce Metzger, the uncial letters are large and broad, and biblical scholar T. K Abbott describes the letters as \"beautifully formed.\" The letters are larger than in codices Alexandrinus and Vaticanus, but smaller than in Codex Petropolitanus Purpureus. Itacistic errors are present, e.g. αι confused with ε, and ι with ει. The letters have no breathings or accents, and the Old Testament quotations are indicated by a diplai (>). The letter μ (mu) is very peculiar, looking more like an inverted Π (pi). The codex contains the Ammonian Sections, but there is no Eusebian Canons. The conventional nomina sacra are present, with several sometimes being written out in full (μητηρ / mother, ουρανος  / heaven/sky, ανθρωπος / man/human, and υιος / son).\n\nContents\n\nMatthew 1:17-2:6, 2:13-20, 4:4-13, 5:45-6:15, 7:16-8:6, 10:40-11:18, 12:43-13:11, 13:57-14:19, 15:13-23, 17:9-17, 17:26-18:6, 19:4-12, 21-28, 20:7-21:8, 21:23-30, 22:16-25, 22:37-23:3, 23:15-23, 24:15-25, 25:1-11, 26:21-29, 62-71.\n\n\n== Text ==\nThe Greek text of this codex is considered a representative of the Alexandrian text-type, with many alien readings. The Alexandrian text is similar to that seen in Codex Sinaiticus. Textual critic and biblical scholar Kurt Aland placed it in Category III of his New Testment manuscript classification system. Category III manuscripts are described as having \"a small but not a negligible proportion of early readings, with a considerable encroachment of [Byzantine] readings, and significant readings from other sources as yet unidentified.\"\nThe Lord's Prayer (Matthew 6:13) does not contain the usual doxology: οτι σου εστιν η βασιλεια και η δυναμις και η δοξα εις τους αιωνας (because the kingdom and the power and the glory is yours, forever) as in codices",
  "fetched_at": "2026-02-09T02:48:16.740793"
}