{
  "url": "https://en.wikipedia.org/wiki/First_Nations_in_Canada",
  "title": "First Nations in Canada",
  "text": "First Nations (French: Premières Nations) is a term used to identify Indigenous peoples in Canada who are neither Inuit nor Métis. Traditionally, First Nations in Canada were peoples who lived south of the tree line, and mainly south of the Arctic Circle. There are 634 recognized First Nations governments or bands across Canada. Roughly half are located in the provinces of Ontario and British Columbia.\nUnder federal employment equity law, First Nations are a \"designated group\", along with women, visible minorities, and people with physical or mental disabilities. First Nations are not included in the Statistics Canada visible minority category, as there is a separate category for First Nations, Metis and Inuit.\nNorth American indigenous peoples have cultures spanning thousands of years. Many of their oral traditions accurately describe historical events, such as the Cascadia earthquake of 1700 and the 18th-century Tseax Cone eruption. Written records began with the arrival of European explorers and colonists during the Age of Discovery in the late 15th century. European accounts by trappers, traders, explorers, and missionaries give important evidence of early contact culture. In addition, archeological and anthropological research, as well as linguistics, have helped scholars piece together an understanding of ancient cultures and historic peoples.\n\n\n== Terminology ==\n\nCollectively, First Nations (Indians), Inuit, and Métis peoples constitute Indigenous peoples in Canada, Indigenous peoples of the Americas, or \"first peoples\". First Nation as a term became officially used by the government beginning in 1980s to replace the term Indian band in referring to groups of Indians with common government and language. The First Nations people had begun to identify by this term during 1970s activism, in order to avoid using the word Indian, which some considered offensive. No legal definition of the term exists.\nSome Indigenous peoples in Canada have also adopted the term First Nation to replace the word band in the formal name of their community. A band is a \"body of Indians (a) for whose use and benefit in common lands ... have been set apart, (b) ... moneys are held ... or (c) declared ... to be a band for the purposes of\", according to the Indian Act by the Canadian Crown.\nThe term Indian is a misnomer, given to Indigenous peoples of North America by European explorers who erroneously thought they had landed in the East Indies. The use of term like Native Americans or American Indians, which the government and others have adopted in the United States, is not common in Canada. It refers more specifically to the Indigenous peoples residing within the boundaries of the US. The parallel term Native Canadian is not commonly used, but Native (in English) and Autochtone (in Canadian French; from the Greek auto, own, and chthon, land) are. Under the Royal Proclamation of 1763, also known as the \"Indian Magna Carta,\" the Crown referred to Indigenous peoples in British territory as tribes or nations. The term First Nations is capitalized. Bands and nations may have slightly different meanings.\nWithin Canada, the term First Nations has come into general use for Indigenous peoples other than Inuit and Métis. Outside Canada, the term can refer to Indigenous Australians, U.S. tribes within the Pacific Northwest, as well as supporters of the Cascadian independence movement. The singular, commonly used on culturally politicized reserves, is the term First Nations person  (when gender-specific, First Nations man or First Nations woman). Since the late 20th century, members of various nations more frequently identify by their tribal or national identity only, e.g., \"I'm Haida\", or \"We're Kwantlens\", in recognition of the distinct First Nations.\n\n\n== History ==\n\n\n=== Nationhood ===\nFirst Nations by linguistic-cultural area: List of First Nations peoples\nFirst Nations peoples had settled and established trade routes across what is now Canada by 500 BC",
  "fetched_at": "2026-02-09T05:57:43.727694"
}