{
  "url": "https://en.wikipedia.org/wiki/Zweli_Mkhize",
  "title": "Zweli Mkhize",
  "text": "Zwelini Lawrence Mkhize (born 2 February 1956) is a South African medical doctor and politician who served as the Minister of Health from May 2019 until his resignation on 5 August 2021. He previously served as the Minister of Cooperative Governance and Traditional Affairs from 2018 to 2019. Before that, he was the fifth Premier of KwaZulu-Natal from 2009 to 2013. He was also the Chancellor of the University of KwaZulu-Natal from 2009 to 2017.\nA former anti-apartheid activist in Umkhonto we Sizwe, Mkhize was formerly a provincial politician in his home province of KwaZulu-Natal, with particular influence in the KwaZulu-Natal midlands. He was a Member of the Executive Council in the provincial government between 1994 and 2004 and was elected provincial chairperson of the African National Congress (ANC) in 2008. He rose to national prominence in 2012 when he was elected national Treasurer-General of the ANC at the party's 53rd National Conference. He also campaigned unsuccessfully for the ANC presidency ahead of the 55th National Conference in 2022.\nAs Minister of Health under President Cyril Ramaphosa, Mkhize played a central role in South Africa's response to the COVID-19 pandemic. However, he resigned in 2021 amid allegations that he and his family had benefitted improperly from a state contract awarded by the Department of Health to a communications company called Digital Vibes. Special Investigation Unit  (SIU) says  Mkhize  family benefited from R11.5 million rands of digital vibes funds that bought  themselves a farm and cattle.\n\n\n== Early life and career ==\nZweli Lawrence Mkhize was born on 2 February 1956 in Willowfontein on the outskirts of Pietermaritzburg in what is now KwaZulu-Natal province. He was the fifth of seven children. He belongs to the Zulu Mkhize clan, formerly of the Nkandla region, but, by the time of the advent of apartheid in 1948, his family was bound to farm labour by a labour tenancy agreement. His father later worked for the parks department of the Pietermaritzburg Corporation while his elder brothers worked as farm hands, but Mkhize continued his formal education. He attended secondary school at Dlangezwa High School, a boarding school in Zululand, where he was a strong student. He later said that the anti-apartheid protests of a local \"eccentric\", David Cecil Oxford Matiwane, sparked his interest in politics.\nIn 1976, the year of the Soweto uprising, Mkhize began medical school at the University of Natal, where he was a member of the students' representative council. He graduated with an MBChB in 1982, completed his internship at McCord Hospital in Durban in 1983, and began work at Edendale Hospital in Pietermaritzburg in 1984.\n\n\n== Anti-apartheid activism ==\nBy the mid-1980s, Mkhize was a member of Umkhonto weSizwe (MK), the underground armed wing of the anti-apartheid African National Congress (ANC), and was connected to other ANC figures in the KwaZulu-Natal midlands, including Harry Gwala. He went into exile in Swaziland in 1986. According to the Daily Maverick, his departure from South Africa was related to police attention to Operation Butterfly, the codename for an MK plan to bomb important infrastructure in KwaZulu-Natal; eleven other people involved in the plan had been arrested in late 1985, during a government state of emergency. In exile in Swaziland and then in Zimbabwe, Mkhize continued to practice medicine; he often treated wounded MK combatants. He also continued his work with MK and by 1987 he was a commander in charge of underground cells which operated in KwaZulu-Natal.\nHe returned to South Africa in 1991 after the ANC had been unbanned by the South African government. He initially worked at Themba Hospital in what was then the Eastern Transvaal, but opened a private medical practice in Pietermaritzburg in late 1991. He, along with his MK colleague Jacob Zuma, became an ANC peace broker in the ongoing political violence in KwaZulu-Natal: ANC-aligned groups and Inkatha-aligned ",
  "fetched_at": "2026-02-09T06:18:40.796355"
}