{
  "url": "https://en.wikipedia.org/wiki/God_of_War_(franchise)",
  "title": "God of War (franchise)",
  "text": "God of War is an action-adventure game franchise created by David Jaffe and developed by Sony's Santa Monica Studio. It began in 2005 on the PlayStation 2 (PS2) video game console and has become a flagship series for PlayStation, consisting of nine installments across multiple platforms. Based on ancient mythologies, the series' plot follows Kratos, a Spartan warrior who becomes the God of War and comes into conflict with various mythological pantheons. The earlier games in the series are based on Greek mythology and see Kratos follow a path of vengeance against the Olympian gods; the later games are based on Norse mythology and see Kratos on a path of redemption while also introducing his son Atreus as a secondary protagonist, as they come into conflict or interact with various Norse deities and figures.\nSanta Monica Studio has developed all main entries, while Ready at Dawn and Javaground/Sony Online Entertainment-Los Angeles (SOE-LA) developed the three side games. Sony Interactive Entertainment (SIE) has published all games except the mobile phone installment, which was published by Sony Pictures Digital. The first seven games make up the Greek era of the franchise. God of War (2005), God of War II (2007) and God of War III (2010) comprise its main trilogy; the first two were released on the PS2 with the third on the PlayStation 3 (PS3). A prequel, Ascension (2013), was also released for the PS3. Other games include Chains of Olympus (2008) and Ghost of Sparta (2010) for the PlayStation Portable (PSP) and Betrayal (2007) for mobile phones that supported the Java Platform, Micro Edition (Java ME). The Norse era began with the 2018 game God of War, which was released for the PlayStation 4 (PS4) and later Windows in January 2022. It was accompanied by a short prequel, A Call from the Wilds (2018), a text-based game through Facebook Messenger. A sequel, Ragnarök, was released in November 2022 for the PS4 and PlayStation 5 (PS5) and concluded the Norse era, which received an epilogue in the form of an expansion pack titled Valhalla in December 2023; a Windows port of Ragnarök with Valhalla was released in September 2024.\nGames in the series have been praised as some of the best action games of all time. The series has received numerous awards, including several Game of the Year recognitions for the 2005 and 2018 installments. Some games have also been remastered for newer PlayStation platforms. As of November 2023, the franchise has sold an estimated 66+ million games worldwide, and is PlayStation's most profitable first-party brand. Strong sales and support of the series led to the franchise's expansion into other media, such as three comic book series and three novels. A film adaptation of the original installment had been in development but was ultimately canceled; however, a television series adaptation of the Norse era is in development for Amazon Prime Video. Merchandise includes artwork, clothing, toys, and prop replicas, as well as the games' soundtracks, including a heavy metal album, Blood & Metal (2010), featuring original music by various bands, who were inspired by the Greek era of the series.\n\n\n== Games ==\n\n\n=== Greek mythology ===\nGod of War was first released in North America on March 22, 2005, for the PlayStation 2. After ten years in the service of the Olympian gods, Spartan soldier Kratos is tasked by Athena to find Pandora's box, the key to defeating Ares, the God of War, who is running amok through Athens. A series of flashbacks reveals that Kratos was once the servant of Ares, who saved Kratos and his army from annihilation in battle, but tricked him into killing his family, which forced his metamorphosis into the \"Ghost of Sparta\". Kratos eventually finds Pandora's Box, and after finally killing Ares, he ascends to Mount Olympus to become the new God of War.\nGod of War II was first released in North America on March 13, 2007, for the PlayStation 2. Angry at his fellow gods, Kratos runs amok across the cit",
  "fetched_at": "2026-02-09T05:38:58.643226"
}